{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Young/Dropbox/Collin/Project_Code/Log/results.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}12 Nov 2015, 02:15:49
{txt}
{com}. log on
{txt}(log already on)

{com}. 
. do "/Users/Young/Dropbox/Collin/Project_Code/Do_Files/baseline_linear.do"
{txt}
{com}. ******************************************************************
. * This do-file 
. *       reads in the APL 08 and 12 Election Data
. *       Runs Linear Baseline Regressions on Data
. *       Created: 18/03/2015, by Collin Raymond and Yang Lu
. *       This version:
. ******************************************************************
. 
. /*
> THIS FILE CREATES PROCESSED FILES FROM RAW FILES.
> EDIT THE cd and globals BEFORE RUNNING THIS FILE
> */
. 
. 
. cd "/Users/Young/Dropbox/Collin/Project_Code"
{res}/Users/Young/Dropbox/Collin/Project_Code
{txt}
{com}. 
. global raw_data     "/Users/Young/Dropbox/Collin/Project_Code/Raw_Data"
{txt}
{com}. global data_pro         "/Users/Young/Dropbox/Collin/Project_Code/Output_Data"
{txt}
{com}. 
. set more off 
{txt}
{com}. 
. use "$data_pro/combined0812", clear
{txt}
{com}. 
. /// Partisanship && Diffeight///
> 
. /// 2008 Alone ///
> 
. reg diffeight2008 supportdummy2008, cluster(case_id) 

{txt}Linear regression                                      Number of obs ={res}     970
                                                       {txt}F(  1,   969) ={res}   62.52
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0607
                                                       {txt}Root MSE      = {res}  14.71

{txt}{ralign 82:(Std. Err. adjusted for {res:970} clusters in case_id)}
{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 18}{c |}{col 30}    Robust
{col 1}   diffeight2008{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
supportdummy2008 {c |}{col 18}{res}{space 2} 7.470148{col 30}{space 2} .9447347{col 41}{space 1}    7.91{col 50}{space 3}0.000{col 58}{space 4} 5.616186{col 71}{space 3}  9.32411
{txt}{space 11}_cons {c |}{col 18}{res}{space 2}-4.639959{col 30}{space 2} .6633522{col 41}{space 1}   -6.99{col 50}{space 3}0.000{col 58}{space 4}-5.941732{col 71}{space 3}-3.338187
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffeight2008 supportdummy2008 abspart2008  interabspartobamasup_2008, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}     967
                                                       {txt}F(  3,   966) ={res}   24.20
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0727
                                                       {txt}Root MSE      = {res} 14.605

{txt}{ralign 91:(Std. Err. adjusted for {res:967} clusters in case_id)}
{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39}    Robust
{col 1}            diffeight2008{col 27}{c |}      Coef.{col 39}   Std. Err.{col 51}      t{col 59}   P>|t|{col 67}     [95% Con{col 80}f. Interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}supportdummy2008 {c |}{col 27}{res}{space 2}-.9777657{col 39}{space 2}  2.74712{col 50}{space 1}   -0.36{col 59}{space 3}0.722{col 67}{space 4}-6.368776{col 80}{space 3} 4.413244
{txt}{space 14}abspart2008 {c |}{col 27}{res}{space 2}-7.732663{col 39}{space 2} 2.508445{col 50}{space 1}   -3.08{col 59}{space 3}0.002{col 67}{space 4}-12.65529{col 80}{space 3}-2.810032
{txt}interabspartobamasup_2008 {c |}{col 27}{res}{space 2}  11.5091{col 39}{space 2} 3.557764{col 50}{space 1}    3.23{col 59}{space 3}0.001{col 67}{space 4}  4.52726{col 80}{space 3} 18.49093
{txt}{space 20}_cons {c |}{col 27}{res}{space 2} 1.095353{col 39}{space 2}  1.89735{col 50}{space 1}    0.58{col 59}{space 3}0.564{col 67}{space 4}-2.628049{col 80}{space 3} 4.818755
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffeight2008 abspart2008  interabspartobamasup_2008, cluster(case_id) 

{txt}Linear regression                                      Number of obs ={res}     967
                                                       {txt}F(  2,   966) ={res}   36.31
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0726
                                                       {txt}Root MSE      = {res} 14.599

{txt}{ralign 91:(Std. Err. adjusted for {res:967} clusters in case_id)}
{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39}    Robust
{col 1}            diffeight2008{col 27}{c |}      Coef.{col 39}   Std. Err.{col 51}      t{col 59}   P>|t|{col 67}     [95% Con{col 80}f. Interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}abspart2008 {c |}{col 27}{res}{space 2}-7.141113{col 39}{space 2} 1.908293{col 50}{space 1}   -3.74{col 59}{space 3}0.000{col 67}{space 4}-10.88599{col 80}{space 3}-3.396236
{txt}interabspartobamasup_2008 {c |}{col 27}{res}{space 2} 10.33888{col 39}{space 2} 1.217018{col 50}{space 1}    8.50{col 59}{space 3}0.000{col 67}{space 4} 7.950575{col 80}{space 3} 12.72718
{txt}{space 20}_cons {c |}{col 27}{res}{space 2} .6014839{col 39}{space 2} 1.372797{col 50}{space 1}    0.44{col 59}{space 3}0.661{col 67}{space 4}-2.092524{col 80}{space 3} 3.295492
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffeight2008 supportdummy2008 surprise39 surprisesupportinteraction_2008, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}     969
                                                       {txt}F(  3,   968) ={res}   23.07
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0766
                                                       {txt}Root MSE      = {res} 14.603

{txt}{ralign 97:(Std. Err. adjusted for {res:969} clusters in case_id)}
{hline 32}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 33}{c |}{col 45}    Robust
{col 1}                  diffeight2008{col 33}{c |}      Coef.{col 45}   Std. Err.{col 57}      t{col 65}   P>|t|{col 73}     [95% Con{col 86}f. Interval]
{hline 32}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}supportdummy2008 {c |}{col 33}{res}{space 2} 1.417756{col 45}{space 2} 2.024039{col 56}{space 1}    0.70{col 65}{space 3}0.484{col 73}{space 4}-2.554253{col 86}{space 3} 5.389765
{txt}{space 21}surprise39 {c |}{col 33}{res}{space 2}-12.27148{col 45}{space 2} 3.125068{col 56}{space 1}   -3.93{col 65}{space 3}0.000{col 73}{space 4}-18.40417{col 86}{space 3}-6.138797
{txt}surprisesupportinteraction_2008 {c |}{col 33}{res}{space 2} 12.02825{col 45}{space 2} 5.264629{col 56}{space 1}    2.28{col 65}{space 3}0.023{col 73}{space 4} 1.696846{col 86}{space 3} 22.35965
{txt}{space 26}_cons {c |}{col 33}{res}{space 2} 1.475593{col 45}{space 2} 1.506831{col 56}{space 1}    0.98{col 65}{space 3}0.328{col 73}{space 4}-1.481439{col 86}{space 3} 4.432625
{txt}{hline 32}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffeight2008 surprise39 surprisesupportinteraction_2008, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}     969
                                                       {txt}F(  2,   968) ={res}   33.55
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0761
                                                       {txt}Root MSE      = {res} 14.599

{txt}{ralign 97:(Std. Err. adjusted for {res:969} clusters in case_id)}
{hline 32}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 33}{c |}{col 45}    Robust
{col 1}                  diffeight2008{col 33}{c |}      Coef.{col 45}   Std. Err.{col 57}      t{col 65}   P>|t|{col 73}     [95% Con{col 86}f. Interval]
{hline 32}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 21}surprise39 {c |}{col 33}{res}{space 2}-13.78507{col 45}{space 2}  2.30103{col 56}{space 1}   -5.99{col 65}{space 3}0.000{col 73}{space 4}-18.30065{col 86}{space 3} -9.26949
{txt}surprisesupportinteraction_2008 {c |}{col 33}{res}{space 2} 14.94211{col 45}{space 2} 2.646046{col 56}{space 1}    5.65{col 65}{space 3}0.000{col 73}{space 4}  9.74946{col 86}{space 3} 20.13475
{txt}{space 26}_cons {c |}{col 33}{res}{space 2}   2.3765{col 45}{space 2} 1.020061{col 56}{space 1}    2.33{col 65}{space 3}0.020{col 73}{space 4} .3747155{col 86}{space 3} 4.378285
{txt}{hline 32}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffeight2008 supportdummy2008  inttimesupportdummy_2008 time2008, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}     962
                                                       {txt}F(  3,   961) ={res}   22.73
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0671
                                                       {txt}Root MSE      = {res} 14.718

{txt}{ralign 90:(Std. Err. adjusted for {res:962} clusters in case_id)}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}           diffeight2008{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}supportdummy2008 {c |}{col 26}{res}{space 2}    8.494{col 38}{space 2} 1.041472{col 49}{space 1}    8.16{col 58}{space 3}0.000{col 66}{space 4} 6.450178{col 79}{space 3} 10.53782
{txt}inttimesupportdummy_2008 {c |}{col 26}{res}{space 2}-.1924866{col 38}{space 2} .0718817{col 49}{space 1}   -2.68{col 58}{space 3}0.008{col 66}{space 4}-.3335497{col 79}{space 3}-.0514235
{txt}{space 16}time2008 {c |}{col 26}{res}{space 2} .0725915{col 38}{space 2} .0563738{col 49}{space 1}    1.29{col 58}{space 3}0.198{col 66}{space 4}-.0380385{col 79}{space 3} .1832214
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-5.030893{col 38}{space 2} .7335817{col 49}{space 1}   -6.86{col 58}{space 3}0.000{col 66}{space 4}  -6.4705{col 79}{space 3}-3.591287
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg  diffeight2008 supportdummy2008  inttimesupportdummy_2008 adjtime2008, cluster(case_id) $adjtime

{txt}Linear regression                                      Number of obs ={res}     962
                                                       {txt}F(  3,   961) ={res}   22.73
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0671
                                                       {txt}Root MSE      = {res} 14.718

{txt}{ralign 90:(Std. Err. adjusted for {res:962} clusters in case_id)}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}           diffeight2008{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}supportdummy2008 {c |}{col 26}{res}{space 2}    8.494{col 38}{space 2} 1.041472{col 49}{space 1}    8.16{col 58}{space 3}0.000{col 66}{space 4} 6.450178{col 79}{space 3} 10.53782
{txt}inttimesupportdummy_2008 {c |}{col 26}{res}{space 2}-.1924866{col 38}{space 2} .0718817{col 49}{space 1}   -2.68{col 58}{space 3}0.008{col 66}{space 4}-.3335497{col 79}{space 3}-.0514235
{txt}{space 13}adjtime2008 {c |}{col 26}{res}{space 2} .0725915{col 38}{space 2} .0563738{col 49}{space 1}    1.29{col 58}{space 3}0.198{col 66}{space 4}-.0380385{col 79}{space 3} .1832214
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-4.958302{col 38}{space 2} .7108561{col 49}{space 1}   -6.98{col 58}{space 3}0.000{col 66}{space 4}-6.353311{col 79}{space 3}-3.563293
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. /// 2012 Alone ///
> 
. reg diffeight2012 supportdummy2012, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    5242
                                                       {txt}F(  1,  1768) ={res}   28.71
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0107
                                                       {txt}Root MSE      = {res}  16.13

{txt}{ralign 82:(Std. Err. adjusted for {res:1769} clusters in case_id)}
{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 18}{c |}{col 30}    Robust
{col 1}   diffeight2012{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
supportdummy2012 {c |}{col 18}{res}{space 2} 3.396987{col 30}{space 2} .6339571{col 41}{space 1}    5.36{col 50}{space 3}0.000{col 58}{space 4} 2.153602{col 71}{space 3} 4.640371
{txt}{space 11}_cons {c |}{col 18}{res}{space 2}-1.280018{col 30}{space 2} .4789345{col 41}{space 1}   -2.67{col 50}{space 3}0.008{col 58}{space 4}-2.219356{col 71}{space 3}-.3406806
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffeight2012  abspart2012  interabspartobamasup_2012, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    5239
                                                       {txt}F(  2,  1767) ={res}   18.98
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0145
                                                       {txt}Root MSE      = {res} 16.103

{txt}{ralign 91:(Std. Err. adjusted for {res:1768} clusters in case_id)}
{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39}    Robust
{col 1}            diffeight2012{col 27}{c |}      Coef.{col 39}   Std. Err.{col 51}      t{col 59}   P>|t|{col 67}     [95% Con{col 80}f. Interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}abspart2012 {c |}{col 27}{res}{space 2}-3.022503{col 39}{space 2}  1.26038{col 50}{space 1}   -2.40{col 59}{space 3}0.017{col 67}{space 4}-5.494495{col 80}{space 3} -.550511
{txt}interabspartobamasup_2012 {c |}{col 27}{res}{space 2} 5.130471{col 39}{space 2} .8383358{col 50}{space 1}    6.12{col 59}{space 3}0.000{col 67}{space 4} 3.486236{col 80}{space 3} 6.774705
{txt}{space 20}_cons {c |}{col 27}{res}{space 2} .6688352{col 39}{space 2} .8512769{col 50}{space 1}    0.79{col 59}{space 3}0.432{col 67}{space 4}-1.000781{col 80}{space 3} 2.338451
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffeight2012 supportdummy2012 surprise303 surprisesupportinteraction_2012, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    5239
                                                       {txt}F(  3,  1767) ={res}    9.80
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0112
                                                       {txt}Root MSE      = {res} 16.133

{txt}{ralign 97:(Std. Err. adjusted for {res:1768} clusters in case_id)}
{hline 32}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 33}{c |}{col 45}    Robust
{col 1}                  diffeight2012{col 33}{c |}      Coef.{col 45}   Std. Err.{col 57}      t{col 65}   P>|t|{col 73}     [95% Con{col 86}f. Interval]
{hline 32}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}supportdummy2012 {c |}{col 33}{res}{space 2} 1.490213{col 45}{space 2} 2.049822{col 56}{space 1}    0.73{col 65}{space 3}0.467{col 73}{space 4}-2.530117{col 86}{space 3} 5.510544
{txt}{space 20}surprise303 {c |}{col 33}{res}{space 2}-2.994817{col 45}{space 2}  3.11564{col 56}{space 1}   -0.96{col 65}{space 3}0.337{col 73}{space 4}-9.105546{col 86}{space 3} 3.115911
{txt}surprisesupportinteraction_2012 {c |}{col 33}{res}{space 2} 3.545239{col 45}{space 2} 4.049397{col 56}{space 1}    0.88{col 65}{space 3}0.381{col 73}{space 4}-4.396874{col 86}{space 3} 11.48735
{txt}{space 26}_cons {c |}{col 33}{res}{space 2} .4580615{col 45}{space 2} 1.862155{col 56}{space 1}    0.25{col 65}{space 3}0.806{col 73}{space 4}-3.194197{col 86}{space 3}  4.11032
{txt}{hline 32}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffeight2012 surprise303 surprisesupportinteraction_2012, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    5239
                                                       {txt}F(  2,  1767) ={res}   13.66
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0109
                                                       {txt}Root MSE      = {res} 16.133

{txt}{ralign 97:(Std. Err. adjusted for {res:1768} clusters in case_id)}
{hline 32}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 33}{c |}{col 45}    Robust
{col 1}                  diffeight2012{col 33}{c |}      Coef.{col 45}   Std. Err.{col 57}      t{col 65}   P>|t|{col 73}     [95% Con{col 86}f. Interval]
{hline 32}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 20}surprise303 {c |}{col 33}{res}{space 2}-4.893995{col 45}{space 2} 1.497331{col 56}{space 1}   -3.27{col 65}{space 3}0.001{col 73}{space 4}-7.830722{col 86}{space 3}-1.957268
{txt}surprisesupportinteraction_2012 {c |}{col 33}{res}{space 2} 6.106206{col 45}{space 2} 1.693191{col 56}{space 1}    3.61{col 65}{space 3}0.000{col 73}{space 4} 2.785338{col 86}{space 3} 9.427075
{txt}{space 26}_cons {c |}{col 33}{res}{space 2} 1.671721{col 45}{space 2} .7785193{col 56}{space 1}    2.15{col 65}{space 3}0.032{col 73}{space 4} .1448051{col 86}{space 3} 3.198637
{txt}{hline 32}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg  diffeight2012 supportdummy2012  inttimesupportdummy_2012 time2012, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    5115
                                                       {txt}F(  3,  1738) ={res}   15.84
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0164
                                                       {txt}Root MSE      = {res} 16.071

{txt}{ralign 90:(Std. Err. adjusted for {res:1739} clusters in case_id)}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}           diffeight2012{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}supportdummy2012 {c |}{col 26}{res}{space 2} 5.393627{col 38}{space 2} .8259131{col 49}{space 1}    6.53{col 58}{space 3}0.000{col 66}{space 4} 3.773739{col 79}{space 3} 7.013515
{txt}inttimesupportdummy_2012 {c |}{col 26}{res}{space 2}-.2620223{col 38}{space 2} .0603216{col 49}{space 1}   -4.34{col 58}{space 3}0.000{col 66}{space 4}-.3803329{col 79}{space 3}-.1437117
{txt}{space 16}time2012 {c |}{col 26}{res}{space 2} .2308196{col 38}{space 2} .0471185{col 49}{space 1}    4.90{col 58}{space 3}0.000{col 66}{space 4} .1384046{col 79}{space 3} .3232346
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-3.061559{col 38}{space 2} .6413722{col 49}{space 1}   -4.77{col 58}{space 3}0.000{col 66}{space 4}-4.319501{col 79}{space 3}-1.803617
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg  diffeight2012 supportdummy2012  inttimesupportdummy_2012 adjtime2012, cluster(case_id) $adjtime

{txt}Linear regression                                      Number of obs ={res}    5115
                                                       {txt}F(  3,  1738) ={res}   15.84
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0164
                                                       {txt}Root MSE      = {res} 16.071

{txt}{ralign 90:(Std. Err. adjusted for {res:1739} clusters in case_id)}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}           diffeight2012{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}supportdummy2012 {c |}{col 26}{res}{space 2} 5.393627{col 38}{space 2} .8259131{col 49}{space 1}    6.53{col 58}{space 3}0.000{col 66}{space 4} 3.773739{col 79}{space 3} 7.013515
{txt}inttimesupportdummy_2012 {c |}{col 26}{res}{space 2}-.2620223{col 38}{space 2} .0603216{col 49}{space 1}   -4.34{col 58}{space 3}0.000{col 66}{space 4}-.3803329{col 79}{space 3}-.1437117
{txt}{space 13}adjtime2012 {c |}{col 26}{res}{space 2} .2308196{col 38}{space 2} .0471185{col 49}{space 1}    4.90{col 58}{space 3}0.000{col 66}{space 4} .1384046{col 79}{space 3} .3232346
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-2.830739{col 38}{space 2}  .610737{col 49}{space 1}   -4.63{col 58}{space 3}0.000{col 66}{space 4}-4.028596{col 79}{space 3}-1.632883
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. /// 08 and 12 Combined ///
> 
. reg diffeight supportdummy, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    6212
                                                       {txt}F(  1,  2244) ={res}   55.21
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0161
                                                       {txt}Root MSE      = {res} 15.939

{txt}{ralign 78:(Std. Err. adjusted for {res:2245} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   diffeight{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
supportdummy {c |}{col 14}{res}{space 2} 4.107357{col 26}{space 2} .5527656{col 37}{space 1}    7.43{col 46}{space 3}0.000{col 54}{space 4} 3.023371{col 67}{space 3} 5.191342
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.893519{col 26}{space 2} .4123434{col 37}{space 1}   -4.59{col 46}{space 3}0.000{col 54}{space 4}-2.702133{col 67}{space 3}-1.084904
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffeight supportdummy abspart interabspartobamasup, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    6206
                                                       {txt}F(  3,  2241) ={res}   23.69
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0216
                                                       {txt}Root MSE      = {res} 15.894

{txt}{ralign 86:(Std. Err. adjusted for {res:2242} clusters in case_id)}
{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 22}{c |}{col 34}    Robust
{col 1}           diffeight{col 22}{c |}      Coef.{col 34}   Std. Err.{col 46}      t{col 54}   P>|t|{col 62}     [95% Con{col 75}f. Interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}supportdummy {c |}{col 22}{res}{space 2}-2.059149{col 34}{space 2} 1.487111{col 45}{space 1}   -1.38{col 54}{space 3}0.166{col 62}{space 4}-4.975409{col 75}{space 3} .8571106
{txt}{space 13}abspart {c |}{col 22}{res}{space 2}  -5.2089{col 34}{space 2} 1.382343{col 45}{space 1}   -3.77{col 54}{space 3}0.000{col 62}{space 4}-7.919706{col 75}{space 3}-2.498094
{txt}interabspartobamasup {c |}{col 22}{res}{space 2} 8.543347{col 34}{space 2}  1.94966{col 45}{space 1}    4.38{col 54}{space 3}0.000{col 62}{space 4} 4.720018{col 75}{space 3} 12.36668
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 1.803281{col 34}{space 2} .9982436{col 45}{space 1}    1.81{col 54}{space 3}0.071{col 62}{space 4}-.1542982{col 75}{space 3} 3.760859
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffeight abspart interabspartobamasup, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    6206
                                                       {txt}F(  2,  2241) ={res}   34.95
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0210
                                                       {txt}Root MSE      = {res} 15.898

{txt}{ralign 86:(Std. Err. adjusted for {res:2242} clusters in case_id)}
{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 22}{c |}{col 34}    Robust
{col 1}           diffeight{col 22}{c |}      Coef.{col 34}   Std. Err.{col 46}      t{col 54}   P>|t|{col 62}     [95% Con{col 75}f. Interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}abspart {c |}{col 22}{res}{space 2}-3.857961{col 34}{space 2} 1.101219{col 45}{space 1}   -3.50{col 54}{space 3}0.000{col 62}{space 4}-6.017476{col 75}{space 3}-1.698446
{txt}interabspartobamasup {c |}{col 22}{res}{space 2} 6.070504{col 34}{space 2} .7271576{col 45}{space 1}    8.35{col 54}{space 3}0.000{col 62}{space 4} 4.644531{col 75}{space 3} 7.496477
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} .6929908{col 34}{space 2} .7553701{col 45}{space 1}    0.92{col 54}{space 3}0.359{col 62}{space 4}-.7883074{col 75}{space 3} 2.174289
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffeight supportdummy surprise surprisesupportinteraction, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    6208
                                                       {txt}F(  3,  2243) ={res}   18.85
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0170
                                                       {txt}Root MSE      = {res} 15.937

{txt}{ralign 92:(Std. Err. adjusted for {res:2244} clusters in case_id)}
{hline 27}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 28}{c |}{col 40}    Robust
{col 1}                 diffeight{col 28}{c |}      Coef.{col 40}   Std. Err.{col 52}      t{col 60}   P>|t|{col 68}     [95% Con{col 81}f. Interval]
{hline 27}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}supportdummy {c |}{col 28}{res}{space 2} 1.729651{col 40}{space 2} 1.584567{col 51}{space 1}    1.09{col 60}{space 3}0.275{col 68}{space 4}-1.377719{col 81}{space 3} 4.837021
{txt}{space 18}surprise {c |}{col 28}{res}{space 2}-3.997631{col 40}{space 2} 2.407083{col 51}{space 1}   -1.66{col 60}{space 3}0.097{col 68}{space 4}-8.717975{col 81}{space 3} .7227125
{txt}surprisesupportinteraction {c |}{col 28}{res}{space 2} 4.373512{col 40}{space 2} 3.358325{col 51}{space 1}    1.30{col 60}{space 3}0.193{col 68}{space 4}-2.212237{col 81}{space 3} 10.95926
{txt}{space 21}_cons {c |}{col 28}{res}{space 2} .3697765{col 40}{space 2} 1.391473{col 51}{space 1}    0.27{col 60}{space 3}0.790{col 68}{space 4}-2.358933{col 81}{space 3} 3.098486
{txt}{hline 27}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffeight surprise surprisesupportinteraction, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    6208
                                                       {txt}F(  2,  2243) ={res}   26.07
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0166
                                                       {txt}Root MSE      = {res} 15.939

{txt}{ralign 92:(Std. Err. adjusted for {res:2244} clusters in case_id)}
{hline 27}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 28}{c |}{col 40}    Robust
{col 1}                 diffeight{col 28}{c |}      Coef.{col 40}   Std. Err.{col 52}      t{col 60}   P>|t|{col 68}     [95% Con{col 81}f. Interval]
{hline 27}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 18}surprise {c |}{col 28}{res}{space 2}-6.142696{col 40}{space 2} 1.313829{col 51}{space 1}   -4.68{col 60}{space 3}0.000{col 68}{space 4}-8.719145{col 81}{space 3}-3.566248
{txt}surprisesupportinteraction {c |}{col 28}{res}{space 2} 7.426267{col 40}{space 2} 1.523286{col 51}{space 1}    4.88{col 60}{space 3}0.000{col 68}{space 4} 4.439069{col 81}{space 3} 10.41346
{txt}{space 21}_cons {c |}{col 28}{res}{space 2} 1.725496{col 40}{space 2} .6694305{col 51}{space 1}    2.58{col 60}{space 3}0.010{col 68}{space 4} .4127276{col 81}{space 3} 3.038264
{txt}{hline 27}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffeight supportdummy  inttimesupportdummy timeoverall, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    6077
                                                       {txt}F(  3,  2223) ={res}   27.38
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0221
                                                       {txt}Root MSE      = {res} 15.884

{txt}{ralign 85:(Std. Err. adjusted for {res:2224} clusters in case_id)}
{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}    Robust
{col 1}          diffeight{col 21}{c |}      Coef.{col 33}   Std. Err.{col 45}      t{col 53}   P>|t|{col 61}     [95% Con{col 74}f. Interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}supportdummy {c |}{col 21}{res}{space 2} 6.012083{col 33}{space 2} .6759901{col 44}{space 1}    8.89{col 53}{space 3}0.000{col 61}{space 4} 4.686445{col 74}{space 3} 7.337721
{txt}inttimesupportdummy {c |}{col 21}{res}{space 2}-.2644017{col 33}{space 2} .0496433{col 44}{space 1}   -5.33{col 53}{space 3}0.000{col 61}{space 4}-.3617537{col 74}{space 3}-.1670497
{txt}{space 8}timeoverall {c |}{col 21}{res}{space 2} .2093911{col 33}{space 2} .0389007{col 44}{space 1}    5.38{col 53}{space 3}0.000{col 61}{space 4} .1331056{col 74}{space 3} .2856766
{txt}{space 14}_cons {c |}{col 21}{res}{space 2}-3.404788{col 33}{space 2} .5150744{col 44}{space 1}   -6.61{col 53}{space 3}0.000{col 61}{space 4}-4.414865{col 74}{space 3}-2.394711
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg  diffeight2012 supportdummy2012  inttimesupportdummy_2012 adjtimeoverall, cluster(case_id) $adjtime

{txt}Linear regression                                      Number of obs ={res}    5115
                                                       {txt}F(  3,  1738) ={res}   15.84
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0164
                                                       {txt}Root MSE      = {res} 16.071

{txt}{ralign 90:(Std. Err. adjusted for {res:1739} clusters in case_id)}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}           diffeight2012{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}supportdummy2012 {c |}{col 26}{res}{space 2} 5.393627{col 38}{space 2} .8259131{col 49}{space 1}    6.53{col 58}{space 3}0.000{col 66}{space 4} 3.773739{col 79}{space 3} 7.013515
{txt}inttimesupportdummy_2012 {c |}{col 26}{res}{space 2}-.2620223{col 38}{space 2} .0603216{col 49}{space 1}   -4.34{col 58}{space 3}0.000{col 66}{space 4}-.3803329{col 79}{space 3}-.1437117
{txt}{space 10}adjtimeoverall {c |}{col 26}{res}{space 2} .2308196{col 38}{space 2} .0471185{col 49}{space 1}    4.90{col 58}{space 3}0.000{col 66}{space 4} .1384046{col 79}{space 3} .3232346
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-2.830739{col 38}{space 2}  .610737{col 49}{space 1}   -4.63{col 58}{space 3}0.000{col 66}{space 4}-4.028596{col 79}{space 3}-1.632883
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. /// Partisanship && DiffAggHap///
> 
. /// 2008 Alone ///
> 
. reg diff2008 supportdummy2008, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}     970
                                                       {txt}F(  1,   969) ={res}    2.91
                                                       {txt}Prob > F      = {res} 0.0885
                                                       {txt}R-squared     = {res} 0.0030
                                                       {txt}Root MSE      = {res} 26.008

{txt}{ralign 82:(Std. Err. adjusted for {res:970} clusters in case_id)}
{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 18}{c |}{col 30}    Robust
{col 1}        diff2008{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
supportdummy2008 {c |}{col 18}{res}{space 2}  2.84858{col 30}{space 2} 1.670627{col 41}{space 1}    1.71{col 50}{space 3}0.088{col 58}{space 4}-.4298835{col 71}{space 3} 6.127044
{txt}{space 11}_cons {c |}{col 18}{res}{space 2}-1.014199{col 30}{space 2} 1.165532{col 41}{space 1}   -0.87{col 50}{space 3}0.384{col 58}{space 4}-3.301457{col 71}{space 3} 1.273059
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diff2008 supportdummy2008 abspart2008  interabspartobamasup_2008, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}     967
                                                       {txt}F(  3,   966) ={res}    1.27
                                                       {txt}Prob > F      = {res} 0.2829
                                                       {txt}R-squared     = {res} 0.0045
                                                       {txt}Root MSE      = {res} 26.056

{txt}{ralign 91:(Std. Err. adjusted for {res:967} clusters in case_id)}
{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39}    Robust
{col 1}                 diff2008{col 27}{c |}      Coef.{col 39}   Std. Err.{col 51}      t{col 59}   P>|t|{col 67}     [95% Con{col 80}f. Interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}supportdummy2008 {c |}{col 27}{res}{space 2} 7.730016{col 39}{space 2} 5.020022{col 50}{space 1}    1.54{col 59}{space 3}0.124{col 67}{space 4} -2.12139{col 80}{space 3} 17.58142
{txt}{space 14}abspart2008 {c |}{col 27}{res}{space 2}  4.76211{col 39}{space 2} 4.658904{col 50}{space 1}    1.02{col 59}{space 3}0.307{col 67}{space 4} -4.38063{col 80}{space 3} 13.90485
{txt}interabspartobamasup_2008 {c |}{col 27}{res}{space 2}-6.657617{col 39}{space 2} 6.313355{col 50}{space 1}   -1.05{col 59}{space 3}0.292{col 67}{space 4}-19.04709{col 80}{space 3} 5.731855
{txt}{space 20}_cons {c |}{col 27}{res}{space 2}-4.507184{col 39}{space 2} 3.811208{col 50}{space 1}   -1.18{col 59}{space 3}0.237{col 67}{space 4}-11.98639{col 80}{space 3} 2.972019
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diff2008 abspart2008  interabspartobamasup_2008, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}     967
                                                       {txt}F(  2,   966) ={res}    0.81
                                                       {txt}Prob > F      = {res} 0.4437
                                                       {txt}R-squared     = {res} 0.0017
                                                       {txt}Root MSE      = {res} 26.078

{txt}{ralign 91:(Std. Err. adjusted for {res:967} clusters in case_id)}
{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39}    Robust
{col 1}                 diff2008{col 27}{c |}      Coef.{col 39}   Std. Err.{col 51}      t{col 59}   P>|t|{col 67}     [95% Con{col 80}f. Interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}abspart2008 {c |}{col 27}{res}{space 2}   .08544{col 39}{space 2} 3.242102{col 50}{space 1}    0.03{col 59}{space 3}0.979{col 67}{space 4}-6.276935{col 80}{space 3} 6.447815
{txt}interabspartobamasup_2008 {c |}{col 27}{res}{space 2} 2.593891{col 39}{space 2} 2.104688{col 50}{space 1}    1.23{col 59}{space 3}0.218{col 67}{space 4}-1.536396{col 80}{space 3} 6.724178
{txt}{space 20}_cons {c |}{col 27}{res}{space 2}-.6027549{col 39}{space 2} 2.516807{col 50}{space 1}   -0.24{col 59}{space 3}0.811{col 67}{space 4}-5.541794{col 80}{space 3} 4.336284
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diff2008 supportdummy2008 surprise39 surprisesupportinteraction_2008, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}     969
                                                       {txt}F(  3,   968) ={res}    1.21
                                                       {txt}Prob > F      = {res} 0.3034
                                                       {txt}R-squared     = {res} 0.0034
                                                       {txt}Root MSE      = {res} 26.031

{txt}{ralign 97:(Std. Err. adjusted for {res:969} clusters in case_id)}
{hline 32}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 33}{c |}{col 45}    Robust
{col 1}                       diff2008{col 33}{c |}      Coef.{col 45}   Std. Err.{col 57}      t{col 65}   P>|t|{col 73}     [95% Con{col 86}f. Interval]
{hline 32}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}supportdummy2008 {c |}{col 33}{res}{space 2} 4.392555{col 45}{space 2} 3.431794{col 56}{space 1}    1.28{col 65}{space 3}0.201{col 73}{space 4}-2.342059{col 86}{space 3} 11.12717
{txt}{space 21}surprise39 {c |}{col 33}{res}{space 2} 1.122787{col 45}{space 2} 5.070537{col 56}{space 1}    0.22{col 65}{space 3}0.825{col 73}{space 4}-8.827725{col 86}{space 3}  11.0733
{txt}surprisesupportinteraction_2008 {c |}{col 33}{res}{space 2}-4.715944{col 45}{space 2} 9.070126{col 56}{space 1}   -0.52{col 65}{space 3}0.603{col 73}{space 4}-22.51532{col 86}{space 3} 13.08343
{txt}{space 26}_cons {c |}{col 33}{res}{space 2}-1.625157{col 45}{space 2} 2.743849{col 56}{space 1}   -0.59{col 65}{space 3}0.554{col 73}{space 4}-7.009734{col 86}{space 3} 3.759419
{txt}{hline 32}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diff2008 surprise39 surprisesupportinteraction_2008, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}     969
                                                       {txt}F(  2,   968) ={res}    0.92
                                                       {txt}Prob > F      = {res} 0.3977
                                                       {txt}R-squared     = {res} 0.0019
                                                       {txt}Root MSE      = {res} 26.037

{txt}{ralign 97:(Std. Err. adjusted for {res:969} clusters in case_id)}
{hline 32}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 33}{c |}{col 45}    Robust
{col 1}                       diff2008{col 33}{c |}      Coef.{col 45}   Std. Err.{col 57}      t{col 65}   P>|t|{col 73}     [95% Con{col 86}f. Interval]
{hline 32}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 21}surprise39 {c |}{col 33}{res}{space 2}-3.566676{col 45}{space 2} 3.501476{col 56}{space 1}   -1.02{col 65}{space 3}0.309{col 73}{space 4}-10.43804{col 86}{space 3} 3.304684
{txt}surprisesupportinteraction_2008 {c |}{col 33}{res}{space 2} 4.311906{col 45}{space 2} 5.290992{col 56}{space 1}    0.81{col 65}{space 3}0.415{col 73}{space 4}-6.071231{col 86}{space 3} 14.69504
{txt}{space 26}_cons {c |}{col 33}{res}{space 2} 1.166075{col 45}{space 2} 1.651372{col 56}{space 1}    0.71{col 65}{space 3}0.480{col 73}{space 4}-2.074606{col 86}{space 3} 4.406755
{txt}{hline 32}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diff2008 supportdummy2008  inttimesupportdummy_2008 time2008, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}     962
                                                       {txt}F(  3,   961) ={res}    1.43
                                                       {txt}Prob > F      = {res} 0.2332
                                                       {txt}R-squared     = {res} 0.0045
                                                       {txt}Root MSE      = {res} 25.875

{txt}{ralign 90:(Std. Err. adjusted for {res:962} clusters in case_id)}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}                diff2008{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}supportdummy2008 {c |}{col 26}{res}{space 2} 2.644522{col 38}{space 2} 1.808154{col 49}{space 1}    1.46{col 58}{space 3}0.144{col 66}{space 4}-.9038645{col 79}{space 3} 6.192908
{txt}inttimesupportdummy_2008 {c |}{col 26}{res}{space 2} .1173253{col 38}{space 2} .1485146{col 49}{space 1}    0.79{col 58}{space 3}0.430{col 66}{space 4} -.174125{col 79}{space 3} .4087756
{txt}{space 16}time2008 {c |}{col 26}{res}{space 2}-.0884861{col 38}{space 2} .1245544{col 49}{space 1}   -0.71{col 58}{space 3}0.478{col 66}{space 4}-.3329161{col 79}{space 3} .1559438
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-.8305665{col 38}{space 2} 1.284427{col 49}{space 1}   -0.65{col 58}{space 3}0.518{col 66}{space 4}-3.351172{col 79}{space 3} 1.690039
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. /// 2012 Alone ///
> 
. reg diffagghap2012 supportdummy2012, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    5237
                                                       {txt}F(  1,  1767) ={res}   29.93
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0117
                                                       {txt}Root MSE      = {res} 34.177

{txt}{ralign 82:(Std. Err. adjusted for {res:1768} clusters in case_id)}
{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 18}{c |}{col 30}    Robust
{col 1}  diffagghap2012{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
supportdummy2012 {c |}{col 18}{res}{space 2} 7.524594{col 30}{space 2} 1.375375{col 41}{space 1}    5.47{col 50}{space 3}0.000{col 58}{space 4} 4.827061{col 71}{space 3} 10.22213
{txt}{space 11}_cons {c |}{col 18}{res}{space 2}-.3064004{col 30}{space 2} 1.004917{col 41}{space 1}   -0.30{col 50}{space 3}0.760{col 58}{space 4}-2.277352{col 71}{space 3} 1.664551
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffagghap2012 supportdummy2012 abspart2012  interabspartobamasup_2012, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    5234
                                                       {txt}F(  3,  1766) ={res}   10.91
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0129
                                                       {txt}Root MSE      = {res} 34.171

{txt}{ralign 91:(Std. Err. adjusted for {res:1767} clusters in case_id)}
{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39}    Robust
{col 1}           diffagghap2012{col 27}{c |}      Coef.{col 39}   Std. Err.{col 51}      t{col 59}   P>|t|{col 67}     [95% Con{col 80}f. Interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}supportdummy2012 {c |}{col 27}{res}{space 2} 1.593414{col 39}{space 2} 3.662203{col 50}{space 1}    0.44{col 59}{space 3}0.664{col 67}{space 4}-5.589295{col 80}{space 3} 8.776123
{txt}{space 14}abspart2012 {c |}{col 27}{res}{space 2}-5.937078{col 39}{space 2} 3.448006{col 50}{space 1}   -1.72{col 59}{space 3}0.085{col 67}{space 4}-12.69968{col 80}{space 3} .8255248
{txt}interabspartobamasup_2012 {c |}{col 27}{res}{space 2} 8.327866{col 39}{space 2} 4.780025{col 50}{space 1}    1.74{col 59}{space 3}0.082{col 67}{space 4}-1.047237{col 80}{space 3} 17.70297
{txt}{space 20}_cons {c |}{col 27}{res}{space 2} 3.860065{col 39}{space 2} 2.571057{col 50}{space 1}    1.50{col 59}{space 3}0.133{col 67}{space 4}-1.182571{col 80}{space 3}   8.9027
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffagghap2012  abspart2012  interabspartobamasup_2012, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    5234
                                                       {txt}F(  2,  1766) ={res}   16.25
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0129
                                                       {txt}Root MSE      = {res} 34.169

{txt}{ralign 91:(Std. Err. adjusted for {res:1767} clusters in case_id)}
{hline 26}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 27}{c |}{col 39}    Robust
{col 1}           diffagghap2012{col 27}{c |}      Coef.{col 39}   Std. Err.{col 51}      t{col 59}   P>|t|{col 67}     [95% Con{col 80}f. Interval]
{hline 26}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}abspart2012 {c |}{col 27}{res}{space 2}-6.999404{col 39}{space 2} 2.638695{col 50}{space 1}   -2.65{col 59}{space 3}0.008{col 67}{space 4} -12.1747{col 80}{space 3}-1.824111
{txt}interabspartobamasup_2012 {c |}{col 27}{res}{space 2} 10.24403{col 39}{space 2} 1.798671{col 50}{space 1}    5.70{col 59}{space 3}0.000{col 67}{space 4} 6.716281{col 80}{space 3} 13.77178
{txt}{space 20}_cons {c |}{col 27}{res}{space 2} 4.730143{col 39}{space 2}  1.84168{col 50}{space 1}    2.57{col 59}{space 3}0.010{col 67}{space 4} 1.118041{col 80}{space 3} 8.342245
{txt}{hline 26}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg  diffagghap2012 supportdummy2012  inttimesupportdummy_2012 time2012, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    5110
                                                       {txt}F(  3,  1737) ={res}   14.19
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0159
                                                       {txt}Root MSE      = {res} 34.174

{txt}{ralign 90:(Std. Err. adjusted for {res:1738} clusters in case_id)}
{hline 25}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 26}{c |}{col 38}    Robust
{col 1}          diffagghap2012{col 26}{c |}      Coef.{col 38}   Std. Err.{col 50}      t{col 58}   P>|t|{col 66}     [95% Con{col 79}f. Interval]
{hline 25}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}supportdummy2012 {c |}{col 26}{res}{space 2} 10.66613{col 38}{space 2} 1.789194{col 49}{space 1}    5.96{col 58}{space 3}0.000{col 66}{space 4} 7.156928{col 79}{space 3} 14.17533
{txt}inttimesupportdummy_2012 {c |}{col 26}{res}{space 2}-.3937733{col 38}{space 2} .1428434{col 49}{space 1}   -2.76{col 58}{space 3}0.006{col 66}{space 4}-.6739364{col 79}{space 3}-.1136102
{txt}{space 16}time2012 {c |}{col 26}{res}{space 2} .4062904{col 38}{space 2} .1114305{col 49}{space 1}    3.65{col 58}{space 3}0.000{col 66}{space 4} .1877383{col 79}{space 3} .6248425
{txt}{space 19}_cons {c |}{col 26}{res}{space 2}-3.530067{col 38}{space 2} 1.350827{col 49}{space 1}   -2.61{col 58}{space 3}0.009{col 66}{space 4}-6.179486{col 79}{space 3}-.8806479
{txt}{hline 25}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. /// 08 and 12 Combined ///
> 
. reg diffagghap supportdummy, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    6207
                                                       {txt}F(  1,  2244) ={res}   34.35
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0107
                                                       {txt}Root MSE      = {res}  33.06

{txt}{ralign 78:(Std. Err. adjusted for {res:2245} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  diffagghap{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
supportdummy {c |}{col 14}{res}{space 2} 6.922587{col 26}{space 2} 1.181226{col 37}{space 1}    5.86{col 46}{space 3}0.000{col 54}{space 4} 4.606176{col 67}{space 3} 9.238997
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.4358309{col 26}{space 2} .8387222{col 37}{space 1}   -0.52{col 46}{space 3}0.603{col 54}{space 4}-2.080583{col 67}{space 3} 1.208922
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffagghap supportdummy abspart interabspartobamasup, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    6201
                                                       {txt}F(  3,  2241) ={res}   12.14
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0114
                                                       {txt}Root MSE      = {res} 33.069

{txt}{ralign 86:(Std. Err. adjusted for {res:2242} clusters in case_id)}
{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 22}{c |}{col 34}    Robust
{col 1}          diffagghap{col 22}{c |}      Coef.{col 34}   Std. Err.{col 46}      t{col 54}   P>|t|{col 62}     [95% Con{col 75}f. Interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}supportdummy {c |}{col 22}{res}{space 2} 2.569272{col 34}{space 2} 3.232024{col 45}{space 1}    0.79{col 54}{space 3}0.427{col 62}{space 4}-3.768801{col 75}{space 3} 8.907345
{txt}{space 13}abspart {c |}{col 22}{res}{space 2}-4.168397{col 34}{space 2} 2.987225{col 45}{space 1}   -1.40{col 54}{space 3}0.163{col 62}{space 4}-10.02641{col 75}{space 3}  1.68962
{txt}interabspartobamasup {c |}{col 22}{res}{space 2} 6.080298{col 34}{space 2}  4.20095{col 45}{space 1}    1.45{col 54}{space 3}0.148{col 62}{space 4}-2.157863{col 75}{space 3} 14.31846
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 2.513077{col 34}{space 2} 2.257891{col 45}{space 1}    1.11{col 54}{space 3}0.266{col 62}{space 4}-1.914699{col 75}{space 3} 6.940854
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffagghap abspart interabspartobamasup, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    6201
                                                       {txt}F(  2,  2241) ={res}   17.83
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0112
                                                       {txt}Root MSE      = {res} 33.069

{txt}{ralign 86:(Std. Err. adjusted for {res:2242} clusters in case_id)}
{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 22}{c |}{col 34}    Robust
{col 1}          diffagghap{col 22}{c |}      Coef.{col 34}   Std. Err.{col 46}      t{col 54}   P>|t|{col 62}     [95% Con{col 75}f. Interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}abspart {c |}{col 22}{res}{space 2}-5.855904{col 34}{space 2} 2.268926{col 45}{space 1}   -2.58{col 54}{space 3}0.010{col 62}{space 4}-10.30532{col 75}{space 3}-1.406488
{txt}interabspartobamasup {c |}{col 22}{res}{space 2} 9.165576{col 34}{space 2} 1.536675{col 45}{space 1}    5.96{col 54}{space 3}0.000{col 62}{space 4} 6.152121{col 75}{space 3} 12.17903
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 3.900255{col 34}{space 2} 1.615186{col 45}{space 1}    2.41{col 54}{space 3}0.016{col 62}{space 4} .7328375{col 75}{space 3} 7.067673
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffagghap supportdummy surprise surprisesupportinteraction, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    6203
                                                       {txt}F(  3,  2243) ={res}   11.89
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0112
                                                       {txt}Root MSE      = {res} 33.062

{txt}{ralign 92:(Std. Err. adjusted for {res:2244} clusters in case_id)}
{hline 27}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 28}{c |}{col 40}    Robust
{col 1}                diffagghap{col 28}{c |}      Coef.{col 40}   Std. Err.{col 52}      t{col 60}   P>|t|{col 68}     [95% Con{col 81}f. Interval]
{hline 27}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}supportdummy {c |}{col 28}{res}{space 2} 6.643721{col 40}{space 2} 3.239324{col 51}{space 1}    2.05{col 60}{space 3}0.040{col 68}{space 4}  .291334{col 81}{space 3} 12.99611
{txt}{space 18}surprise {c |}{col 28}{res}{space 2}-2.976592{col 40}{space 2} 5.015125{col 51}{space 1}   -0.59{col 60}{space 3}0.553{col 68}{space 4}-12.81136{col 81}{space 3}  6.85818
{txt}surprisesupportinteraction {c |}{col 28}{res}{space 2} -1.87974{col 40}{space 2} 6.772009{col 51}{space 1}   -0.28{col 60}{space 3}0.781{col 68}{space 4} -15.1598{col 81}{space 3} 11.40032
{txt}{space 21}_cons {c |}{col 28}{res}{space 2} 1.237505{col 40}{space 2} 2.848634{col 51}{space 1}    0.43{col 60}{space 3}0.664{col 68}{space 4} -4.34873{col 81}{space 3}  6.82374
{txt}{hline 27}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffagghap surprise surprisesupportinteraction, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    6203
                                                       {txt}F(  2,  2243) ={res}   13.99
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0098
                                                       {txt}Root MSE      = {res} 33.084

{txt}{ralign 92:(Std. Err. adjusted for {res:2244} clusters in case_id)}
{hline 27}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 28}{c |}{col 40}    Robust
{col 1}                diffagghap{col 28}{c |}      Coef.{col 40}   Std. Err.{col 52}      t{col 60}   P>|t|{col 68}     [95% Con{col 81}f. Interval]
{hline 27}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 18}surprise {c |}{col 28}{res}{space 2}-11.21515{col 40}{space 2} 2.727668{col 51}{space 1}   -4.11{col 60}{space 3}0.000{col 68}{space 4}-16.56417{col 81}{space 3}-5.866132
{txt}surprisesupportinteraction {c |}{col 28}{res}{space 2} 9.842725{col 40}{space 2} 3.070173{col 51}{space 1}    3.21{col 60}{space 3}0.001{col 68}{space 4} 3.822048{col 81}{space 3}  15.8634
{txt}{space 21}_cons {c |}{col 28}{res}{space 2} 6.446126{col 40}{space 2} 1.362514{col 51}{space 1}    4.73{col 60}{space 3}0.000{col 68}{space 4} 3.774207{col 81}{space 3} 9.118046
{txt}{hline 27}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg  diffagghap supportdummy  inttimesupportdummy timeoverall, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    6072
                                                       {txt}F(  3,  2223) ={res}   15.15
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0135
                                                       {txt}Root MSE      = {res}  33.04

{txt}{ralign 85:(Std. Err. adjusted for {res:2224} clusters in case_id)}
{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}    Robust
{col 1}         diffagghap{col 21}{c |}      Coef.{col 33}   Std. Err.{col 45}      t{col 53}   P>|t|{col 61}     [95% Con{col 74}f. Interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}supportdummy {c |}{col 21}{res}{space 2} 8.769348{col 33}{space 2} 1.424812{col 44}{space 1}    6.15{col 53}{space 3}0.000{col 61}{space 4} 5.975246{col 74}{space 3} 11.56345
{txt}inttimesupportdummy {c |}{col 21}{res}{space 2}-.2421422{col 33}{space 2} .1142154{col 44}{space 1}   -2.12{col 53}{space 3}0.034{col 61}{space 4}-.4661222{col 74}{space 3}-.0181623
{txt}{space 8}timeoverall {c |}{col 21}{res}{space 2} .2801913{col 33}{space 2} .0901039{col 44}{space 1}    3.11{col 53}{space 3}0.002{col 61}{space 4} .1034947{col 74}{space 3} .4568878
{txt}{space 14}_cons {c |}{col 21}{res}{space 2}-2.550674{col 33}{space 2} 1.049283{col 44}{space 1}   -2.43{col 53}{space 3}0.015{col 61}{space 4}-4.608352{col 74}{space 3}-.4929963
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. /// ProbVote && Diffeight///
> 
. /// 2008 Alone ///
> 
. reg diffeight2008 supportdummy2008 votefavprob2008  intvotefavsupport2008, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}     970
                                                       {txt}F(  3,   969) ={res}   21.74
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0645
                                                       {txt}Root MSE      = {res} 14.696

{txt}{ralign 87:(Std. Err. adjusted for {res:970} clusters in case_id)}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}        diffeight2008{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      t{col 55}   P>|t|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}supportdummy2008 {c |}{col 23}{res}{space 2}-5.422023{col 35}{space 2} 8.362798{col 46}{space 1}   -0.65{col 55}{space 3}0.517{col 63}{space 4} -21.8333{col 76}{space 3} 10.98926
{txt}{space 6}votefavprob2008 {c |}{col 23}{res}{space 2} .0260808{col 35}{space 2} .0359303{col 46}{space 1}    0.73{col 55}{space 3}0.468{col 63}{space 4}-.0444293{col 76}{space 3} .0965908
{txt}intvotefavsupport2008 {c |}{col 23}{res}{space 2} .1081388{col 35}{space 2} .0929417{col 46}{space 1}    1.16{col 55}{space 3}0.245{col 63}{space 4}-.0742513{col 76}{space 3} .2905289
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-4.749361{col 35}{space 2}  .704313{col 46}{space 1}   -6.74{col 55}{space 3}0.000{col 63}{space 4}-6.131516{col 76}{space 3}-3.367207
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffeight2008 votefavprob2008  intvotefavsupport2008, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}     970
                                                       {txt}F(  2,   969) ={res}   32.56
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0639
                                                       {txt}Root MSE      = {res} 14.693

{txt}{ralign 87:(Std. Err. adjusted for {res:970} clusters in case_id)}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}        diffeight2008{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      t{col 55}   P>|t|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}votefavprob2008 {c |}{col 23}{res}{space 2} .0272794{col 35}{space 2} .0358936{col 46}{space 1}    0.76{col 55}{space 3}0.447{col 63}{space 4}-.0431587{col 76}{space 3} .0977175
{txt}intvotefavsupport2008 {c |}{col 23}{res}{space 2} .0520838{col 35}{space 2} .0346038{col 46}{space 1}    1.51{col 55}{space 3}0.133{col 63}{space 4}-.0158233{col 76}{space 3} .1199909
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-4.805125{col 35}{space 2} .7028858{col 46}{space 1}   -6.84{col 55}{space 3}0.000{col 63}{space 4}-6.184479{col 76}{space 3}-3.425771
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. /// 2012 Alone ///
> 
. reg diffeight2012 supportdummy2012 votefavprob2012  intvotefavsupport2012, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    5242
                                                       {txt}F(  3,  1768) ={res}   11.18
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0126
                                                       {txt}Root MSE      = {res} 16.118

{txt}{ralign 87:(Std. Err. adjusted for {res:1769} clusters in case_id)}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}        diffeight2012{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      t{col 55}   P>|t|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}supportdummy2012 {c |}{col 23}{res}{space 2}-1.869825{col 35}{space 2}  2.75679{col 46}{space 1}   -0.68{col 55}{space 3}0.498{col 63}{space 4}-7.276735{col 76}{space 3} 3.537084
{txt}{space 6}votefavprob2012 {c |}{col 23}{res}{space 2} .0527027{col 35}{space 2} .0428115{col 46}{space 1}    1.23{col 55}{space 3}0.218{col 63}{space 4}-.0312638{col 76}{space 3} .1366692
{txt}intvotefavsupport2012 {c |}{col 23}{res}{space 2}  .004799{col 35}{space 2}  .051434{col 46}{space 1}    0.09{col 55}{space 3}0.926{col 63}{space 4}-.0960789{col 76}{space 3} .1056768
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-1.490757{col 35}{space 2} .5032004{col 46}{space 1}   -2.96{col 55}{space 3}0.003{col 63}{space 4}-2.477688{col 76}{space 3} -.503827
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffeight2012  votefavprob2012  intvotefavsupport2012, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    5242
                                                       {txt}F(  2,  1768) ={res}   16.60
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0124
                                                       {txt}Root MSE      = {res} 16.118

{txt}{ralign 87:(Std. Err. adjusted for {res:1769} clusters in case_id)}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}        diffeight2012{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      t{col 55}   P>|t|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}votefavprob2012 {c |}{col 23}{res}{space 2} .0540996{col 35}{space 2} .0427316{col 46}{space 1}    1.27{col 55}{space 3}0.206{col 63}{space 4}-.0297103{col 76}{space 3} .1379094
{txt}intvotefavsupport2012 {c |}{col 23}{res}{space 2}-.0153154{col 35}{space 2} .0416782{col 46}{space 1}   -0.37{col 55}{space 3}0.713{col 63}{space 4}-.0970591{col 76}{space 3} .0664283
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-1.543371{col 35}{space 2} .4946213{col 46}{space 1}   -3.12{col 55}{space 3}0.002{col 63}{space 4}-2.513475{col 76}{space 3}-.5732666
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. /// 08 and 12 Combined ///
> 
. reg diffeight supportdummy votefavprob intvotefavsupport, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    6212
                                                       {txt}F(  3,  2244) ={res}   20.47
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0180
                                                       {txt}Root MSE      = {res} 15.925

{txt}{ralign 83:(Std. Err. adjusted for {res:2245} clusters in case_id)}
{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}        diffeight{col 19}{c |}      Coef.{col 31}   Std. Err.{col 43}      t{col 51}   P>|t|{col 59}     [95% Con{col 72}f. Interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}supportdummy {c |}{col 19}{res}{space 2}-1.830081{col 31}{space 2} 2.651712{col 42}{space 1}   -0.69{col 51}{space 3}0.490{col 59}{space 4}-7.030147{col 72}{space 3} 3.369984
{txt}{space 6}votefavprob {c |}{col 19}{res}{space 2} .0459523{col 31}{space 2} .0341706{col 42}{space 1}    1.34{col 51}{space 3}0.179{col 59}{space 4}-.0210569{col 72}{space 3} .1129615
{txt}intvotefavsupport {c |}{col 19}{res}{space 2} .0181762{col 31}{space 2} .0436855{col 42}{space 1}    0.42{col 51}{space 3}0.677{col 59}{space 4} -.067492{col 72}{space 3} .1038444
{txt}{space 12}_cons {c |}{col 19}{res}{space 2}-2.078911{col 31}{space 2} .4320448{col 42}{space 1}   -4.81{col 51}{space 3}0.000{col 59}{space 4} -2.92616{col 72}{space 3}-1.231661
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffeight votefavprob intvotefavsupport, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    6212
                                                       {txt}F(  2,  2244) ={res}   30.59
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0179
                                                       {txt}Root MSE      = {res} 15.925

{txt}{ralign 83:(Std. Err. adjusted for {res:2245} clusters in case_id)}
{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}        diffeight{col 19}{c |}      Coef.{col 31}   Std. Err.{col 43}      t{col 51}   P>|t|{col 59}     [95% Con{col 72}f. Interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}votefavprob {c |}{col 19}{res}{space 2}  .047109{col 31}{space 2} .0341261{col 42}{space 1}    1.38{col 51}{space 3}0.168{col 59}{space 4} -.019813{col 72}{space 3}  .114031
{txt}intvotefavsupport {c |}{col 19}{res}{space 2}-.0013426{col 31}{space 2} .0332697{col 42}{space 1}   -0.04{col 51}{space 3}0.968{col 59}{space 4}-.0665852{col 72}{space 3}    .0639
{txt}{space 12}_cons {c |}{col 19}{res}{space 2}-2.124424{col 31}{space 2} .4262019{col 42}{space 1}   -4.98{col 51}{space 3}0.000{col 59}{space 4}-2.960215{col 72}{space 3}-1.288633
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. /// ProbVote && DiffAggHap///
> 
. /// 2008 Alone ///
> reg diff2008 supportdummy2008 votefavprob2008  intvotefavsupport2008, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}     970
                                                       {txt}F(  3,   969) ={res}    3.48
                                                       {txt}Prob > F      = {res} 0.0155
                                                       {txt}R-squared     = {res} 0.0161
                                                       {txt}Root MSE      = {res} 25.863

{txt}{ralign 87:(Std. Err. adjusted for {res:970} clusters in case_id)}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}             diff2008{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      t{col 55}   P>|t|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}supportdummy2008 {c |}{col 23}{res}{space 2}-26.67645{col 35}{space 2} 13.95104{col 46}{space 1}   -1.91{col 55}{space 3}0.056{col 63}{space 4}-54.05418{col 76}{space 3} .7012854
{txt}{space 6}votefavprob2008 {c |}{col 23}{res}{space 2}-.2336555{col 35}{space 2} .1232134{col 46}{space 1}   -1.90{col 55}{space 3}0.058{col 63}{space 4}-.4754514{col 76}{space 3} .0081404
{txt}intvotefavsupport2008 {c |}{col 23}{res}{space 2} .5283341{col 35}{space 2} .1879669{col 46}{space 1}    2.81{col 55}{space 3}0.005{col 63}{space 4} .1594651{col 76}{space 3} .8972032
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} -.034078{col 35}{space 2} 1.170305{col 46}{space 1}   -0.03{col 55}{space 3}0.977{col 63}{space 4}-2.330702{col 76}{space 3} 2.262546
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diff2008 votefavprob2008  intvotefavsupport2008, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}     970
                                                       {txt}F(  2,   969) ={res}    3.34
                                                       {txt}Prob > F      = {res} 0.0360
                                                       {txt}R-squared     = {res} 0.0111
                                                       {txt}Root MSE      = {res} 25.915

{txt}{ralign 87:(Std. Err. adjusted for {res:970} clusters in case_id)}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}             diff2008{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      t{col 55}   P>|t|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}votefavprob2008 {c |}{col 23}{res}{space 2}-.2277581{col 35}{space 2}  .123144{col 46}{space 1}   -1.85{col 55}{space 3}0.065{col 63}{space 4}-.4694177{col 76}{space 3} .0139015
{txt}intvotefavsupport2008 {c |}{col 23}{res}{space 2} .2525425{col 35}{space 2} .1213997{col 46}{space 1}    2.08{col 55}{space 3}0.038{col 63}{space 4} .0143059{col 76}{space 3} .4907791
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-.3084369{col 35}{space 2} 1.171601{col 46}{space 1}   -0.26{col 55}{space 3}0.792{col 63}{space 4}-2.607605{col 76}{space 3} 1.990731
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. /// 2012 Alone ///
> 
. reg diffagghap2012 supportdummy2012 votefavprob2012  intvotefavsupport2012, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    5237
                                                       {txt}F(  3,  1767) ={res}   11.32
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0134
                                                       {txt}Root MSE      = {res} 34.153

{txt}{ralign 87:(Std. Err. adjusted for {res:1768} clusters in case_id)}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}       diffagghap2012{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      t{col 55}   P>|t|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}supportdummy2012 {c |}{col 23}{res}{space 2}-4.001127{col 35}{space 2} 6.581034{col 46}{space 1}   -0.61{col 55}{space 3}0.543{col 63}{space 4}-16.90856{col 76}{space 3} 8.906303
{txt}{space 6}votefavprob2012 {c |}{col 23}{res}{space 2} .0962467{col 35}{space 2} .0838021{col 46}{space 1}    1.15{col 55}{space 3}0.251{col 63}{space 4}-.0681149{col 76}{space 3} .2606083
{txt}intvotefavsupport2012 {c |}{col 23}{res}{space 2} .0287303{col 35}{space 2} .1079506{col 46}{space 1}    0.27{col 55}{space 3}0.790{col 63}{space 4} -.182994{col 76}{space 3} .2404545
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} -.685664{col 35}{space 2} 1.056324{col 46}{space 1}   -0.65{col 55}{space 3}0.516{col 63}{space 4}-2.757441{col 76}{space 3} 1.386113
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffagghap2012  votefavprob2012  intvotefavsupport2012, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    5237
                                                       {txt}F(  2,  1767) ={res}   16.92
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0133
                                                       {txt}Root MSE      = {res} 34.152

{txt}{ralign 87:(Std. Err. adjusted for {res:1768} clusters in case_id)}
{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}       diffagghap2012{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      t{col 55}   P>|t|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}votefavprob2012 {c |}{col 23}{res}{space 2} .0992512{col 35}{space 2} .0836473{col 46}{space 1}    1.19{col 55}{space 3}0.236{col 63}{space 4}-.0648068{col 76}{space 3} .2633092
{txt}intvotefavsupport2012 {c |}{col 23}{res}{space 2}-.0143265{col 35}{space 2} .0815873{col 46}{space 1}   -0.18{col 55}{space 3}0.861{col 63}{space 4}-.1743442{col 76}{space 3} .1456912
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-.7983149{col 35}{space 2} 1.042092{col 46}{space 1}   -0.77{col 55}{space 3}0.444{col 63}{space 4}-2.842178{col 76}{space 3} 1.245549
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. /// 08 and 12 Combined ///
> 
. reg diffagghap supportdummy votefavprob intvotefavsupport, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    6207
                                                       {txt}F(  3,  2244) ={res}   12.68
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0121
                                                       {txt}Root MSE      = {res} 33.041

{txt}{ralign 83:(Std. Err. adjusted for {res:2245} clusters in case_id)}
{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}       diffagghap{col 19}{c |}      Coef.{col 31}   Std. Err.{col 43}      t{col 51}   P>|t|{col 59}     [95% Con{col 72}f. Interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}supportdummy {c |}{col 19}{res}{space 2}-5.561384{col 31}{space 2}   6.2376{col 42}{space 1}   -0.89{col 51}{space 3}0.373{col 59}{space 4}-17.79345{col 72}{space 3} 6.670686
{txt}{space 6}votefavprob {c |}{col 19}{res}{space 2}  .019823{col 31}{space 2} .0729123{col 42}{space 1}    0.27{col 51}{space 3}0.786{col 59}{space 4}-.1231596{col 72}{space 3} .1628055
{txt}intvotefavsupport {c |}{col 19}{res}{space 2} .1117596{col 31}{space 2} .0973389{col 42}{space 1}    1.15{col 51}{space 3}0.251{col 59}{space 4}-.0791241{col 72}{space 3} .3026433
{txt}{space 12}_cons {c |}{col 19}{res}{space 2}-.5148654{col 31}{space 2}  .878376{col 42}{space 1}   -0.59{col 51}{space 3}0.558{col 59}{space 4} -2.23738{col 72}{space 3} 1.207649
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg diffagghap  votefavprob intvotefavsupport, cluster(case_id)

{txt}Linear regression                                      Number of obs ={res}    6207
                                                       {txt}F(  2,  2244) ={res}   18.87
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0119
                                                       {txt}Root MSE      = {res} 33.042

{txt}{ralign 83:(Std. Err. adjusted for {res:2245} clusters in case_id)}
{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}       diffagghap{col 19}{c |}      Coef.{col 31}   Std. Err.{col 43}      t{col 51}   P>|t|{col 59}     [95% Con{col 72}f. Interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}votefavprob {c |}{col 19}{res}{space 2}   .02335{col 31}{space 2} .0728091{col 42}{space 1}    0.32{col 51}{space 3}0.748{col 59}{space 4}-.1194302{col 72}{space 3} .1661303
{txt}intvotefavsupport {c |}{col 19}{res}{space 2} .0524327{col 31}{space 2} .0712246{col 42}{space 1}    0.74{col 51}{space 3}0.462{col 59}{space 4}-.0872404{col 72}{space 3} .1921057
{txt}{space 12}_cons {c |}{col 19}{res}{space 2}-.6532369{col 31}{space 2} .8701215{col 42}{space 1}   -0.75{col 51}{space 3}0.453{col 59}{space 4}-2.359564{col 72}{space 3}  1.05309
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. 
. 
{txt}end of do-file

{com}. do "/Users/Young/Dropbox/Collin/Project_Code/Do_Files/baseline_nonlinear.do"
{txt}
{com}. ******************************************************************
. * This do-file 
. *       reads in the APL 08 and 12 Election Data
. *       Runs Non-Linear Baseline Regressions on Data
. *       Created: 18/03/2015, by Collin Raymond and Yang Lu
. *       This version:
. ******************************************************************
. 
. /*
> THIS FILE CREATES PROCESSED FILES FROM RAW FILES.
> EDIT THE cd and globals BEFORE RUNNING THIS FILE
> */
. 
. 
. cd "/Users/Young/Dropbox/Collin/Project_Code"
{res}/Users/Young/Dropbox/Collin/Project_Code
{txt}
{com}. 
. global raw_data     "/Users/Young/Dropbox/Collin/Project_Code/Raw_Data"
{txt}
{com}. global data_pro         "/Users/Young/Dropbox/Collin/Project_Code/Output_Data"
{txt}
{com}. 
. set more off 
{txt}
{com}. 
. use "$data_pro/combined0812", clear
{txt}
{com}. preserve
{txt}
{com}. 
. ///Diffeight///
> 
.         ///Partisanship///
> 
.         ///2008///
>         
.         drop if diffeight2008==.
{txt}(11376 observations deleted)

{com}.         drop if supportdummy2008==.
{txt}(562 observations deleted)

{com}.         drop if abspart2008==.
{txt}(3 observations deleted)

{com}.         drop if surprise39==.
{txt}(1 observation deleted)

{com}.         drop if time2008==.
{txt}(8 observations deleted)

{com}. 
.         //this regression stil won't run, so I commented it out
.         //nl (diffeight2008={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2008+({c -(}d2=0{c )-}*abspart2008*surprise39+{c -(}d3=0{c )-}*abspart2008*surprise39*supportdummy2008)*exp({c -(}d4=0{c )-}*(time2008))), cluster(case_id)
.         
.         ///2012///
>         
.         restore 
{txt}
{com}.         preserve 
{txt}
{com}.         
.         drop if diffeight2012==.
{txt}(4480 observations deleted)

{com}.         drop if supportdummy2012==.
{txt}(3186 observations deleted)

{com}.         drop if abspart2012==.
{txt}(3 observations deleted)

{com}.         drop if surprise303==.
{txt}(3 observations deleted)

{com}.         drop if time2012==.
{txt}(127 observations deleted)

{com}.         
.         nl (diffeight2012={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2012+({c -(}d2=0{c )-}*abspart2012*surprise303+{c -(}d3=0{c )-}*abspart2012*surprise303*        supportdummy2012)*exp({c -(}d4=0{c )-}*(time2012))), cluster(case_id)
{txt}(obs = 5109)

Iteration 0:  residual SS = {res}  1319390
{txt}Iteration 1:  residual SS = {res}  1308885
{txt}Iteration 2:  residual SS = {res}  1299487
{txt}Iteration 3:  residual SS = {res}  1293700
{txt}Iteration 4:  residual SS = {res}  1290765
{txt}Iteration 5:  residual SS = {res}  1289673
{txt}Iteration 6:  residual SS = {res}  1289395
{txt}Iteration 7:  residual SS = {res}  1289361
{txt}Iteration 8:  residual SS = {res}  1289360
{txt}Iteration 9:  residual SS = {res}  1289360
{txt}Iteration 10:  residual SS = {res}  1289360
{txt}Iteration 11:  residual SS = {res}  1289360
{txt}Iteration 12:  residual SS = {res}  1289360
{txt}Iteration 13:  residual SS = {res}  1289360

{txt}Nonlinear regression{col 54}Number of obs = {res}     5109
{txt}{col 54}R-squared     = {res}   0.0388
{txt}{col 54}Adj R-squared = {res}   0.0382
{txt}{col 54}Root MSE      = {res} 15.89394
{txt}{col 54}Res. dev.     = {res} 42756.07

{txt}{ralign 78:(Std. Err. adjusted for {res:1737} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2012{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2} .8588008{col 26}{space 2} .5088338{col 37}{space 1}    1.69{col 46}{space 3}0.092{col 54}{space 4} -.139191{col 67}{space 3} 1.856793
{txt}         /d1 {c |}{col 14}{res}{space 2} .7472566{col 26}{space 2} .6850194{col 37}{space 1}    1.09{col 46}{space 3}0.275{col 54}{space 4}-.5962935{col 67}{space 3} 2.090807
{txt}         /d2 {c |}{col 14}{res}{space 2}-65.51606{col 26}{space 2} 21.20533{col 37}{space 1}   -3.09{col 46}{space 3}0.002{col 54}{space 4}-107.1068{col 67}{space 3}-23.92537
{txt}         /d3 {c |}{col 14}{res}{space 2} 93.10241{col 26}{space 2} 29.98813{col 37}{space 1}    3.10{col 46}{space 3}0.002{col 54}{space 4} 34.28575{col 67}{space 3} 151.9191
{txt}         /d4 {c |}{col 14}{res}{space 2}-1.132241{col 26}{space 2} .3063636{col 37}{space 1}   -3.70{col 46}{space 3}0.000{col 54}{space 4}-1.733121{col 67}{space 3}-.5313605
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
.         ///Overall///
>         
.         restore 
{txt}
{com}.         preserve
{txt}
{com}.         
.         drop if diffeight==.
{txt}(2948 observations deleted)

{com}.         drop if supportdummy==.
{txt}(3748 observations deleted)

{com}.         drop if abspart==.
{txt}(6 observations deleted)

{com}.         drop if surprise==.
{txt}(4 observations deleted)

{com}.         drop if timeoverall==.
{txt}(135 observations deleted)

{com}.         
.         nl (diffeight={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy+({c -(}d2=0{c )-}*abspart*surprise+{c -(}d3=0{c )-}*abspart*surprise*supportdummy)*        exp({c -(}d4=0{c )-}*(timeoverall))), cluster(case_id)
{txt}(obs = 6067)

Iteration 0:  residual SS = {res}  1528066
{txt}Iteration 1:  residual SS = {res}  1513185
{txt}Iteration 2:  residual SS = {res}  1500866
{txt}Iteration 3:  residual SS = {res}  1493085
{txt}Iteration 4:  residual SS = {res}  1488838
{txt}Iteration 5:  residual SS = {res}  1487247
{txt}Iteration 6:  residual SS = {res}  1486699
{txt}Iteration 7:  residual SS = {res}  1486570
{txt}Iteration 8:  residual SS = {res}  1486564
{txt}Iteration 9:  residual SS = {res}  1486564
{txt}Iteration 10:  residual SS = {res}  1486564
{txt}Iteration 11:  residual SS = {res}  1486564
{txt}Iteration 12:  residual SS = {res}  1486564
{txt}Iteration 13:  residual SS = {res}  1486564
{txt}Iteration 14:  residual SS = {res}  1486564

{txt}Nonlinear regression{col 54}Number of obs = {res}     6067
{txt}{col 54}R-squared     = {res}   0.0497
{txt}{col 54}Adj R-squared = {res}   0.0492
{txt}{col 54}Root MSE      = {res} 15.65972
{txt}{col 54}Res. dev.     = {res} 50594.14

{txt}{ralign 78:(Std. Err. adjusted for {res:2220} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   diffeight{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2} .5314236{col 26}{space 2} .4535274{col 37}{space 1}    1.17{col 46}{space 3}0.241{col 54}{space 4}-.3579589{col 67}{space 3} 1.420806
{txt}         /d1 {c |}{col 14}{res}{space 2} 1.127544{col 26}{space 2} .6134513{col 37}{space 1}    1.84{col 46}{space 3}0.066{col 54}{space 4}-.0754543{col 67}{space 3} 2.330543
{txt}         /d2 {c |}{col 14}{res}{space 2}-85.96456{col 26}{space 2} 33.38643{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4}-151.4365{col 67}{space 3}-20.49264
{txt}         /d3 {c |}{col 14}{res}{space 2} 123.8554{col 26}{space 2} 48.06608{col 37}{space 1}    2.58{col 46}{space 3}0.010{col 54}{space 4} 29.59618{col 67}{space 3} 218.1146
{txt}         /d4 {c |}{col 14}{res}{space 2}-1.417376{col 26}{space 2} .3859333{col 37}{space 1}   -3.67{col 46}{space 3}0.000{col 54}{space 4}-2.174204{col 67}{space 3}-.6605474
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
.         ///Probvote///
> 
.         ///2008///
>         
.         restore 
{txt}
{com}.         preserve
{txt}
{com}.         
.         drop if diffeight2008==.
{txt}(11376 observations deleted)

{com}.         drop if supportdummy2008==.
{txt}(562 observations deleted)

{com}.         drop if votefavprob2008==.
{txt}(0 observations deleted)

{com}.         drop if surprise39==.
{txt}(1 observation deleted)

{com}.         drop if adjtime2008==.
{txt}(8 observations deleted)

{com}. 
.         nl (diffeight2008={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2008+({c -(}d2=0{c )-}*votefavprob2008*surprise39+{c -(}d3=0{c )-}*votefavprob2008*surprise39*supportdummy2008)*exp({c -(}d4=0{c )-}*(adjtime2008))), cluster(case_id)
{txt}(obs = 961)

Iteration 0:  residual SS = {res} 208660.2
{txt}Iteration 1:  residual SS = {res} 208550.7
{txt}Iteration 2:  residual SS = {res} 208394.6
{txt}Iteration 3:  residual SS = {res} 208261.6
{txt}Iteration 4:  residual SS = {res} 208028.2
{txt}Iteration 5:  residual SS = {res} 207979.1
{txt}Iteration 6:  residual SS = {res} 207944.4
{txt}Iteration 7:  residual SS = {res} 207944.4

{txt}Nonlinear regression{col 54}Number of obs = {res}      961
{txt}{col 54}R-squared     = {res}   0.0647
{txt}{col 54}Adj R-squared = {res}   0.0637
{txt}{col 54}Root MSE      = {res} 14.74068
{txt}{col 54}Res. dev.     = {res} 7894.546

{txt}{ralign 78:(Std. Err. adjusted for {res:961} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2008{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2}-4.583244{col 26}{space 2} .6766715{col 37}{space 1}   -6.77{col 46}{space 3}0.000{col 54}{space 4} -5.91117{col 67}{space 3}-3.255318
{txt}         /d1 {c |}{col 14}{res}{space 2} 6.589703{col 26}{space 2} 1.066646{col 37}{space 1}    6.18{col 46}{space 3}0.000{col 54}{space 4} 4.496476{col 67}{space 3} 8.682929
{txt}         /d2 {c |}{col 14}{res}{space 2}-.1697521{col 26}{space 2} .2130339{col 37}{space 1}   -0.80{col 46}{space 3}0.426{col 54}{space 4} -.587818{col 67}{space 3} .2483138
{txt}         /d3 {c |}{col 14}{res}{space 2} .2325435{col 26}{space 2} .2165085{col 37}{space 1}    1.07{col 46}{space 3}0.283{col 54}{space 4}-.1923411{col 67}{space 3} .6574281
{txt}         /d4 {c |}{col 14}{res}{space 2}-63.81228{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d4 taken as constant term in model

{com}. 
.         ///2012///
>         
.         restore 
{txt}
{com}.         preserve
{txt}
{com}.         
.         drop if diffeight2012==.
{txt}(4480 observations deleted)

{com}.         drop if supportdummy2012==.
{txt}(3186 observations deleted)

{com}.         drop if votefavprob2012==.
{txt}(0 observations deleted)

{com}.         drop if surprise303==.
{txt}(3 observations deleted)

{com}.         drop if adjtime2012==.
{txt}(127 observations deleted)

{com}. 
.         nl (diffeight2012={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2012+({c -(}d2=0{c )-}*votefavprob2012*surprise303+{c -(}d3=0{c )-}*votefavprob2012*surprise303*supportdummy2012)*exp({c -(}d4=0{c )-}*(adjtime2012))), cluster(case_id)
{txt}(obs = 5112)

Iteration 0:  residual SS = {res}  1326421
{txt}Iteration 1:  residual SS = {res}  1326379
{txt}Iteration 2:  residual SS = {res}  1326368
{txt}Iteration 3:  residual SS = {res}  1326364
{txt}Iteration 4:  residual SS = {res}  1326362
{txt}Iteration 5:  residual SS = {res}  1326361
{txt}Iteration 6:  residual SS = {res}  1326361
{txt}Iteration 7:  residual SS = {res}  1326361
{txt}Iteration 8:  residual SS = {res}  1326361
{txt}Iteration 9:  residual SS = {res}  1326360
{txt}Iteration 10:  residual SS = {res}  1326360
{txt}Iteration 11:  residual SS = {res}  1326360
{txt}Iteration 12:  residual SS = {res}  1326360
{txt}Iteration 13:  residual SS = {res}  1326360
{txt}Iteration 14:  residual SS = {res}  1326360
{txt}Iteration 15:  residual SS = {res}  1326360
{txt}Iteration 16:  residual SS = {res}  1326360
{txt}Iteration 17:  residual SS = {res}  1326360
{txt}Iteration 18:  residual SS = {res}  1326360
{txt}Iteration 19:  residual SS = {res}  1326360
{txt}Iteration 20:  residual SS = {res}  1326360
{txt}Iteration 21:  residual SS = {res}  1326360
{txt}Iteration 22:  residual SS = {res}  1326360
{txt}Iteration 23:  residual SS = {res}  1326360
{txt}Iteration 24:  residual SS = {res}  1326360
{txt}Iteration 25:  residual SS = {res}  1326360
{txt}Iteration 26:  residual SS = {res}  1326360
{txt}Iteration 27:  residual SS = {res}  1326360
{txt}Iteration 28:  residual SS = {res}  1326360
{txt}Iteration 29:  residual SS = {res}  1326360
{txt}Iteration 30:  residual SS = {res}  1326360
{txt}Iteration 31:  residual SS = {res}  1326360
{txt}Iteration 32:  residual SS = {res}  1326360
{txt}Iteration 33:  residual SS = {res}  1326360
{txt}Iteration 34:  residual SS = {res}  1326360
{txt}Iteration 35:  residual SS = {res}  1326360
{txt}Iteration 36:  residual SS = {res}  1326360
{txt}Iteration 37:  residual SS = {res}  1326360
{txt}Iteration 38:  residual SS = {res}  1326360
{txt}Iteration 39:  residual SS = {res}  1326360
{txt}Iteration 40:  residual SS = {res}  1326360
{txt}Iteration 41:  residual SS = {res}  1326360
{txt}Iteration 42:  residual SS = {res}  1326360
{txt}Iteration 43:  residual SS = {res}  1326360
{txt}Iteration 44:  residual SS = {res}  1326360
{txt}Iteration 45:  residual SS = {res}  1326360
{txt}Iteration 46:  residual SS = {res}  1326360
{txt}Iteration 47:  residual SS = {res}  1326360
{txt}Iteration 48:  residual SS = {res}  1326360
{txt}Iteration 49:  residual SS = {res}  1326360
{txt}Iteration 50:  residual SS = {res}  1326360
{txt}Iteration 51:  residual SS = {res}  1326360
{txt}Iteration 52:  residual SS = {res}  1326360
{txt}Iteration 53:  residual SS = {res}  1326360
{txt}Iteration 54:  residual SS = {res}  1326360
{txt}Iteration 55:  residual SS = {res}  1326360
{txt}Iteration 56:  residual SS = {res}  1326360
{txt}Iteration 57:  residual SS = {res}  1326360
{txt}Iteration 58:  residual SS = {res}  1326360
{txt}Iteration 59:  residual SS = {res}  1326360

{txt}Nonlinear regression{col 54}Number of obs = {res}     5112
{txt}{col 54}R-squared     = {res}   0.0115
{txt}{col 54}Adj R-squared = {res}   0.0109
{txt}{col 54}Root MSE      = {res} 16.11565
{txt}{col 54}Res. dev.     = {res} 42922.81

{txt}{ralign 78:(Std. Err. adjusted for {res:1738} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2012{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2}-1.431781{col 26}{space 2} .5121258{col 37}{space 1}   -2.80{col 46}{space 3}0.005{col 54}{space 4}-2.436229{col 67}{space 3}-.4273324
{txt}         /d1 {c |}{col 14}{res}{space 2}   2.7455{col 26}{space 2} .9838622{col 37}{space 1}    2.79{col 46}{space 3}0.005{col 54}{space 4} .8158213{col 67}{space 3} 4.675179
{txt}         /d2 {c |}{col 14}{res}{space 2} .0786035{col 26}{space 2}  .153633{col 37}{space 1}    0.51{col 46}{space 3}0.609{col 54}{space 4}-.2227216{col 67}{space 3} .3799286
{txt}         /d3 {c |}{col 14}{res}{space 2}-.0447813{col 26}{space 2} .1562699{col 37}{space 1}   -0.29{col 46}{space 3}0.774{col 54}{space 4}-.3512783{col 67}{space 3} .2617157
{txt}         /d4 {c |}{col 14}{res}{space 2}-.0352545{col 26}{space 2} .0738506{col 37}{space 1}   -0.48{col 46}{space 3}0.633{col 54}{space 4}   -.1801{col 67}{space 3}  .109591
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
.         ///Overall///
>         
.         restore 
{txt}
{com}.         preserve
{txt}
{com}.         
.         drop if diffeight==.
{txt}(2948 observations deleted)

{com}.         drop if supportdummy==.
{txt}(3748 observations deleted)

{com}.         drop if votefavprob==.
{txt}(0 observations deleted)

{com}.         drop if surprise==.
{txt}(4 observations deleted)

{com}.         drop if adjtimeoverall==.
{txt}(135 observations deleted)

{com}. 
.         nl (diffeight={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy+({c -(}d2=0{c )-}*votefavprob*surprise+{c -(}d3=0{c )-}*votefavprob*surprise*supportdummy)*exp({c -(}d4=0{c )-}*(adjtimeoverall))), cluster(case_id)
{txt}(obs = 6073)

Iteration 0:  residual SS = {res}  1539932
{txt}Iteration 1:  residual SS = {res}  1539809
{txt}Iteration 2:  residual SS = {res}  1539770
{txt}Iteration 3:  residual SS = {res}  1539750
{txt}Iteration 4:  residual SS = {res}  1539731
{txt}Iteration 5:  residual SS = {res}  1539705
{txt}Iteration 6:  residual SS = {res}  1539651
{txt}Iteration 7:  residual SS = {res}  1539501
{txt}Iteration 8:  residual SS = {res}  1539071
{txt}Iteration 9:  residual SS = {res}  1538551
{txt}Iteration 10:  residual SS = {res}  1538380
{txt}Iteration 11:  residual SS = {res}  1538369
{txt}Iteration 12:  residual SS = {res}  1538367
{txt}Iteration 13:  residual SS = {res}  1538367
{txt}Iteration 14:  residual SS = {res}  1538367
{txt}Iteration 15:  residual SS = {res}  1538367
{txt}Iteration 16:  residual SS = {res}  1538367
{txt}Iteration 17:  residual SS = {res}  1538367
{txt}Iteration 18:  residual SS = {res}  1538367
{txt}Iteration 19:  residual SS = {res}  1538367
{txt}Iteration 20:  residual SS = {res}  1538367
{txt}Iteration 21:  residual SS = {res}  1538367
{txt}Iteration 22:  residual SS = {res}  1538367
{txt}Iteration 23:  residual SS = {res}  1538367

{txt}Nonlinear regression{col 54}Number of obs = {res}     6073
{txt}{col 54}R-squared     = {res}   0.0178
{txt}{col 54}Adj R-squared = {res}   0.0174
{txt}{col 54}Root MSE      = {res} 15.92235
{txt}{col 54}Res. dev.     = {res}  50846.2

{txt}{ralign 78:(Std. Err. adjusted for {res:2223} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   diffeight{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2}-1.896104{col 26}{space 2} .4163316{col 37}{space 1}   -4.55{col 46}{space 3}0.000{col 54}{space 4}-2.712544{col 67}{space 3}-1.079665
{txt}         /d1 {c |}{col 14}{res}{space 2} 3.583133{col 26}{space 2} .6096491{col 37}{space 1}    5.88{col 46}{space 3}0.000{col 54}{space 4} 2.387592{col 67}{space 3} 4.778675
{txt}         /d2 {c |}{col 14}{res}{space 2}-.0653092{col 26}{space 2} .1371551{col 37}{space 1}   -0.48{col 46}{space 3}0.634{col 54}{space 4}-.3342749{col 67}{space 3} .2036564
{txt}         /d3 {c |}{col 14}{res}{space 2} .1262223{col 26}{space 2} .1383996{col 37}{space 1}    0.91{col 46}{space 3}0.362{col 54}{space 4}-.1451837{col 67}{space 3} .3976283
{txt}         /d4 {c |}{col 14}{res}{space 2}-.9835248{col 26}{space 2} .9431047{col 37}{space 1}   -1.04{col 46}{space 3}0.297{col 54}{space 4}-2.832983{col 67}{space 3} .8659339
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
. ///AggHap///
> 
.         ///Partisanship///
> 
.         ///2008///
>         
.         restore 
{txt}
{com}.         preserve
{txt}
{com}.         
.         drop if diff2008==.
{txt}(11377 observations deleted)

{com}.         drop if supportdummy2008==.
{txt}(561 observations deleted)

{com}.         drop if abspart2008==.
{txt}(3 observations deleted)

{com}.         drop if surprise39==.
{txt}(1 observation deleted)

{com}.         drop if time2008==.
{txt}(8 observations deleted)

{com}.         
.         nl (diff2008 ={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2008+({c -(}d2=0{c )-}*abspart2008*surprise39+{c -(}d3=0{c )-}*abspart2008*surprise39*supportdummy2008)*exp({c -(}d4=0{c )-}*(time2008))), cluster(case_id)
{txt}(obs = 958)

Iteration 0:  residual SS = {res} 640985.9
{txt}Iteration 1:  residual SS = {res} 640976.7
{txt}Iteration 2:  residual SS = {res} 640976.3
{txt}Iteration 3:  residual SS = {res} 640975.8
{txt}Iteration 4:  residual SS = {res} 640975.2
{txt}Iteration 5:  residual SS = {res} 640975.2
{txt}Iteration 6:  residual SS = {res} 640975.2
{txt}Iteration 7:  residual SS = {res} 640975.2
{txt}Iteration 8:  residual SS = {res} 640975.2
{txt}Iteration 9:  residual SS = {res} 640975.2
{txt}Iteration 10:  residual SS = {res} 640975.2
{txt}Iteration 11:  residual SS = {res} 640975.2
{txt}Iteration 12:  residual SS = {res} 640975.2
{txt}Iteration 13:  residual SS = {res} 640975.2
{txt}Iteration 14:  residual SS = {res} 640975.2

{txt}Nonlinear regression{col 54}Number of obs = {res}      958
{txt}{col 54}R-squared     = {res}   0.0042
{txt}{col 54}Adj R-squared = {res}   0.0031
{txt}{col 54}Root MSE      = {res} 25.93428
{txt}{col 54}Res. dev.     = {res} 8951.337

{txt}{ralign 78:(Std. Err. adjusted for {res:958} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    diff2008{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2}-1.979867{col 26}{space 2} 2.325376{col 37}{space 1}   -0.85{col 46}{space 3}0.395{col 54}{space 4}-6.543292{col 67}{space 3} 2.583559
{txt}         /d1 {c |}{col 14}{res}{space 2} 4.364332{col 26}{space 2} 2.995785{col 37}{space 1}    1.46{col 46}{space 3}0.145{col 54}{space 4}-1.514735{col 67}{space 3}  10.2434
{txt}         /d2 {c |}{col 14}{res}{space 2} 1.968695{col 26}{space 2} 5.948154{col 37}{space 1}    0.33{col 46}{space 3}0.741{col 54}{space 4}-9.704235{col 67}{space 3} 13.64162
{txt}         /d3 {c |}{col 14}{res}{space 2}-4.294283{col 26}{space 2}  11.6093{col 37}{space 1}   -0.37{col 46}{space 3}0.712{col 54}{space 4} -27.0769{col 67}{space 3} 18.48834
{txt}         /d4 {c |}{col 14}{res}{space 2}-.0133436{col 26}{space 2} .1960211{col 37}{space 1}   -0.07{col 46}{space 3}0.946{col 54}{space 4}-.3980244{col 67}{space 3} .3713371
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
.         ///2012///
>         
.         restore 
{txt}
{com}.         preserve
{txt}
{com}.         
.         drop if diffagghap2012==.
{txt}(4489 observations deleted)

{com}.         drop if supportdummy2012==.
{txt}(3182 observations deleted)

{com}.         drop if abspart2012==.
{txt}(3 observations deleted)

{com}.         drop if surprise303==.
{txt}(3 observations deleted)

{com}.         drop if time2012==.
{txt}(127 observations deleted)

{com}.         
.         nl (diffagghap2012 ={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2012+({c -(}d2=0{c )-}*abspart2012*surprise303+{c -(}d3=0{c )-}*abspart2012*surprise303*supportdummy2012)*exp({c -(}d4=0{c )-}*(time2012))), cluster(case_id)
{txt}(obs = 5104)

Iteration 0:  residual SS = {res}  5975411
{txt}Iteration 1:  residual SS = {res}  5934368
{txt}Iteration 2:  residual SS = {res}  5904487
{txt}Iteration 3:  residual SS = {res}  5893191
{txt}Iteration 4:  residual SS = {res}  5890283
{txt}Iteration 5:  residual SS = {res}  5889783
{txt}Iteration 6:  residual SS = {res}  5889735
{txt}Iteration 7:  residual SS = {res}  5889732
{txt}Iteration 8:  residual SS = {res}  5889732
{txt}Iteration 9:  residual SS = {res}  5889732
{txt}Iteration 10:  residual SS = {res}  5889732
{txt}Iteration 11:  residual SS = {res}  5889732
{txt}Iteration 12:  residual SS = {res}  5889732
{txt}Iteration 13:  residual SS = {res}  5889732

{txt}Nonlinear regression{col 54}Number of obs = {res}     5104
{txt}{col 54}R-squared     = {res}   0.0278
{txt}{col 54}Adj R-squared = {res}   0.0273
{txt}{col 54}Root MSE      = {res} 33.98641
{txt}{col 54}Res. dev.     = {res} 50472.53

{txt}{ralign 78:(Std. Err. adjusted for {res:1736} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffagg~2012{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2} 3.203442{col 26}{space 2} 1.150753{col 37}{space 1}    2.78{col 46}{space 3}0.005{col 54}{space 4} .9464322{col 67}{space 3} 5.460451
{txt}         /d1 {c |}{col 14}{res}{space 2} 3.792856{col 26}{space 2} 1.533296{col 37}{space 1}    2.47{col 46}{space 3}0.013{col 54}{space 4} .7855525{col 67}{space 3}  6.80016
{txt}         /d2 {c |}{col 14}{res}{space 2}-100.3824{col 26}{space 2} 38.37199{col 37}{space 1}   -2.62{col 46}{space 3}0.009{col 54}{space 4}-175.6426{col 67}{space 3}-25.12219
{txt}         /d3 {c |}{col 14}{res}{space 2} 113.0926{col 26}{space 2} 45.37111{col 37}{space 1}    2.49{col 46}{space 3}0.013{col 54}{space 4} 24.10479{col 67}{space 3} 202.0804
{txt}         /d4 {c |}{col 14}{res}{space 2}-1.059985{col 26}{space 2} .3688702{col 37}{space 1}   -2.87{col 46}{space 3}0.004{col 54}{space 4}-1.783462{col 67}{space 3}-.3365085
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
.         ///Overall///
>         
.         restore 
{txt}
{com}.         preserve
{txt}
{com}.         
.         drop if diffagghap==.
{txt}(2958 observations deleted)

{com}.         drop if supportdummy==.
{txt}(3743 observations deleted)

{com}.         drop if abspart==.
{txt}(6 observations deleted)

{com}.         drop if surprise==.
{txt}(4 observations deleted)

{com}.         drop if timeoverall==.
{txt}(135 observations deleted)

{com}.         
.         nl (diffagghap={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy+({c -(}d2=0{c )-}*abspart*surprise+{c -(}d3=0{c )-}*abspart*surprise*supportdummy)*exp({c -(}d4=0{c )-}*(timeoverall))), cluster(case_id)
{txt}(obs = 6062)

Iteration 0:  residual SS = {res}  6630949
{txt}Iteration 1:  residual SS = {res}  6599167
{txt}Iteration 2:  residual SS = {res}  6576457
{txt}Iteration 3:  residual SS = {res}  6568922
{txt}Iteration 4:  residual SS = {res}  6567001
{txt}Iteration 5:  residual SS = {res}  6566651
{txt}Iteration 6:  residual SS = {res}  6566606
{txt}Iteration 7:  residual SS = {res}  6566602
{txt}Iteration 8:  residual SS = {res}  6566601
{txt}Iteration 9:  residual SS = {res}  6566601
{txt}Iteration 10:  residual SS = {res}  6566601
{txt}Iteration 11:  residual SS = {res}  6566601
{txt}Iteration 12:  residual SS = {res}  6566601
{txt}Iteration 13:  residual SS = {res}  6566601
{txt}Iteration 14:  residual SS = {res}  6566601

{txt}Nonlinear regression{col 54}Number of obs = {res}     6062
{txt}{col 54}R-squared     = {res}   0.0218
{txt}{col 54}Adj R-squared = {res}   0.0214
{txt}{col 54}Root MSE      = {res} 32.92619
{txt}{col 54}Res. dev.     = {res} 59562.72

{txt}{ralign 78:(Std. Err. adjusted for {res:2220} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}  diffagghap{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2} 2.503348{col 26}{space 2} 1.005214{col 37}{space 1}    2.49{col 46}{space 3}0.013{col 54}{space 4} .5320894{col 67}{space 3} 4.474606
{txt}         /d1 {c |}{col 14}{res}{space 2} 3.949051{col 26}{space 2} 1.352402{col 37}{space 1}    2.92{col 46}{space 3}0.004{col 54}{space 4} 1.296945{col 67}{space 3} 6.601156
{txt}         /d2 {c |}{col 14}{res}{space 2}-82.38726{col 26}{space 2} 41.44554{col 37}{space 1}   -1.99{col 46}{space 3}0.047{col 54}{space 4}-163.6634{col 67}{space 3}-1.111162
{txt}         /d3 {c |}{col 14}{res}{space 2} 85.29469{col 26}{space 2} 45.33069{col 37}{space 1}    1.88{col 46}{space 3}0.060{col 54}{space 4}-3.600305{col 67}{space 3} 174.1897
{txt}         /d4 {c |}{col 14}{res}{space 2}-1.182679{col 26}{space 2} .4997969{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4}-2.162797{col 67}{space 3}-.2025606
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
.         restore 
{txt}
{com}. 
{txt}end of do-file

{com}. 
. do "/Users/Young/Dropbox/Collin/Project_Code/Do_Files/robustAbspartA.do"
{txt}
{com}. ******************************************************************
. * This do-file 
. *       reads in the APL 08 and 12 Election Data
. *       Runs Robustness Regressions 08 and 12 Data
. *       Created: 4/11/2015, by Collin Raymond and Yang Lu
. *       This version:
. ******************************************************************
. 
. /*
> THIS FILE CREATES PROCESSED FILES FROM RAW FILES.
> EDIT THE cd and globals BEFORE RUNNING THIS FILE
> */
. 
. 
. cd "/Users/Young/Dropbox/Collin/Project_Code"
{res}/Users/Young/Dropbox/Collin/Project_Code
{txt}
{com}. 
. global raw_data     "/Users/Young/Dropbox/Collin/Project_Code/Raw_Data"
{txt}
{com}. global data_pro         "/Users/Young/Dropbox/Collin/Project_Code/Output_Data"
{txt}
{com}. 
. set more off 
{txt}
{com}. 
. use "$data_pro/combined0812", clear
{txt}
{com}. 
. ///Robustness Abspart Part A///
> 
. ///2008///
> 
.         ///RA1-RA3///
>                 
.         preserve
{txt}
{com}. 
.         drop if diffeight2008==.
{txt}(11376 observations deleted)

{com}.         drop if supportdummy2008==.
{txt}(562 observations deleted)

{com}.         drop if abspart2008==.
{txt}(3 observations deleted)

{com}.         drop if surprise39==.
{txt}(1 observation deleted)

{com}.         drop if time2008==.
{txt}(8 observations deleted)

{com}. 
. 
. //nl(diffeight2008={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2008+{c -(}d2=0{c )-}*abspart2008+{c -(}d3=0{c )-}*surprise39+{c -(}d4=0{c )-}*supportdummy2008*abspart2008+/*
. //*/{c -(}d5=0{c )-}*supportdummy2008*surprise39+{c -(}d6=0{c )-}*abspart2008*surprise39+{c -(}d7=0{c )-}*/*
. //*/abspart2008*surprise39*supportdummy2008+({c -(}d8=0{c )-}*abspart2008*surprise39+{c -(}d9=0{c )-}*abspart2008*/*
. //*/surprise39*supportdummy2008+{c -(}d10=0{c )-}+{c -(}d11=0{c )-}*supportdummy2008+{c -(}d12=0{c )-}*abspart2008+{c -(}d13=0{c )-}*/*
. //*/surprise39+{c -(}d14=0{c )-}*supportdummy2008*abspart2008+{c -(}d15=0{c )-}*supportdummy2008*surprise39+{c -(}d16=0{c )-}*abspart2008^2/*
. //*/+{c -(}d17=0{c )-}*surprise39^2+{c -(}d18=0{c )-}*abspart2008^2*supportdummy2008+{c -(}d19=0{c )-}*surprise39^2*supportdummy2008)*exp({c -(}d20=0{c )-}/*
. //*/+{c -(}d21=0{c )-}*time2008+{c -(}d22=0{c )-}*time2008*supportdummy2008+{c -(}d23=0{c )-}*time2008*abspart2008+{c -(}d24=0{c )-}*time2008*surprise39/*
. //*/+{c -(}d25=0{c )-}*time2008*abspart2008*supportdummy2008+{c -(}d26=0{c )-}*time2008*surprise39*supportdummy2008+{c -(}d27=0{c )-}*time2008*/*
. //*/surprise39*abspart2008+{c -(}d28=0{c )-}*time2008*surprise39*abspart2008*supportdummy2008)), cluster(case_id)
. 
. //nl(diffeight2008={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2008+{c -(}d2=0{c )-}*abspart2008+{c -(}d3=0{c )-}*surprise39+{c -(}d4=0{c )-}*supportdummy2008*abspa/*
. //*/rt2008+{c -(}d5=0{c )-}*supportdummy2008*surprise39+{c -(}d6=0{c )-}*abspart2008*surprise39+{c -(}d7=0{c )-}*abspart2008*surprise39*supportdummy/*
. //*/2008+({c -(}d8=0{c )-}*abspart2008*surprise39+{c -(}d9=0{c )-}*abspart2008*surprise39*supportdummy2008)*exp({c -(}d21=0{c )-}*adjtime2008)), clu/*
. //*/ster(case_id)
. 
. //nl(diffeight2008={c -(}d0=2.157388{c )-}+{c -(}d1=-2.793502{c )-}*supportdummy2008+({c -(}d8=-226{c )-}*abspart2008*surprise39+{c -(}d9=350{c )-}*abspart2008*/*
. //*/surprise39*supportdummy2008+{c -(}d10=-188{c )-}+{c -(}d11=222{c )-}*supportdummy2008+{c -(}d12=401{c )-}*abspart2008+{c -(}d13=230.896{c )-}*surprise39/*
. //*/+{c -(}d14=-421{c )-}*supportdummy2008*abspart2008+{c -(}d15=-376.212{c )-}*supportdummy2008*surprise39+{c -(}d16=-232{c )-}*abspart2008^2+{c -(}d17=-89.34898{c )-}*/*
. //*/surprise39^2+{c -(}d18=221{c )-}*abspart2008^2*supportdummy2008+{c -(}d19=194{c )-}*surprise39^2*supportdummy2008)*exp({c -(}d21=-1.3948{c )-}*time2008)), eps(0.001)
. 
. //nl(diffeight2008={c -(}d2=-2.121681{c )-}*abspart2008+{c -(}d4=5.177406{c )-}*supportdummy2008*abspart2008+({c -(}d8=-226{c )-}*abspart2008*surprise39+/*
. //*/{c -(}d9=350{c )-}*abspart2008*surprise39*supportdummy2008+{c -(}d10=-188{c )-}+{c -(}d11=222{c )-}*supportdummy2008+{c -(}d12=401{c )-}*abspart2008+{c -(}d13=230.896{c )-}*/*
. //*/surprise39+{c -(}d14=-421{c )-}*supportdummy2008*abspart2008+{c -(}d15=-376.212{c )-}*supportdummy2008*surprise39+{c -(}d16=-232{c )-}*abspart2008^2+{c -(}d17=-89.34898{c )-}*/*
. //*/surprise39^2+{c -(}d18=221{c )-}*abspart2008^2*supportdummy2008+{c -(}d19=194{c )-}*surprise39^2*supportdummy2008)*exp({c -(}d21=-1.3948{c )-}*time2008)), eps(0.001)
. 
. //nl(diffeight2008=({c -(}d8=-226{c )-}*abspart2008*surprise39+{c -(}d9=350{c )-}*abspart2008*surprise39*supportdummy2008+{c -(}d10=-188{c )-}+{c -(}d11=222{c )-}*supportdummy2008+/*
. //*/{c -(}d12=401{c )-}*abspart2008+{c -(}d13=230.896{c )-}*surprise39+{c -(}d14=-421{c )-}*supportdummy2008*abspart2008+{c -(}d15=-376.212{c )-}*supportdummy2008*surprise39+{c -(}d16=-232{c )-}*/*
. //*/abspart2008^2+{c -(}d17=-89.34898{c )-}*surprise39^2+{c -(}d18=221{c )-}*abspart2008^2*supportdummy2008+{c -(}d19=194{c )-}*surprise39^2*supportdummy2008)*exp({c -(}d21=-1.3948{c )-}*time2008)), eps(0.001)
. 
.         ///with Adjtime///
>         
.         restore
{txt}
{com}.         preserve
{txt}
{com}.         
.         drop if diffeight2008==.
{txt}(11376 observations deleted)

{com}.         drop if supportdummy2008==.
{txt}(562 observations deleted)

{com}.         drop if abspart2008==.
{txt}(3 observations deleted)

{com}.         drop if surprise39==.
{txt}(1 observation deleted)

{com}.         drop if adjtime2008==.
{txt}(8 observations deleted)

{com}.         
. nl(diffeight2008={c -(}d0=2.157388{c )-}+{c -(}d1=-2.793502{c )-}*supportdummy2008+({c -(}d8=-226{c )-}*abspart2008*surprise39+{c -(}d9=350{c )-}*abspart2008*/*
> */surprise39*supportdummy2008+{c -(}d10=-188{c )-}+{c -(}d11=222{c )-}*supportdummy2008+{c -(}d12=401{c )-}*abspart2008+{c -(}d13=230.896{c )-}*surprise39+{c -(}d14=-421{c )-}*/*
> */supportdummy2008*abspart2008+{c -(}d15=-376.212{c )-}*supportdummy2008*surprise39+{c -(}d16=-232{c )-}*abspart2008^2+{c -(}d17=-89.34898{c )-}*surprise39^2+/*
> */{c -(}d18=221{c )-}*abspart2008^2*supportdummy2008+{c -(}d19=194{c )-}*surprise39^2*supportdummy2008)*exp({c -(}d21=-1.3948{c )-}*adjtime2008)), cluster(case_id)
{txt}(obs = 958)

Iteration 0:  residual SS = {res}   194057
{txt}Iteration 1:  residual SS = {res} 193342.5
{txt}Iteration 2:  residual SS = {res} 193258.1
{txt}Iteration 3:  residual SS = {res} 193258.1
{txt}Iteration 4:  residual SS = {res} 193207.5
{txt}Iteration 5:  residual SS = {res} 193207.5

{txt}Nonlinear regression{col 54}Number of obs = {res}      958
{txt}{col 54}R-squared     = {res}   0.1252
{txt}{col 54}Adj R-squared = {res}   0.1242
{txt}{col 54}Root MSE      = {res} 14.30626
{txt}{col 54}Res. dev.     = {res} 7802.478

{txt}{ralign 78:(Std. Err. adjusted for {res:958} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2008{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2}-1.461039{col 26}{space 2} .8547217{col 37}{space 1}   -1.71{col 46}{space 3}0.088{col 54}{space 4}-3.138384{col 67}{space 3} .2163062
{txt}         /d1 {c |}{col 14}{res}{space 2} 2.418246{col 26}{space 2} 1.222834{col 37}{space 1}    1.98{col 46}{space 3}0.048{col 54}{space 4} .0184999{col 67}{space 3} 4.817992
{txt}         /d8 {c |}{col 14}{res}{space 2}-21.42703{col 26}{space 2}  16.2669{col 37}{space 1}   -1.32{col 46}{space 3}0.188{col 54}{space 4}-53.34995{col 67}{space 3} 10.49588
{txt}         /d9 {c |}{col 14}{res}{space 2} 37.31846{col 26}{space 2} 27.60474{col 37}{space 1}    1.35{col 46}{space 3}0.177{col 54}{space 4}-16.85435{col 67}{space 3} 91.49128
{txt}        /d10 {c |}{col 14}{res}{space 2}-6.448506{col 26}{space 2} 9.871463{col 37}{space 1}   -0.65{col 46}{space 3}0.514{col 54}{space 4}-25.82072{col 67}{space 3} 12.92371
{txt}        /d11 {c |}{col 14}{res}{space 2} 22.29931{col 26}{space 2} 14.13158{col 37}{space 1}    1.58{col 46}{space 3}0.115{col 54}{space 4}-5.433149{col 67}{space 3} 50.03177
{txt}        /d12 {c |}{col 14}{res}{space 2} 31.32804{col 26}{space 2}   23.566{col 37}{space 1}    1.33{col 46}{space 3}0.184{col 54}{space 4}-14.91895{col 67}{space 3} 77.57503
{txt}        /d13 {c |}{col 14}{res}{space 2}-5.014919{col 26}{space 2} 19.28907{col 37}{space 1}   -0.26{col 46}{space 3}0.795{col 54}{space 4}-42.86868{col 67}{space 3} 32.83885
{txt}        /d14 {c |}{col 14}{res}{space 2}-73.64206{col 26}{space 2} 36.61845{col 37}{space 1}   -2.01{col 46}{space 3}0.045{col 54}{space 4}-145.5038{col 67}{space 3}-1.780335
{txt}        /d15 {c |}{col 14}{res}{space 2}-13.44989{col 26}{space 2} 32.87464{col 37}{space 1}   -0.41{col 46}{space 3}0.683{col 54}{space 4} -77.9646{col 67}{space 3} 51.06481
{txt}        /d16 {c |}{col 14}{res}{space 2}-20.95004{col 26}{space 2} 15.32257{col 37}{space 1}   -1.37{col 46}{space 3}0.172{col 54}{space 4}-51.01976{col 67}{space 3} 9.119672
{txt}        /d17 {c |}{col 14}{res}{space 2} 2.432212{col 26}{space 2} 14.59074{col 37}{space 1}    0.17{col 46}{space 3}0.868{col 54}{space 4}-26.20133{col 67}{space 3} 31.06576
{txt}        /d18 {c |}{col 14}{res}{space 2} 53.07446{col 26}{space 2}  25.0421{col 37}{space 1}    2.12{col 46}{space 3}0.034{col 54}{space 4} 3.930691{col 67}{space 3} 102.2182
{txt}        /d19 {c |}{col 14}{res}{space 2}  6.33435{col 26}{space 2} 34.43723{col 37}{space 1}    0.18{col 46}{space 3}0.854{col 54}{space 4}-61.24684{col 67}{space 3} 73.91554
{txt}        /d21 {c |}{col 14}{res}{space 2}-74.36255{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d21 taken as constant term in model

{com}. 
. nl(diffeight2008={c -(}d2=-2.121681{c )-}*abspart2008+{c -(}d4=5.177406{c )-}*supportdummy2008*abspart2008+({c -(}d8=-226{c )-}*abspart2008*surprise39+{c -(}d9=350{c )-}*/*
> */abspart2008*surprise39*supportdummy2008+{c -(}d10=-188{c )-}+{c -(}d11=222{c )-}*supportdummy2008+{c -(}d12=401{c )-}*abspart2008+{c -(}d13=230.896{c )-}*surprise39+/*
> */{c -(}d14=-421{c )-}*supportdummy2008*abspart2008+{c -(}d15=-376.212{c )-}*supportdummy2008*surprise39+{c -(}d16=-232{c )-}*abspart2008^2+{c -(}d17=-89.34898{c )-}*/*
> */surprise39^2+{c -(}d18=221{c )-}*abspart2008^2*supportdummy2008+{c -(}d19=194{c )-}*surprise39^2*supportdummy2008)*exp({c -(}d21=-1.3948{c )-}*adjtime2008)),cluster(case_id)
{txt}(obs = 958)

Iteration 0:  residual SS = {res}   193825
{txt}Iteration 1:  residual SS = {res} 193010.4
{txt}Iteration 2:  residual SS = {res} 192922.1
{txt}Iteration 3:  residual SS = {res} 192833.8
{txt}Iteration 4:  residual SS = {res} 192833.8

{txt}Nonlinear regression{col 54}Number of obs = {res}      958
{txt}{col 54}R-squared     = {res}   0.1269
{txt}{col 54}Adj R-squared = {res}   0.1259
{txt}{col 54}Root MSE      = {res} 14.29241
{txt}{col 54}Res. dev.     = {res} 7800.623

{txt}{ralign 78:(Std. Err. adjusted for {res:958} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2008{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d2 {c |}{col 14}{res}{space 2}-2.422249{col 26}{space 2} 1.059771{col 37}{space 1}   -2.29{col 46}{space 3}0.022{col 54}{space 4}-4.501992{col 67}{space 3}-.3425053
{txt}         /d4 {c |}{col 14}{res}{space 2} 3.800695{col 26}{space 2} 1.482931{col 37}{space 1}    2.56{col 46}{space 3}0.011{col 54}{space 4} .8905221{col 67}{space 3} 6.710868
{txt}         /d8 {c |}{col 14}{res}{space 2}-21.42703{col 26}{space 2}  16.2669{col 37}{space 1}   -1.32{col 46}{space 3}0.188{col 54}{space 4}-53.34995{col 67}{space 3} 10.49588
{txt}         /d9 {c |}{col 14}{res}{space 2} 37.31846{col 26}{space 2} 27.60474{col 37}{space 1}    1.35{col 46}{space 3}0.177{col 54}{space 4}-16.85435{col 67}{space 3} 91.49128
{txt}        /d10 {c |}{col 14}{res}{space 2}-7.909545{col 26}{space 2}  9.83439{col 37}{space 1}   -0.80{col 46}{space 3}0.421{col 54}{space 4}  -27.209{col 67}{space 3} 11.38991
{txt}        /d11 {c |}{col 14}{res}{space 2} 24.71756{col 26}{space 2} 14.07857{col 37}{space 1}    1.76{col 46}{space 3}0.079{col 54}{space 4} -2.91088{col 67}{space 3} 52.34599
{txt}        /d12 {c |}{col 14}{res}{space 2} 33.75029{col 26}{space 2} 23.58981{col 37}{space 1}    1.43{col 46}{space 3}0.153{col 54}{space 4}-12.54344{col 67}{space 3} 80.04402
{txt}        /d13 {c |}{col 14}{res}{space 2}-5.014918{col 26}{space 2} 19.28907{col 37}{space 1}   -0.26{col 46}{space 3}0.795{col 54}{space 4}-42.86868{col 67}{space 3} 32.83885
{txt}        /d14 {c |}{col 14}{res}{space 2}-77.44276{col 26}{space 2} 36.64847{col 37}{space 1}   -2.11{col 46}{space 3}0.035{col 54}{space 4}-149.3634{col 67}{space 3}-5.522129
{txt}        /d15 {c |}{col 14}{res}{space 2} -13.4499{col 26}{space 2} 32.87464{col 37}{space 1}   -0.41{col 46}{space 3}0.683{col 54}{space 4} -77.9646{col 67}{space 3} 51.06481
{txt}        /d16 {c |}{col 14}{res}{space 2}-20.95004{col 26}{space 2} 15.32257{col 37}{space 1}   -1.37{col 46}{space 3}0.172{col 54}{space 4}-51.01976{col 67}{space 3} 9.119672
{txt}        /d17 {c |}{col 14}{res}{space 2} 2.432212{col 26}{space 2} 14.59074{col 37}{space 1}    0.17{col 46}{space 3}0.868{col 54}{space 4}-26.20133{col 67}{space 3} 31.06576
{txt}        /d18 {c |}{col 14}{res}{space 2} 53.07446{col 26}{space 2}  25.0421{col 37}{space 1}    2.12{col 46}{space 3}0.034{col 54}{space 4} 3.930692{col 67}{space 3} 102.2182
{txt}        /d19 {c |}{col 14}{res}{space 2}  6.33435{col 26}{space 2} 34.43723{col 37}{space 1}    0.18{col 46}{space 3}0.854{col 54}{space 4}-61.24684{col 67}{space 3} 73.91554
{txt}        /d21 {c |}{col 14}{res}{space 2}-47.49714{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d21 taken as constant term in model

{com}. 
. nl(diffeight2008={c -(}d0=2.157388{c )-}+{c -(}d1=-2.793502{c )-}*supportdummy2008+{c -(}d2=-2.121681{c )-}*abspart2008+{c -(}d4=5.177406{c )-}*supportdummy2008*abspart2008+/*
> */({c -(}d8=-226{c )-}*abspart2008*surprise39+{c -(}d9=350{c )-}*abspart2008*surprise39*supportdummy2008+{c -(}d10=-188{c )-}+{c -(}d11=222{c )-}*supportdummy2008+{c -(}d12=401{c )-}*/*
> */abspart2008+{c -(}d13=230.896{c )-}*surprise39+{c -(}d14=-421{c )-}*supportdummy2008*abspart2008+{c -(}d15=-376.212{c )-}*supportdummy2008*surprise39+{c -(}d16=-232{c )-}*/*
> */abspart2008^2+{c -(}d17=-89.34898{c )-}*surprise39^2+{c -(}d18=221{c )-}*abspart2008^2*supportdummy2008+{c -(}d19=194{c )-}*surprise39^2*supportdummy2008)*/*
> */exp({c -(}d21=-1.3948{c )-}*adjtime2008)), cluster(case_id)
{txt}(obs = 958)

Iteration 0:  residual SS = {res} 193647.9
{txt}Iteration 1:  residual SS = {res} 192849.5
{txt}Iteration 2:  residual SS = {res} 192766.4
{txt}Iteration 3:  residual SS = {res} 192678.1
{txt}Iteration 4:  residual SS = {res} 192678.1

{txt}Nonlinear regression{col 54}Number of obs = {res}      958
{txt}{col 54}R-squared     = {res}   0.1276
{txt}{col 54}Adj R-squared = {res}   0.1266
{txt}{col 54}Root MSE      = {res}  14.3018
{txt}{col 54}Res. dev.     = {res}  7799.85

{txt}{ralign 78:(Std. Err. adjusted for {res:958} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2008{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2} 2.257765{col 26}{space 2} 2.519176{col 37}{space 1}    0.90{col 46}{space 3}0.370{col 54}{space 4}-2.685982{col 67}{space 3} 7.201512
{txt}         /d1 {c |}{col 14}{res}{space 2}-2.554146{col 26}{space 2} 3.768392{col 37}{space 1}   -0.68{col 46}{space 3}0.498{col 54}{space 4}-9.949412{col 67}{space 3}  4.84112
{txt}         /d2 {c |}{col 14}{res}{space 2}-5.133727{col 26}{space 2} 3.147745{col 37}{space 1}   -1.63{col 46}{space 3}0.103{col 54}{space 4}-11.31101{col 67}{space 3} 1.043552
{txt}         /d4 {c |}{col 14}{res}{space 2} 6.869465{col 26}{space 2} 4.634646{col 37}{space 1}    1.48{col 46}{space 3}0.139{col 54}{space 4}-2.225777{col 67}{space 3} 15.96471
{txt}         /d8 {c |}{col 14}{res}{space 2}-21.42703{col 26}{space 2} 16.28416{col 37}{space 1}   -1.32{col 46}{space 3}0.189{col 54}{space 4}-53.38382{col 67}{space 3} 10.52975
{txt}         /d9 {c |}{col 14}{res}{space 2} 37.31846{col 26}{space 2} 27.63403{col 37}{space 1}    1.35{col 46}{space 3}0.177{col 54}{space 4}-16.91183{col 67}{space 3} 91.54876
{txt}        /d10 {c |}{col 14}{res}{space 2}-10.16731{col 26}{space 2} 10.16203{col 37}{space 1}   -1.00{col 46}{space 3}0.317{col 54}{space 4}-30.10974{col 67}{space 3} 9.775121
{txt}        /d11 {c |}{col 14}{res}{space 2}  27.2717{col 26}{space 2} 14.58862{col 37}{space 1}    1.87{col 46}{space 3}0.062{col 54}{space 4}-1.357673{col 67}{space 3} 55.90108
{txt}        /d12 {c |}{col 14}{res}{space 2} 36.46177{col 26}{space 2} 23.80007{col 37}{space 1}    1.53{col 46}{space 3}0.126{col 54}{space 4}-10.24459{col 67}{space 3} 83.16812
{txt}        /d13 {c |}{col 14}{res}{space 2}-5.014919{col 26}{space 2} 19.30954{col 37}{space 1}   -0.26{col 46}{space 3}0.795{col 54}{space 4}-42.90885{col 67}{space 3} 32.87901
{txt}        /d14 {c |}{col 14}{res}{space 2}-80.51153{col 26}{space 2} 36.94912{col 37}{space 1}   -2.18{col 46}{space 3}0.030{col 54}{space 4}-153.0222{col 67}{space 3}-8.000871
{txt}        /d15 {c |}{col 14}{res}{space 2}-13.44989{col 26}{space 2} 32.90952{col 37}{space 1}   -0.41{col 46}{space 3}0.683{col 54}{space 4}-78.03305{col 67}{space 3} 51.13326
{txt}        /d16 {c |}{col 14}{res}{space 2}-20.95004{col 26}{space 2} 15.33883{col 37}{space 1}   -1.37{col 46}{space 3}0.172{col 54}{space 4}-51.05167{col 67}{space 3} 9.151576
{txt}        /d17 {c |}{col 14}{res}{space 2} 2.432212{col 26}{space 2} 14.60622{col 37}{space 1}    0.17{col 46}{space 3}0.868{col 54}{space 4}-26.23171{col 67}{space 3} 31.09614
{txt}        /d18 {c |}{col 14}{res}{space 2} 53.07446{col 26}{space 2} 25.06867{col 37}{space 1}    2.12{col 46}{space 3}0.035{col 54}{space 4}  3.87855{col 67}{space 3} 102.2704
{txt}        /d19 {c |}{col 14}{res}{space 2}  6.33435{col 26}{space 2} 34.47376{col 37}{space 1}    0.18{col 46}{space 3}0.854{col 54}{space 4}-61.31855{col 67}{space 3} 73.98725
{txt}        /d21 {c |}{col 14}{res}{space 2}-37.31719{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d21 taken as constant term in model

{com}. 
. nl(diffeight2008=({c -(}d8=-226{c )-}*abspart2008*surprise39+{c -(}d9=350{c )-}*abspart2008*surprise39*supportdummy2008+{c -(}d10=-188{c )-}+{c -(}d11=222{c )-}*supportdummy2008/*
> */+{c -(}d12=401{c )-}*abspart2008+{c -(}d13=230.896{c )-}*surprise39+{c -(}d14=-421{c )-}*supportdummy2008*abspart2008+{c -(}d15=-376.212{c )-}*/*
> */supportdummy2008*surprise39+{c -(}d16=-232{c )-}*abspart2008^2+{c -(}d17=-89.34898{c )-}*surprise39^2+{c -(}d18=221{c )-}*abspart2008^2*supportdummy2008+/*
> */{c -(}d19=194{c )-}*surprise39^2*supportdummy2008)*exp({c -(}d21=-1.3948{c )-}*adjtime2008)), cluster(case_id)
{txt}(obs = 958)

Iteration 0:  residual SS = {res} 194277.8
{txt}Iteration 1:  residual SS = {res} 194040.2
{txt}Iteration 2:  residual SS = {res} 193939.8
{txt}Iteration 3:  residual SS = {res} 193906.8
{txt}Iteration 4:  residual SS = {res}   193904
{txt}Iteration 5:  residual SS = {res}   193904
{txt}Iteration 6:  residual SS = {res}   193904

{txt}Nonlinear regression{col 54}Number of obs = {res}      958
{txt}{col 54}R-squared     = {res}   0.1220
{txt}{col 54}Adj R-squared = {res}   0.1211
{txt}{col 54}Root MSE      = {res} 14.31686
{txt}{col 54}Res. dev.     = {res} 7805.925

{txt}{ralign 78:(Std. Err. adjusted for {res:958} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2008{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d8 {c |}{col 14}{res}{space 2}-21.42703{col 26}{space 2}  16.2497{col 37}{space 1}   -1.32{col 46}{space 3}0.188{col 54}{space 4}-53.31619{col 67}{space 3} 10.46212
{txt}         /d9 {c |}{col 14}{res}{space 2} 37.31846{col 26}{space 2} 27.57555{col 37}{space 1}    1.35{col 46}{space 3}0.176{col 54}{space 4}-16.79706{col 67}{space 3} 91.43399
{txt}        /d10 {c |}{col 14}{res}{space 2}-7.909545{col 26}{space 2} 9.823989{col 37}{space 1}   -0.81{col 46}{space 3}0.421{col 54}{space 4}-27.18859{col 67}{space 3}  11.3695
{txt}        /d11 {c |}{col 14}{res}{space 2} 24.71756{col 26}{space 2} 14.06368{col 37}{space 1}    1.76{col 46}{space 3}0.079{col 54}{space 4}-2.881659{col 67}{space 3} 52.31677
{txt}        /d12 {c |}{col 14}{res}{space 2} 31.32804{col 26}{space 2} 23.54107{col 37}{space 1}    1.33{col 46}{space 3}0.184{col 54}{space 4}-14.87004{col 67}{space 3} 77.52612
{txt}        /d13 {c |}{col 14}{res}{space 2}-5.014919{col 26}{space 2} 19.26867{col 37}{space 1}   -0.26{col 46}{space 3}0.795{col 54}{space 4}-42.82865{col 67}{space 3} 32.79881
{txt}        /d14 {c |}{col 14}{res}{space 2}-73.64206{col 26}{space 2} 36.57972{col 37}{space 1}   -2.01{col 46}{space 3}0.044{col 54}{space 4}-145.4278{col 67}{space 3} -1.85634
{txt}        /d15 {c |}{col 14}{res}{space 2}-13.44989{col 26}{space 2} 32.83987{col 37}{space 1}   -0.41{col 46}{space 3}0.682{col 54}{space 4}-77.89637{col 67}{space 3} 50.99658
{txt}        /d16 {c |}{col 14}{res}{space 2}-20.95004{col 26}{space 2} 15.30637{col 37}{space 1}   -1.37{col 46}{space 3}0.171{col 54}{space 4}-50.98796{col 67}{space 3} 9.087869
{txt}        /d17 {c |}{col 14}{res}{space 2} 2.432212{col 26}{space 2} 14.57531{col 37}{space 1}    0.17{col 46}{space 3}0.868{col 54}{space 4}-26.17105{col 67}{space 3} 31.03547
{txt}        /d18 {c |}{col 14}{res}{space 2} 53.07446{col 26}{space 2} 25.01562{col 37}{space 1}    2.12{col 46}{space 3}0.034{col 54}{space 4} 3.982668{col 67}{space 3} 102.1663
{txt}        /d19 {c |}{col 14}{res}{space 2}  6.33435{col 26}{space 2}  34.4008{col 37}{space 1}    0.18{col 46}{space 3}0.854{col 54}{space 4}-61.17537{col 67}{space 3} 73.84407
{txt}        /d21 {c |}{col 14}{res}{space 2}-32.10237{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d21 taken as constant term in model

{com}. 
.         restore
{txt}
{com}.         preserve 
{txt}
{com}.         
.         drop if diffeight2008==.
{txt}(11376 observations deleted)

{com}.         drop if supportdummy2008==.
{txt}(562 observations deleted)

{com}.         drop if abspart2008==.
{txt}(3 observations deleted)

{com}.         drop if surprise39==.
{txt}(1 observation deleted)

{com}.         drop if time2008==.
{txt}(8 observations deleted)

{com}.         
.         ///RA4///
> 
. nl(diffeight2008={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2008+({c -(}d8=0{c )-}*abspart2008*surprise39+{c -(}d9=0{c )-}*abspart2008*surprise39*supportdummy2008)*/*
> */exp({c -(}d20=0{c )-}+{c -(}d21=0{c )-}*time2008+{c -(}d22=0{c )-}*time2008*supportdummy2008+{c -(}d23=0{c )-}*time2008*abspart2008+{c -(}d24=0{c )-}*time2008*/*
> */surprise39+{c -(}d25=0{c )-}*time2008*abspart2008*supportdummy2008+{c -(}d26=0{c )-}*time2008*surprise39*supportdummy2008+{c -(}d27=0{c )-}*/*
> */time2008*surprise39*abspart2008+{c -(}d28=0{c )-}*time2008*surprise39*abspart2008*supportdummy2008)), cluster(case_id)
{txt}(obs = 958)

Iteration 0:  residual SS = {res} 201984.1
{txt}Iteration 1:  residual SS = {res} 201983.4
{txt}Iteration 2:  residual SS = {res} 201662.4
{txt}Iteration 3:  residual SS = {res} 201363.9
{txt}Iteration 4:  residual SS = {res} 201151.2
{txt}Iteration 5:  residual SS = {res} 201094.6
{txt}Iteration 6:  residual SS = {res} 200590.5
{txt}Iteration 7:  residual SS = {res} 200461.4
{txt}Iteration 8:  residual SS = {res} 200138.6
{txt}Iteration 9:  residual SS = {res} 199885.3
{txt}Iteration 10:  residual SS = {res} 198570.1
{txt}Iteration 11:  residual SS = {res} 198467.8
{txt}Iteration 12:  residual SS = {res} 198184.1
{txt}Iteration 13:  residual SS = {res} 197625.8
{txt}Iteration 14:  residual SS = {res}   197025
{txt}Iteration 15:  residual SS = {res} 196735.6
{txt}Iteration 16:  residual SS = {res} 196713.6
{txt}Iteration 17:  residual SS = {res} 196631.6
{txt}Iteration 18:  residual SS = {res} 196520.1
{txt}Iteration 19:  residual SS = {res}   196508
{txt}Iteration 20:  residual SS = {res} 196466.1
{txt}Iteration 21:  residual SS = {res}   196417
{txt}Iteration 22:  residual SS = {res} 196377.9
{txt}Iteration 23:  residual SS = {res}   196363
{txt}Iteration 24:  residual SS = {res} 196342.8
{txt}Iteration 25:  residual SS = {res} 196339.8
{txt}Iteration 26:  residual SS = {res} 196338.4
{txt}Iteration 27:  residual SS = {res} 196337.9
{txt}Iteration 28:  residual SS = {res} 196337.9
{txt}Iteration 29:  residual SS = {res} 196337.8
{txt}Iteration 30:  residual SS = {res} 196337.8
{txt}Iteration 31:  residual SS = {res} 196337.8
{txt}Iteration 32:  residual SS = {res} 196337.8
{txt}Iteration 33:  residual SS = {res} 196337.8
{txt}Iteration 34:  residual SS = {res} 196337.8
{txt}Iteration 35:  residual SS = {res} 196337.8
{txt}Iteration 36:  residual SS = {res} 196337.8
{txt}Iteration 37:  residual SS = {res} 196337.8
{txt}Iteration 38:  residual SS = {res} 196337.8
{txt}Iteration 39:  residual SS = {res} 196337.8
{txt}Iteration 40:  residual SS = {res} 196337.8
{txt}Iteration 41:  residual SS = {res} 196337.8
{txt}Iteration 42:  residual SS = {res} 196337.8

{txt}Nonlinear regression{col 54}Number of obs = {res}      958
{txt}{col 54}R-squared     = {res}   0.1110
{txt}{col 54}Adj R-squared = {res}   0.1101
{txt}{col 54}Root MSE      = {res} 14.40643
{txt}{col 54}Res. dev.     = {res} 7817.875

{txt}{ralign 78:(Std. Err. adjusted for {res:958} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2008{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2}-1.559697{col 26}{space 2} 1.004501{col 37}{space 1}   -1.55{col 46}{space 3}0.121{col 54}{space 4}-3.530976{col 67}{space 3} .4115815
{txt}         /d1 {c |}{col 14}{res}{space 2} 2.967497{col 26}{space 2} 1.347035{col 37}{space 1}    2.20{col 46}{space 3}0.028{col 54}{space 4} .3240137{col 67}{space 3} 5.610981
{txt}         /d8 {c |}{col 14}{res}{space 2}-1.789331{col 26}{space 2} 3.171516{col 37}{space 1}   -0.56{col 46}{space 3}0.573{col 54}{space 4} -8.01326{col 67}{space 3} 4.434598
{txt}         /d9 {c |}{col 14}{res}{space 2} 17.13729{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}        /d20 {c |}{col 14}{res}{space 2} 2.569025{col 26}{space 2}  1.74448{col 37}{space 1}    1.47{col 46}{space 3}0.141{col 54}{space 4}-.8544232{col 67}{space 3} 5.992474
{txt}        /d21 {c |}{col 14}{res}{space 2}-6.197632{col 26}{space 2} 4.683258{col 37}{space 1}   -1.32{col 46}{space 3}0.186{col 54}{space 4}-15.38827{col 67}{space 3}  2.99301
{txt}        /d22 {c |}{col 14}{res}{space 2} 7.381542{col 26}{space 2} 4.764885{col 37}{space 1}    1.55{col 46}{space 3}0.122{col 54}{space 4}-1.969288{col 67}{space 3} 16.73237
{txt}        /d23 {c |}{col 14}{res}{space 2} 5.370095{col 26}{space 2} 4.451733{col 37}{space 1}    1.21{col 46}{space 3}0.228{col 54}{space 4} -3.36619{col 67}{space 3} 14.10638
{txt}        /d24 {c |}{col 14}{res}{space 2} 6.901002{col 26}{space 2} 4.958403{col 37}{space 1}    1.39{col 46}{space 3}0.164{col 54}{space 4}-2.829596{col 67}{space 3}  16.6316
{txt}        /d25 {c |}{col 14}{res}{space 2}-7.528194{col 26}{space 2} 5.231018{col 37}{space 1}   -1.44{col 46}{space 3}0.150{col 54}{space 4}-17.79378{col 67}{space 3} 2.737395
{txt}        /d26 {c |}{col 14}{res}{space 2}-36.42136{col 26}{space 2} 35.54326{col 37}{space 1}   -1.02{col 46}{space 3}0.306{col 54}{space 4}-106.1731{col 67}{space 3} 33.33037
{txt}        /d27 {c |}{col 14}{res}{space 2}-6.385926{col 26}{space 2} 4.878946{col 37}{space 1}   -1.31{col 46}{space 3}0.191{col 54}{space 4}-15.96059{col 67}{space 3} 3.188741
{txt}        /d28 {c |}{col 14}{res}{space 2} 31.59409{col 26}{space 2} 35.33684{col 37}{space 1}    0.89{col 46}{space 3}0.372{col 54}{space 4}-37.75254{col 67}{space 3} 100.9407
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
. nl(diffeight2008={c -(}d2=0{c )-}*abspart2008+{c -(}d4=0{c )-}*supportdummy2008*abspart2008+({c -(}d8=0{c )-}*abspart2008*surprise39+{c -(}d9=0{c )-}*abspart2008*/*
> */surprise39*supportdummy2008)*exp({c -(}d20=0{c )-}+{c -(}d21=0{c )-}*time2008+{c -(}d22=0{c )-}*time2008*supportdummy2008+{c -(}d23=0{c )-}*time2008*/*
> */abspart2008+{c -(}d24=0{c )-}*time2008*surprise39+{c -(}d25=0{c )-}*time2008*abspart2008*supportdummy2008+{c -(}d26=0{c )-}*time2008*surprise39*/*
> */supportdummy2008+{c -(}d27=0{c )-}*time2008*surprise39*abspart2008+{c -(}d28=0{c )-}*time2008*surprise39*abspart2008*supportdummy2008)), cluster(case_id)
{txt}(obs = 958)

Iteration 0:  residual SS = {res} 201450.7
{txt}Iteration 1:  residual SS = {res} 201450.3
{txt}Iteration 2:  residual SS = {res} 200540.5
{txt}Iteration 3:  residual SS = {res} 200299.7
{txt}Iteration 4:  residual SS = {res} 199884.7
{txt}Iteration 5:  residual SS = {res} 199345.5
{txt}Iteration 6:  residual SS = {res} 198676.7
{txt}Iteration 7:  residual SS = {res} 197793.3
{txt}Iteration 8:  residual SS = {res} 197382.4
{txt}Iteration 9:  residual SS = {res} 197289.8
{txt}Iteration 10:  residual SS = {res} 197156.9
{txt}Iteration 11:  residual SS = {res} 196941.2
{txt}Iteration 12:  residual SS = {res} 196787.1
{txt}Iteration 13:  residual SS = {res} 196684.4
{txt}Iteration 14:  residual SS = {res} 196668.6
{txt}Iteration 15:  residual SS = {res} 196665.2
{txt}Iteration 16:  residual SS = {res} 196663.8
{txt}Iteration 17:  residual SS = {res} 196663.7
{txt}Iteration 18:  residual SS = {res} 196663.4
{txt}Iteration 19:  residual SS = {res}   196663
{txt}Iteration 20:  residual SS = {res}   196663
{txt}Iteration 21:  residual SS = {res}   196663
{txt}Iteration 22:  residual SS = {res}   196663
{txt}Iteration 23:  residual SS = {res}   196663
{txt}Iteration 24:  residual SS = {res}   196663
{txt}Iteration 25:  residual SS = {res}   196663
{txt}Iteration 26:  residual SS = {res}   196663
{txt}Iteration 27:  residual SS = {res}   196663
{txt}Iteration 28:  residual SS = {res}   196663
{txt}Iteration 29:  residual SS = {res}   196663
{txt}Iteration 30:  residual SS = {res}   196663
{txt}Iteration 31:  residual SS = {res}   196663
{txt}Iteration 32:  residual SS = {res}   196663
{txt}Iteration 33:  residual SS = {res}   196663
{txt}Iteration 34:  residual SS = {res}   196663
{txt}Iteration 35:  residual SS = {res}   196663
{txt}Iteration 36:  residual SS = {res}   196663
{txt}Iteration 37:  residual SS = {res}   196663
{txt}Iteration 38:  residual SS = {res}   196663

{txt}Nonlinear regression{col 54}Number of obs = {res}      958
{txt}{col 54}R-squared     = {res}   0.1130
{txt}{col 54}Adj R-squared = {res}   0.1121
{txt}{col 54}Root MSE      = {res} 14.41836
{txt}{col 54}Res. dev.     = {res}  7819.46

{txt}{ralign 78:(Std. Err. adjusted for {res:958} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2008{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d2 {c |}{col 14}{res}{space 2}-2.551082{col 26}{space 2} 1.420366{col 37}{space 1}   -1.80{col 46}{space 3}0.073{col 54}{space 4}-5.338474{col 67}{space 3} .2363096
{txt}         /d4 {c |}{col 14}{res}{space 2} 7.420882{col 26}{space 2} 2.175905{col 37}{space 1}    3.41{col 46}{space 3}0.001{col 54}{space 4} 3.150786{col 67}{space 3} 11.69098
{txt}         /d8 {c |}{col 14}{res}{space 2}-14.93494{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}         /d9 {c |}{col 14}{res}{space 2} 13.46014{col 26}{space 2}  2.75506{col 37}{space 1}    4.89{col 46}{space 3}0.000{col 54}{space 4} 8.053484{col 67}{space 3}  18.8668
{txt}        /d20 {c |}{col 14}{res}{space 2} .4215345{col 26}{space 2} .3844161{col 37}{space 1}    1.10{col 46}{space 3}0.273{col 54}{space 4}-.3328613{col 67}{space 3}  1.17593
{txt}        /d21 {c |}{col 14}{res}{space 2}-5.585352{col 26}{space 2}  4.43871{col 37}{space 1}   -1.26{col 46}{space 3}0.209{col 54}{space 4}-14.29608{col 67}{space 3} 3.125376
{txt}        /d22 {c |}{col 14}{res}{space 2} 5.634878{col 26}{space 2} 4.439441{col 37}{space 1}    1.27{col 46}{space 3}0.205{col 54}{space 4}-3.077284{col 67}{space 3} 14.34704
{txt}        /d23 {c |}{col 14}{res}{space 2} 4.441083{col 26}{space 2} 4.174505{col 37}{space 1}    1.06{col 46}{space 3}0.288{col 54}{space 4}-3.751158{col 67}{space 3} 12.63332
{txt}        /d24 {c |}{col 14}{res}{space 2} 6.302385{col 26}{space 2} 4.764842{col 37}{space 1}    1.32{col 46}{space 3}0.186{col 54}{space 4} -3.04836{col 67}{space 3} 15.65313
{txt}        /d25 {c |}{col 14}{res}{space 2}-4.429626{col 26}{space 2} 4.176655{col 37}{space 1}   -1.06{col 46}{space 3}0.289{col 54}{space 4}-12.62609{col 67}{space 3} 3.766834
{txt}        /d26 {c |}{col 14}{res}{space 2}-6.363233{col 26}{space 2} 4.769324{col 37}{space 1}   -1.33{col 46}{space 3}0.182{col 54}{space 4}-15.72277{col 67}{space 3} 2.996308
{txt}        /d27 {c |}{col 14}{res}{space 2}-5.476418{col 26}{space 2} 4.653876{col 37}{space 1}   -1.18{col 46}{space 3}0.240{col 54}{space 4} -14.6094{col 67}{space 3} 3.656561
{txt}        /d28 {c |}{col 14}{res}{space 2} 5.496955{col 26}{space 2} 4.666822{col 37}{space 1}    1.18{col 46}{space 3}0.239{col 54}{space 4} -3.66143{col 67}{space 3} 14.65534
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. nl(diffeight2008={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2008+{c -(}d2=0{c )-}*abspart2008+{c -(}d4=0{c )-}*supportdummy2008*abspart2008+({c -(}d8=0{c )-}*abspart2008*/*
> */surprise39+{c -(}d9=0{c )-}*abspart2008*surprise39*supportdummy2008)*exp({c -(}d20=0{c )-}+{c -(}d21=0{c )-}*time2008+{c -(}d22=0{c )-}*time2008*/*
> */supportdummy2008+{c -(}d23=0{c )-}*time2008*abspart2008+{c -(}d24=0{c )-}*time2008*surprise39+{c -(}d25=0{c )-}*time2008*abspart2008*supportdummy2008/*
> */+{c -(}d26=0{c )-}*time2008*surprise39*supportdummy2008+{c -(}d27=0{c )-}*time2008*surprise39*abspart2008+{c -(}d28=0{c )-}*time2008*surprise39*abspart2008*supportdummy2008)), cluster(case_id)
{txt}(obs = 958)

Iteration 0:  residual SS = {res} 201449.1
{txt}Iteration 1:  residual SS = {res} 201448.6
{txt}Iteration 2:  residual SS = {res} 200537.5
{txt}Iteration 3:  residual SS = {res} 200304.2
{txt}Iteration 4:  residual SS = {res} 199862.4
{txt}Iteration 5:  residual SS = {res} 199346.8
{txt}Iteration 6:  residual SS = {res}   198609
{txt}Iteration 7:  residual SS = {res} 197555.5
{txt}Iteration 8:  residual SS = {res} 197141.6
{txt}Iteration 9:  residual SS = {res} 197101.2
{txt}Iteration 10:  residual SS = {res} 197078.4
{txt}Iteration 11:  residual SS = {res} 197057.7
{txt}Iteration 12:  residual SS = {res} 197036.3
{txt}Iteration 13:  residual SS = {res} 197014.9
{txt}Iteration 14:  residual SS = {res} 196996.2
{txt}Iteration 15:  residual SS = {res} 196985.1
{txt}Iteration 16:  residual SS = {res} 196980.2
{txt}Iteration 17:  residual SS = {res} 196975.1
{txt}Iteration 18:  residual SS = {res} 196972.6
{txt}Iteration 19:  residual SS = {res} 196970.2
{txt}Iteration 20:  residual SS = {res} 196969.1
{txt}Iteration 21:  residual SS = {res} 196968.8
{txt}Iteration 22:  residual SS = {res} 196967.9
{txt}Iteration 23:  residual SS = {res} 196965.5
{txt}Iteration 24:  residual SS = {res} 196965.5
{txt}Iteration 25:  residual SS = {res} 196961.3
{txt}Iteration 26:  residual SS = {res} 196958.4
{txt}Iteration 27:  residual SS = {res} 196950.4
{txt}Iteration 28:  residual SS = {res} 196932.2
{txt}Iteration 29:  residual SS = {res} 196885.6
{txt}Iteration 30:  residual SS = {res}   196810
{txt}Iteration 31:  residual SS = {res} 196756.7
{txt}Iteration 32:  residual SS = {res} 196681.1
{txt}Iteration 33:  residual SS = {res} 196656.2
{txt}Iteration 34:  residual SS = {res} 196654.9
{txt}Iteration 35:  residual SS = {res} 196652.9
{txt}Iteration 36:  residual SS = {res} 196652.8
{txt}Iteration 37:  residual SS = {res} 196652.8
{txt}Iteration 38:  residual SS = {res} 196652.8
{txt}Iteration 39:  residual SS = {res} 196652.8
{txt}Iteration 40:  residual SS = {res} 196652.8
{txt}Iteration 41:  residual SS = {res} 196652.8
{txt}Iteration 42:  residual SS = {res} 196652.8
{txt}Iteration 43:  residual SS = {res} 196652.8
{txt}Iteration 44:  residual SS = {res} 196652.8
{txt}Iteration 45:  residual SS = {res} 196652.8
{txt}Iteration 46:  residual SS = {res} 196652.8
{txt}Iteration 47:  residual SS = {res} 196652.8
{txt}Iteration 48:  residual SS = {res} 196652.8
{txt}Iteration 49:  residual SS = {res} 196652.8
{txt}Iteration 50:  residual SS = {res} 196652.8

{txt}Nonlinear regression{col 54}Number of obs = {res}      958
{txt}{col 54}R-squared     = {res}   0.1096
{txt}{col 54}Adj R-squared = {res}   0.1086
{txt}{col 54}Root MSE      = {res} 14.43325
{txt}{col 54}Res. dev.     = {res} 7819.411

{txt}{ralign 78:(Std. Err. adjusted for {res:958} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2008{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2}-.4490857{col 26}{space 2} 2.446287{col 37}{space 1}   -0.18{col 46}{space 3}0.854{col 54}{space 4}-5.249792{col 67}{space 3} 4.351621
{txt}         /d1 {c |}{col 14}{res}{space 2} .5915538{col 26}{space 2} 3.189853{col 37}{space 1}    0.19{col 46}{space 3}0.853{col 54}{space 4} -5.66836{col 67}{space 3} 6.851468
{txt}         /d2 {c |}{col 14}{res}{space 2}-1.926094{col 26}{space 2} 3.564535{col 37}{space 1}   -0.54{col 46}{space 3}0.589{col 54}{space 4}-8.921301{col 67}{space 3} 5.069112
{txt}         /d4 {c |}{col 14}{res}{space 2} 6.628984{col 26}{space 2} 4.604498{col 37}{space 1}    1.44{col 46}{space 3}0.150{col 54}{space 4}-2.407094{col 67}{space 3} 15.66506
{txt}         /d8 {c |}{col 14}{res}{space 2}-15.29917{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}         /d9 {c |}{col 14}{res}{space 2} 13.78714{col 26}{space 2} 2.813107{col 37}{space 1}    4.90{col 46}{space 3}0.000{col 54}{space 4} 8.266572{col 67}{space 3} 19.30771
{txt}        /d20 {c |}{col 14}{res}{space 2} .4014969{col 26}{space 2} .3815722{col 37}{space 1}    1.05{col 46}{space 3}0.293{col 54}{space 4}-.3473179{col 67}{space 3} 1.150312
{txt}        /d21 {c |}{col 14}{res}{space 2} -5.77399{col 26}{space 2} 4.902201{col 37}{space 1}   -1.18{col 46}{space 3}0.239{col 54}{space 4}-15.39429{col 67}{space 3} 3.846316
{txt}        /d22 {c |}{col 14}{res}{space 2} 5.824005{col 26}{space 2} 4.902885{col 37}{space 1}    1.19{col 46}{space 3}0.235{col 54}{space 4}-3.797641{col 67}{space 3} 15.44565
{txt}        /d23 {c |}{col 14}{res}{space 2} 4.691301{col 26}{space 2} 4.820649{col 37}{space 1}    0.97{col 46}{space 3}0.331{col 54}{space 4}-4.768962{col 67}{space 3} 14.15156
{txt}        /d24 {c |}{col 14}{res}{space 2} 6.491532{col 26}{space 2} 5.172357{col 37}{space 1}    1.26{col 46}{space 3}0.210{col 54}{space 4}-3.658938{col 67}{space 3}   16.642
{txt}        /d25 {c |}{col 14}{res}{space 2}-4.680612{col 26}{space 2}  4.82256{col 37}{space 1}   -0.97{col 46}{space 3}0.332{col 54}{space 4}-14.14462{col 67}{space 3}   4.7834
{txt}        /d26 {c |}{col 14}{res}{space 2}-6.553416{col 26}{space 2} 5.176596{col 37}{space 1}   -1.27{col 46}{space 3}0.206{col 54}{space 4} -16.7122{col 67}{space 3} 3.605373
{txt}        /d27 {c |}{col 14}{res}{space 2}-5.727577{col 26}{space 2} 5.195211{col 37}{space 1}   -1.10{col 46}{space 3}0.271{col 54}{space 4} -15.9229{col 67}{space 3} 4.467744
{txt}        /d28 {c |}{col 14}{res}{space 2} 5.749827{col 26}{space 2} 5.207133{col 37}{space 1}    1.10{col 46}{space 3}0.270{col 54}{space 4} -4.46889{col 67}{space 3} 15.96854
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
. nl(diffeight2008=({c -(}d8=0{c )-}*abspart2008*surprise39+{c -(}d9=0{c )-}*abspart2008*surprise39*supportdummy2008)*exp({c -(}d20=0{c )-}+{c -(}d21=0{c )-}*/*
> */time2008+{c -(}d22=0{c )-}*time2008*supportdummy2008+{c -(}d23=0{c )-}*time2008*abspart2008+{c -(}d24=0{c )-}*time2008*surprise39+{c -(}d25=0{c )-}*time2008*/*
> */abspart2008*supportdummy2008+{c -(}d26=0{c )-}*time2008*surprise39*supportdummy2008+{c -(}d27=0{c )-}*time2008*surprise39*abspart2008/*
> */+{c -(}d28=0{c )-}*time2008*surprise39*abspart2008*supportdummy2008)), cluster(case_id)
{txt}(obs = 958)

Iteration 0:  residual SS = {res} 203021.4
{txt}Iteration 1:  residual SS = {res} 203018.9
{txt}Iteration 2:  residual SS = {res} 202456.4
{txt}Iteration 3:  residual SS = {res} 201931.7
{txt}Iteration 4:  residual SS = {res} 201654.4
{txt}Iteration 5:  residual SS = {res} 200139.3
{txt}Iteration 6:  residual SS = {res} 199443.5
{txt}Iteration 7:  residual SS = {res} 198912.8
{txt}Iteration 8:  residual SS = {res} 198808.6
{txt}Iteration 9:  residual SS = {res} 198647.1
{txt}Iteration 10:  residual SS = {res} 198523.2
{txt}Iteration 11:  residual SS = {res} 198496.7
{txt}Iteration 12:  residual SS = {res} 198379.5
{txt}Iteration 13:  residual SS = {res} 198141.1
{txt}Iteration 14:  residual SS = {res} 198006.5
{txt}Iteration 15:  residual SS = {res} 197830.1
{txt}Iteration 16:  residual SS = {res} 197813.8
{txt}Iteration 17:  residual SS = {res}   197656
{txt}Iteration 18:  residual SS = {res} 197590.9
{txt}Iteration 19:  residual SS = {res} 197578.4
{txt}Iteration 20:  residual SS = {res} 197548.4
{txt}Iteration 21:  residual SS = {res} 197496.2
{txt}Iteration 22:  residual SS = {res} 197480.7
{txt}Iteration 23:  residual SS = {res} 197464.5
{txt}Iteration 24:  residual SS = {res} 197441.2
{txt}Iteration 25:  residual SS = {res} 197409.5
{txt}Iteration 26:  residual SS = {res} 197398.3
{txt}Iteration 27:  residual SS = {res} 197397.2
{txt}Iteration 28:  residual SS = {res} 197388.7
{txt}Iteration 29:  residual SS = {res} 197386.5
{txt}Iteration 30:  residual SS = {res} 197384.8
{txt}Iteration 31:  residual SS = {res} 197383.7
{txt}Iteration 32:  residual SS = {res} 197382.9
{txt}Iteration 33:  residual SS = {res} 197382.2
{txt}Iteration 34:  residual SS = {res} 197381.6
{txt}Iteration 35:  residual SS = {res} 197381.3
{txt}Iteration 36:  residual SS = {res} 197380.8
{txt}Iteration 37:  residual SS = {res} 197380.4
{txt}Iteration 38:  residual SS = {res} 197380.1
{txt}Iteration 39:  residual SS = {res} 197379.9
{txt}Iteration 40:  residual SS = {res} 197379.7
{txt}Iteration 41:  residual SS = {res} 197379.7
{txt}Iteration 42:  residual SS = {res} 197379.5
{txt}Iteration 43:  residual SS = {res} 197379.4
{txt}Iteration 44:  residual SS = {res} 197379.3
{txt}Iteration 45:  residual SS = {res} 197379.2
{txt}Iteration 46:  residual SS = {res} 197379.1
{txt}Iteration 47:  residual SS = {res} 197379.1
{txt}Iteration 48:  residual SS = {res}   197379
{txt}Iteration 49:  residual SS = {res}   197379
{txt}Iteration 50:  residual SS = {res}   197379
{txt}Iteration 51:  residual SS = {res}   197379
{txt}Iteration 52:  residual SS = {res} 197378.9
{txt}Iteration 53:  residual SS = {res} 197378.9
{txt}Iteration 54:  residual SS = {res} 197378.9
{txt}Iteration 55:  residual SS = {res} 197378.9
{txt}Iteration 56:  residual SS = {res} 197378.9
{txt}Iteration 57:  residual SS = {res} 197378.9
{txt}Iteration 58:  residual SS = {res} 197378.9
{txt}Iteration 59:  residual SS = {res} 197378.9
{txt}Iteration 60:  residual SS = {res} 197378.9
{txt}Iteration 61:  residual SS = {res} 197378.9
{txt}Iteration 62:  residual SS = {res} 197378.8
{txt}Iteration 63:  residual SS = {res} 197378.8
{txt}Iteration 64:  residual SS = {res} 197378.8
{txt}Iteration 65:  residual SS = {res} 197378.8
{txt}Iteration 66:  residual SS = {res} 197378.8
{txt}Iteration 67:  residual SS = {res} 197378.8
{txt}Iteration 68:  residual SS = {res} 197378.8
{txt}Iteration 69:  residual SS = {res} 197378.8
{txt}Iteration 70:  residual SS = {res} 197378.8
{txt}Iteration 71:  residual SS = {res} 197378.8
{txt}Iteration 72:  residual SS = {res} 197378.8
{txt}Iteration 73:  residual SS = {res} 197378.8
{txt}Iteration 74:  residual SS = {res} 197378.8
{txt}Iteration 75:  residual SS = {res} 197378.8
{txt}Iteration 76:  residual SS = {res} 197378.8
{txt}Iteration 77:  residual SS = {res} 197378.8
{txt}Iteration 78:  residual SS = {res} 197378.8
{txt}Iteration 79:  residual SS = {res} 197378.8
{txt}Iteration 80:  residual SS = {res} 197378.8
{txt}Iteration 81:  residual SS = {res} 197378.8
{txt}Iteration 82:  residual SS = {res} 197378.8
{txt}Iteration 83:  residual SS = {res} 197378.8
{txt}Iteration 84:  residual SS = {res} 197378.8
{txt}Iteration 85:  residual SS = {res} 197378.8
{txt}Iteration 86:  residual SS = {res} 197378.8
{txt}Iteration 87:  residual SS = {res} 197378.8
{txt}Iteration 88:  residual SS = {res} 197378.8
{txt}Iteration 89:  residual SS = {res} 197378.8
{txt}Iteration 90:  residual SS = {res} 197378.8
{txt}Iteration 91:  residual SS = {res} 197378.8
{txt}Iteration 92:  residual SS = {res} 197378.8
{txt}Iteration 93:  residual SS = {res} 197378.8
{txt}Iteration 94:  residual SS = {res} 197378.8
{txt}Iteration 95:  residual SS = {res} 197378.8
{txt}Iteration 96:  residual SS = {res} 197378.8
{txt}Iteration 97:  residual SS = {res} 197378.8
{txt}Iteration 98:  residual SS = {res} 197378.8
{txt}Iteration 99:  residual SS = {res} 197378.8
{txt}Iteration 100:  residual SS = {res} 197378.8
{txt}Iteration 101:  residual SS = {res} 197378.8
{txt}Iteration 102:  residual SS = {res} 197378.8
{txt}Iteration 103:  residual SS = {res} 197378.8
{txt}Iteration 104:  residual SS = {res} 197378.8
{txt}Iteration 105:  residual SS = {res} 197378.8
{txt}Iteration 106:  residual SS = {res} 197378.8
{txt}Iteration 107:  residual SS = {res} 197378.8
{txt}Iteration 108:  residual SS = {res} 197378.8
{txt}Iteration 109:  residual SS = {res} 197378.8
{txt}Iteration 110:  residual SS = {res} 197378.8
{txt}Iteration 111:  residual SS = {res} 197378.8
{txt}Iteration 112:  residual SS = {res} 197378.8
{txt}Iteration 113:  residual SS = {res} 197378.8
{txt}Iteration 114:  residual SS = {res} 197378.8

{txt}Nonlinear regression{col 54}Number of obs = {res}      958
{txt}{col 54}R-squared     = {res}   0.1098
{txt}{col 54}Adj R-squared = {res}   0.1088
{txt}{col 54}Root MSE      = {res} 14.42933
{txt}{col 54}Res. dev.     = {res} 7822.941

{txt}{ralign 78:(Std. Err. adjusted for {res:958} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2008{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d8 {c |}{col 14}{res}{space 2}-3.000257{col 26}{space 2}  2.31695{col 37}{space 1}   -1.29{col 46}{space 3}0.196{col 54}{space 4}-7.547145{col 67}{space 3} 1.546632
{txt}         /d9 {c |}{col 14}{res}{space 2} 26.18867{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}        /d20 {c |}{col 14}{res}{space 2} 2.044644{col 26}{space 2} .7401147{col 37}{space 1}    2.76{col 46}{space 3}0.006{col 54}{space 4} .5922091{col 67}{space 3} 3.497079
{txt}        /d21 {c |}{col 14}{res}{space 2} -4.70122{col 26}{space 2} 2.709617{col 37}{space 1}   -1.74{col 46}{space 3}0.083{col 54}{space 4} -10.0187{col 67}{space 3} .6162568
{txt}        /d22 {c |}{col 14}{res}{space 2} 5.670458{col 26}{space 2} 2.782107{col 37}{space 1}    2.04{col 46}{space 3}0.042{col 54}{space 4} .2107236{col 67}{space 3} 11.13019
{txt}        /d23 {c |}{col 14}{res}{space 2}  4.34427{col 26}{space 2} 2.684348{col 37}{space 1}    1.62{col 46}{space 3}0.106{col 54}{space 4}-.9236166{col 67}{space 3} 9.612157
{txt}        /d24 {c |}{col 14}{res}{space 2} 5.293044{col 26}{space 2} 2.822377{col 37}{space 1}    1.88{col 46}{space 3}0.061{col 54}{space 4}-.2457192{col 67}{space 3} 10.83181
{txt}        /d25 {c |}{col 14}{res}{space 2}-5.958595{col 26}{space 2} 3.059317{col 37}{space 1}   -1.95{col 46}{space 3}0.052{col 54}{space 4}-11.96234{col 67}{space 3} .0451486
{txt}        /d26 {c |}{col 14}{res}{space 2}-24.47822{col 26}{space 2} 13.11807{col 37}{space 1}   -1.87{col 46}{space 3}0.062{col 54}{space 4}-50.22172{col 67}{space 3} 1.265273
{txt}        /d27 {c |}{col 14}{res}{space 2} -5.19088{col 26}{space 2} 2.873774{col 37}{space 1}   -1.81{col 46}{space 3}0.071{col 54}{space 4}-10.83051{col 67}{space 3} .4487453
{txt}        /d28 {c |}{col 14}{res}{space 2} 20.13983{col 26}{space 2} 13.14517{col 37}{space 1}    1.53{col 46}{space 3}0.126{col 54}{space 4}-5.656864{col 67}{space 3} 45.93652
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. 
. ///2012///
> 
.         ///RA1-3///
>         
.         restore
{txt}
{com}.         preserve 
{txt}
{com}.         
.         drop if diffeight2012==.
{txt}(4480 observations deleted)

{com}.         drop if supportdummy2012==.
{txt}(3186 observations deleted)

{com}.         drop if abspart2012==.
{txt}(3 observations deleted)

{com}.         drop if surprise303==.
{txt}(3 observations deleted)

{com}.         drop if time2012==.
{txt}(127 observations deleted)

{com}.         
. //nl(diffeight2012={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2012+{c -(}d2=0{c )-}*abspart2012+{c -(}d3=0{c )-}*surprise303+{c -(}d4=0{c )-}*/*
. //*/supportdummy2012*abspart2012+{c -(}d5=0{c )-}*supportdummy2012*surprise303+{c -(}d6=0{c )-}*abspart2012*surprise303+{c -(}d7=0{c )-}*/*
. //*/abspart2012*surprise303*supportdummy2012+({c -(}d8=0{c )-}*abspart2012*surprise303+{c -(}d9=0{c )-}*abspart2012*/*
. //*/surprise303*supportdummy2012+{c -(}d10=0{c )-}+{c -(}d11=0{c )-}*supportdummy2012+{c -(}d12=0{c )-}*abspart2012+{c -(}d13=0{c )-}*/*
. //*/surprise303+{c -(}d14=0{c )-}*supportdummy2012*abspart2012+{c -(}d15=0{c )-}*supportdummy2012*surprise303+{c -(}d16=0{c )-}*abspart2012^2/*
. //*/+{c -(}d17=0{c )-}*surprise303^2+{c -(}d18=0{c )-}*abspart2012^2*supportdummy2012+{c -(}d19=0{c )-}*surprise303^2*supportdummy2012)*exp({c -(}d20=0{c )-}/*
. //*/+{c -(}d21=0{c )-}*time2012+{c -(}d22=0{c )-}*time2012*supportdummy2012+{c -(}d23=0{c )-}*time2012*abspart2012+{c -(}d24=0{c )-}*time2012*surprise303/*
. //*/+{c -(}d25=0{c )-}*time2012*abspart2012*supportdummy2012+{c -(}d26=0{c )-}*time2012*surprise303*supportdummy2012+{c -(}d27=0{c )-}*time2012*/*
. //*/surprise303*abspart2012+{c -(}d28=0{c )-}*time2012*surprise303*abspart2012*supportdummy2012)), cluster(case_id)
. 
. nl(diffeight2012={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2012+{c -(}d2=0{c )-}*abspart2012+{c -(}d3=0{c )-}*surprise303+{c -(}d4=0{c )-}*supportdummy2012*abspart2012/*
> */+{c -(}d5=0{c )-}*supportdummy2012*surprise303+{c -(}d6=0{c )-}*abspart2012*surprise303+{c -(}d7=0{c )-}*abspart2012*surprise303*supportdummy2012/*
> */+({c -(}d8=0{c )-}*abspart2012*surprise303+{c -(}d9=0{c )-}*abspart2012*surprise303*supportdummy2012)*exp({c -(}d21=0{c )-}*time2012)), cluster(case_id)
{txt}(obs = 5109)

Iteration 0:  residual SS = {res}  1315461
{txt}Iteration 1:  residual SS = {res}  1315461
{txt}Iteration 2:  residual SS = {res}  1315461
{txt}Iteration 3:  residual SS = {res}  1315460
{txt}Iteration 4:  residual SS = {res}  1315457
{txt}Iteration 5:  residual SS = {res}  1315457
{txt}Iteration 6:  residual SS = {res}  1315456
{txt}Iteration 7:  residual SS = {res}  1315425
{txt}Iteration 8:  residual SS = {res}  1315424
{txt}Iteration 9:  residual SS = {res}  1315423
{txt}Iteration 10:  residual SS = {res}  1315420
{txt}Iteration 11:  residual SS = {res}  1315038
{txt}Iteration 12:  residual SS = {res}  1314954
{txt}Iteration 13:  residual SS = {res}  1314838
{txt}Iteration 14:  residual SS = {res}  1314835
{txt}Iteration 15:  residual SS = {res}  1313804
{txt}Iteration 16:  residual SS = {res}  1311984
{txt}Iteration 17:  residual SS = {res}  1308499
{txt}Iteration 18:  residual SS = {res}  1288367
{txt}Iteration 19:  residual SS = {res}  1284849
{txt}Iteration 20:  residual SS = {res}  1284045
{txt}Iteration 21:  residual SS = {res}  1283801
{txt}Iteration 22:  residual SS = {res}  1283800
{txt}Iteration 23:  residual SS = {res}  1283800
{txt}Iteration 24:  residual SS = {res}  1283800

{txt}Nonlinear regression{col 54}Number of obs = {res}     5109
{txt}{col 54}R-squared     = {res}   0.0429
{txt}{col 54}Adj R-squared = {res}   0.0424
{txt}{col 54}Root MSE      = {res} 15.86897
{txt}{col 54}Res. dev.     = {res} 42733.99

{txt}{ralign 78:(Std. Err. adjusted for {res:1737} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2012{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2} -2.44146{col 26}{space 2} 4.367207{col 37}{space 1}   -0.56{col 46}{space 3}0.576{col 54}{space 4}  -11.007{col 67}{space 3} 6.124081
{txt}         /d1 {c |}{col 14}{res}{space 2} 6.247729{col 26}{space 2} 5.334465{col 37}{space 1}    1.17{col 46}{space 3}0.242{col 54}{space 4}-4.214925{col 67}{space 3} 16.71038
{txt}         /d2 {c |}{col 14}{res}{space 2} 3.886007{col 26}{space 2}  5.69439{col 37}{space 1}    0.68{col 46}{space 3}0.495{col 54}{space 4}-7.282578{col 67}{space 3} 15.05459
{txt}         /d3 {c |}{col 14}{res}{space 2} 7.693677{col 26}{space 2} 7.397927{col 37}{space 1}    1.04{col 46}{space 3}0.298{col 54}{space 4} -6.81611{col 67}{space 3} 22.20347
{txt}         /d4 {c |}{col 14}{res}{space 2}-6.575163{col 26}{space 2} 6.706898{col 37}{space 1}   -0.98{col 46}{space 3}0.327{col 54}{space 4}-19.72961{col 67}{space 3} 6.579287
{txt}         /d5 {c |}{col 14}{res}{space 2}-21.25501{col 26}{space 2}  10.9059{col 37}{space 1}   -1.95{col 46}{space 3}0.051{col 54}{space 4}-42.64508{col 67}{space 3} .1350694
{txt}         /d6 {c |}{col 14}{res}{space 2}-9.856401{col 26}{space 2} 9.576918{col 37}{space 1}   -1.03{col 46}{space 3}0.304{col 54}{space 4}-28.63991{col 67}{space 3}  8.92711
{txt}         /d7 {c |}{col 14}{res}{space 2} 28.36454{col 26}{space 2} 13.83755{col 37}{space 1}    2.05{col 46}{space 3}0.041{col 54}{space 4} 1.224508{col 67}{space 3} 55.50456
{txt}         /d8 {c |}{col 14}{res}{space 2}-77.83807{col 26}{space 2} 32.16938{col 37}{space 1}   -2.42{col 46}{space 3}0.016{col 54}{space 4}-140.9329{col 67}{space 3}-14.74325
{txt}         /d9 {c |}{col 14}{res}{space 2} 102.2221{col 26}{space 2} 42.25639{col 37}{space 1}    2.42{col 46}{space 3}0.016{col 54}{space 4}  19.3433{col 67}{space 3} 185.1009
{txt}        /d21 {c |}{col 14}{res}{space 2}-1.334827{col 26}{space 2} .3954769{col 37}{space 1}   -3.38{col 46}{space 3}0.001{col 54}{space 4}-2.110488{col 67}{space 3}-.5591661
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
. nl(diffeight2012={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2012+{c -(}d2=0{c )-}*abspart2012+{c -(}d4=0{c )-}*supportdummy2012*abspart2012+({c -(}d8=0{c )-}*abspart2012*/*
> */surprise303+{c -(}d9=0{c )-}*abspart2012*surprise303*supportdummy2012+{c -(}d10=0{c )-}+{c -(}d11=0{c )-}*supportdummy2012+{c -(}d12=0{c )-}*abspart2012+{c -(}d13=0{c )-}*/*
> */surprise303+{c -(}d14=0{c )-}*supportdummy2012*abspart2012+{c -(}d15=0{c )-}*supportdummy2012*surprise303+{c -(}d16=0{c )-}*abspart2012^2+{c -(}d17=0{c )-}*/*
> */surprise303^2+{c -(}d18=0{c )-}*abspart2012^2*supportdummy2012+{c -(}d19=0{c )-}*surprise303^2*supportdummy2012)*exp({c -(}d21=0{c )-}*time2012)), cluster(case_id)
{txt}(obs = 5109)

Iteration 0:  residual SS = {res}  1306063
{txt}Iteration 1:  residual SS = {res}  1302017
{txt}Iteration 2:  residual SS = {res}  1301620
{txt}Iteration 3:  residual SS = {res}  1300788
{txt}Iteration 4:  residual SS = {res}  1298761
{txt}Iteration 5:  residual SS = {res}  1292900
{txt}Iteration 6:  residual SS = {res}  1291567
{txt}Iteration 7:  residual SS = {res}  1287453
{txt}Iteration 8:  residual SS = {res}  1285939
{txt}Iteration 9:  residual SS = {res}  1284546
{txt}Iteration 10:  residual SS = {res}  1283231
{txt}Iteration 11:  residual SS = {res}  1281940
{txt}Iteration 12:  residual SS = {res}  1280867
{txt}Iteration 13:  residual SS = {res}  1280202
{txt}Iteration 14:  residual SS = {res}  1279894
{txt}Iteration 15:  residual SS = {res}  1279783
{txt}Iteration 16:  residual SS = {res}  1279752
{txt}Iteration 17:  residual SS = {res}  1279744
{txt}Iteration 18:  residual SS = {res}  1279743
{txt}Iteration 19:  residual SS = {res}  1279742
{txt}Iteration 20:  residual SS = {res}  1279742
{txt}Iteration 21:  residual SS = {res}  1279742
{txt}Iteration 22:  residual SS = {res}  1279742
{txt}Iteration 23:  residual SS = {res}  1279742
{txt}Iteration 24:  residual SS = {res}  1279742
{txt}Iteration 25:  residual SS = {res}  1279742
{txt}Iteration 26:  residual SS = {res}  1279742
{txt}Iteration 27:  residual SS = {res}  1279742
{txt}Iteration 28:  residual SS = {res}  1279742
{txt}Iteration 29:  residual SS = {res}  1279742

{txt}Nonlinear regression{col 54}Number of obs = {res}     5109
{txt}{col 54}R-squared     = {res}   0.0459
{txt}{col 54}Adj R-squared = {res}   0.0454
{txt}{col 54}Root MSE      = {res} 15.85321
{txt}{col 54}Res. dev.     = {res} 42717.82

{txt}{ralign 78:(Std. Err. adjusted for {res:1737} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2012{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2} 2.157388{col 26}{space 2} 1.149777{col 37}{space 1}    1.88{col 46}{space 3}0.061{col 54}{space 4}-.0977047{col 67}{space 3} 4.412481
{txt}         /d1 {c |}{col 14}{res}{space 2}-2.793502{col 26}{space 2} 1.761797{col 37}{space 1}   -1.59{col 46}{space 3}0.113{col 54}{space 4}-6.248969{col 67}{space 3} .6619656
{txt}         /d2 {c |}{col 14}{res}{space 2}-2.121682{col 26}{space 2} 1.567006{col 37}{space 1}   -1.35{col 46}{space 3}0.176{col 54}{space 4}-5.195099{col 67}{space 3} .9517358
{txt}         /d4 {c |}{col 14}{res}{space 2} 5.177407{col 26}{space 2} 2.271185{col 37}{space 1}    2.28{col 46}{space 3}0.023{col 54}{space 4} .7228593{col 67}{space 3} 9.631954
{txt}         /d8 {c |}{col 14}{res}{space 2}-226.9839{col 26}{space 2} 127.1229{col 37}{space 1}   -1.79{col 46}{space 3}0.074{col 54}{space 4}-476.3141{col 67}{space 3} 22.34625
{txt}         /d9 {c |}{col 14}{res}{space 2} 350.8917{col 26}{space 2} 184.7449{col 37}{space 1}    1.90{col 46}{space 3}0.058{col 54}{space 4}-11.45417{col 67}{space 3} 713.2376
{txt}        /d10 {c |}{col 14}{res}{space 2}-188.9067{col 26}{space 2}   103.74{col 37}{space 1}   -1.82{col 46}{space 3}0.069{col 54}{space 4}-392.3752{col 67}{space 3} 14.56187
{txt}        /d11 {c |}{col 14}{res}{space 2} 222.6572{col 26}{space 2} 120.4474{col 37}{space 1}    1.85{col 46}{space 3}0.065{col 54}{space 4}-13.58011{col 67}{space 3} 458.8945
{txt}        /d12 {c |}{col 14}{res}{space 2} 401.5237{col 26}{space 2} 204.6594{col 37}{space 1}    1.96{col 46}{space 3}0.050{col 54}{space 4} .1188058{col 67}{space 3} 802.9285
{txt}        /d13 {c |}{col 14}{res}{space 2} 230.8973{col 26}{space 2} 166.8592{col 37}{space 1}    1.38{col 46}{space 3}0.167{col 54}{space 4}-96.36879{col 67}{space 3} 558.1634
{txt}        /d14 {c |}{col 14}{res}{space 2}-421.6212{col 26}{space 2} 230.2653{col 37}{space 1}   -1.83{col 46}{space 3}0.067{col 54}{space 4}-873.2477{col 67}{space 3} 30.00535
{txt}        /d15 {c |}{col 14}{res}{space 2}-376.2128{col 26}{space 2} 227.7571{col 37}{space 1}   -1.65{col 46}{space 3}0.099{col 54}{space 4}-822.9199{col 67}{space 3} 70.49441
{txt}        /d16 {c |}{col 14}{res}{space 2}-232.8784{col 26}{space 2} 121.4422{col 37}{space 1}   -1.92{col 46}{space 3}0.055{col 54}{space 4}-471.0668{col 67}{space 3} 5.310105
{txt}        /d17 {c |}{col 14}{res}{space 2}-89.34917{col 26}{space 2} 85.34319{col 37}{space 1}   -1.05{col 46}{space 3}0.295{col 54}{space 4}-256.7354{col 67}{space 3} 78.03711
{txt}        /d18 {c |}{col 14}{res}{space 2} 221.2486{col 26}{space 2} 132.2963{col 37}{space 1}    1.67{col 46}{space 3}0.095{col 54}{space 4}-38.22819{col 67}{space 3} 480.7255
{txt}        /d19 {c |}{col 14}{res}{space 2} 194.3873{col 26}{space 2} 160.5821{col 37}{space 1}    1.21{col 46}{space 3}0.226{col 54}{space 4}-120.5675{col 67}{space 3}  509.342
{txt}        /d21 {c |}{col 14}{res}{space 2}-1.394828{col 26}{space 2} .4411401{col 37}{space 1}   -3.16{col 46}{space 3}0.002{col 54}{space 4} -2.26005{col 67}{space 3}-.5296064
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
. nl(diffeight2012={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2012+({c -(}d8=0{c )-}*abspart2012*surprise303+{c -(}d9=0{c )-}*abspart2012*surprise303*supportdummy2012+/*
> */{c -(}d10=0{c )-}+{c -(}d11=0{c )-}*supportdummy2012+{c -(}d12=0{c )-}*abspart2012+{c -(}d13=0{c )-}*surprise303+{c -(}d14=0{c )-}*supportdummy2012*abspart2012/*
> */+{c -(}d15=0{c )-}*supportdummy2012*surprise303+{c -(}d16=0{c )-}*abspart2012^2+{c -(}d17=0{c )-}*surprise303^2+{c -(}d18=0{c )-}*abspart2012^2*supportdummy2012/*
> */+{c -(}d19=0{c )-}*surprise303^2*supportdummy2012)*exp({c -(}d21=0{c )-}*time2012)), cluster(case_id)
{txt}(obs = 5109)

Iteration 0:  residual SS = {res}  1306063
{txt}Iteration 1:  residual SS = {res}  1306055
{txt}Iteration 2:  residual SS = {res}  1302142
{txt}Iteration 3:  residual SS = {res}  1301846
{txt}Iteration 4:  residual SS = {res}  1301758
{txt}Iteration 5:  residual SS = {res}  1301717
{txt}Iteration 6:  residual SS = {res}  1301699
{txt}Iteration 7:  residual SS = {res}  1301684
{txt}Iteration 8:  residual SS = {res}  1301676
{txt}Iteration 9:  residual SS = {res}  1301667
{txt}Iteration 10:  residual SS = {res}  1301660
{txt}Iteration 11:  residual SS = {res}  1301656
{txt}Iteration 12:  residual SS = {res}  1301654
{txt}Iteration 13:  residual SS = {res}  1301650
{txt}Iteration 14:  residual SS = {res}  1301646
{txt}Iteration 15:  residual SS = {res}  1301643
{txt}Iteration 16:  residual SS = {res}  1301642
{txt}Iteration 17:  residual SS = {res}  1301641
{txt}Iteration 18:  residual SS = {res}  1301638
{txt}Iteration 19:  residual SS = {res}  1301636
{txt}Iteration 20:  residual SS = {res}  1301634
{txt}Iteration 21:  residual SS = {res}  1301632
{txt}Iteration 22:  residual SS = {res}  1301631
{txt}Iteration 23:  residual SS = {res}  1300785
{txt}Iteration 24:  residual SS = {res}  1299581
{txt}Iteration 25:  residual SS = {res}  1298518
{txt}Iteration 26:  residual SS = {res}  1298517
{txt}Iteration 27:  residual SS = {res}  1298517
{txt}Iteration 28:  residual SS = {res}  1298517

{txt}Nonlinear regression{col 54}Number of obs = {res}     5109
{txt}{col 54}R-squared     = {res}   0.0319
{txt}{col 54}Adj R-squared = {res}   0.0314
{txt}{col 54}Root MSE      = {res} 15.96437
{txt}{col 54}Res. dev.     = {res} 42792.23

{txt}{ralign 78:(Std. Err. adjusted for {res:1737} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2012{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2}-513.5361{col 26}{space 2} 75.29368{col 37}{space 1}   -6.82{col 46}{space 3}0.000{col 54}{space 4}-661.2119{col 67}{space 3}-365.8602
{txt}         /d1 {c |}{col 14}{res}{space 2} 576.9249{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}         /d8 {c |}{col 14}{res}{space 2}-14.94419{col 26}{space 2} 9.749105{col 37}{space 1}   -1.53{col 46}{space 3}0.125{col 54}{space 4}-34.06541{col 67}{space 3} 4.177038
{txt}         /d9 {c |}{col 14}{res}{space 2} 37.20616{col 26}{space 2} 13.98246{col 37}{space 1}    2.66{col 46}{space 3}0.008{col 54}{space 4} 9.781926{col 67}{space 3} 64.63039
{txt}        /d10 {c |}{col 14}{res}{space 2} 507.1572{col 26}{space 2} 75.61293{col 37}{space 1}    6.71{col 46}{space 3}0.000{col 54}{space 4} 358.8552{col 67}{space 3} 655.4593
{txt}        /d11 {c |}{col 14}{res}{space 2}-564.3426{col 26}{space 2}  8.91414{col 37}{space 1}  -63.31{col 46}{space 3}0.000{col 54}{space 4}-581.8262{col 67}{space 3} -546.859
{txt}        /d12 {c |}{col 14}{res}{space 2} 27.65645{col 26}{space 2} 14.72146{col 37}{space 1}    1.88{col 46}{space 3}0.060{col 54}{space 4}-1.217212{col 67}{space 3}  56.5301
{txt}        /d13 {c |}{col 14}{res}{space 2}-7.765863{col 26}{space 2} 17.48343{col 37}{space 1}   -0.44{col 46}{space 3}0.657{col 54}{space 4}-42.05665{col 67}{space 3} 26.52493
{txt}        /d14 {c |}{col 14}{res}{space 2} -30.9569{col 26}{space 2} 19.63395{col 37}{space 1}   -1.58{col 46}{space 3}0.115{col 54}{space 4}-69.46557{col 67}{space 3}  7.55178
{txt}        /d15 {c |}{col 14}{res}{space 2}-29.20365{col 26}{space 2} 23.08911{col 37}{space 1}   -1.26{col 46}{space 3}0.206{col 54}{space 4}-74.48906{col 67}{space 3} 16.08175
{txt}        /d16 {c |}{col 14}{res}{space 2}-17.60164{col 26}{space 2} 10.21228{col 37}{space 1}   -1.72{col 46}{space 3}0.085{col 54}{space 4}-37.63131{col 67}{space 3} 2.428017
{txt}        /d17 {c |}{col 14}{res}{space 2} 12.66221{col 26}{space 2} 11.93041{col 37}{space 1}    1.06{col 46}{space 3}0.289{col 54}{space 4}-10.73727{col 67}{space 3} 36.06169
{txt}        /d18 {c |}{col 14}{res}{space 2} 17.47733{col 26}{space 2} 13.40225{col 37}{space 1}    1.30{col 46}{space 3}0.192{col 54}{space 4}-8.808932{col 67}{space 3} 43.76359
{txt}        /d19 {c |}{col 14}{res}{space 2} 26.18191{col 26}{space 2} 22.23053{col 37}{space 1}    1.18{col 46}{space 3}0.239{col 54}{space 4}-17.41952{col 67}{space 3} 69.78335
{txt}        /d21 {c |}{col 14}{res}{space 2} .0004468{col 26}{space 2} .0001037{col 37}{space 1}    4.31{col 46}{space 3}0.000{col 54}{space 4} .0002433{col 67}{space 3} .0006502
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
. nl(diffeight2012={c -(}d2=0{c )-}*abspart2012+{c -(}d4=0{c )-}*supportdummy2012*abspart2012+({c -(}d8=0{c )-}*abspart2012*surprise303+{c -(}d9=0{c )-}*/*
> */abspart2012*surprise303*supportdummy2012+{c -(}d10=0{c )-}+{c -(}d11=0{c )-}*supportdummy2012+{c -(}d12=0{c )-}*abspart2012+{c -(}d13=0{c )-}*surprise303+{c -(}d1/*
> */4=0{c )-}*supportdummy2012*abspart2012+{c -(}d15=0{c )-}*supportdummy2012*surprise303+{c -(}d16=0{c )-}*abspart2012^2+{c -(}d17=0{c )-}*surprise303^2/*
> */+{c -(}d18=0{c )-}*abspart2012^2*supportdummy2012+{c -(}d19=0{c )-}*surprise303^2*supportdummy2012)*exp({c -(}d21=0{c )-}*time2012)), cluster(case_id)
{txt}(obs = 5109)

Iteration 0:  residual SS = {res}  1306063
{txt}Iteration 1:  residual SS = {res}  1300987
{txt}Iteration 2:  residual SS = {res}  1300637
{txt}Iteration 3:  residual SS = {res}  1299963
{txt}Iteration 4:  residual SS = {res}  1298735
{txt}Iteration 5:  residual SS = {res}  1292036
{txt}Iteration 6:  residual SS = {res}  1290534
{txt}Iteration 7:  residual SS = {res}  1288661
{txt}Iteration 8:  residual SS = {res}  1286992
{txt}Iteration 9:  residual SS = {res}  1285890
{txt}Iteration 10:  residual SS = {res}  1284906
{txt}Iteration 11:  residual SS = {res}  1283934
{txt}Iteration 12:  residual SS = {res}  1282950
{txt}Iteration 13:  residual SS = {res}  1282065
{txt}Iteration 14:  residual SS = {res}  1281440
{txt}Iteration 15:  residual SS = {res}  1281106
{txt}Iteration 16:  residual SS = {res}  1280965
{txt}Iteration 17:  residual SS = {res}  1280918
{txt}Iteration 18:  residual SS = {res}  1280904
{txt}Iteration 19:  residual SS = {res}  1280901
{txt}Iteration 20:  residual SS = {res}  1280900
{txt}Iteration 21:  residual SS = {res}  1280900
{txt}Iteration 22:  residual SS = {res}  1280900
{txt}Iteration 23:  residual SS = {res}  1280900
{txt}Iteration 24:  residual SS = {res}  1280900
{txt}Iteration 25:  residual SS = {res}  1280900
{txt}Iteration 26:  residual SS = {res}  1280900
{txt}Iteration 27:  residual SS = {res}  1280900
{txt}Iteration 28:  residual SS = {res}  1280900
{txt}Iteration 29:  residual SS = {res}  1280900
{txt}Iteration 30:  residual SS = {res}  1280900
{txt}Iteration 31:  residual SS = {res}  1280900

{txt}Nonlinear regression{col 54}Number of obs = {res}     5109
{txt}{col 54}R-squared     = {res}   0.0466
{txt}{col 54}Adj R-squared = {res}   0.0460
{txt}{col 54}Root MSE      = {res} 15.85726
{txt}{col 54}Res. dev.     = {res} 42722.44

{txt}{ralign 78:(Std. Err. adjusted for {res:1737} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2012{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d2 {c |}{col 14}{res}{space 2} .5392548{col 26}{space 2} .6909755{col 37}{space 1}    0.78{col 46}{space 3}0.435{col 54}{space 4}-.8159772{col 67}{space 3} 1.894487
{txt}         /d4 {c |}{col 14}{res}{space 2} 1.759422{col 26}{space 2} .8936702{col 37}{space 1}    1.97{col 46}{space 3}0.049{col 54}{space 4}  .006639{col 67}{space 3} 3.512206
{txt}         /d8 {c |}{col 14}{res}{space 2}-216.7159{col 26}{space 2} 118.7426{col 37}{space 1}   -1.83{col 46}{space 3}0.068{col 54}{space 4}-449.6094{col 67}{space 3} 16.17772
{txt}         /d9 {c |}{col 14}{res}{space 2} 335.0022{col 26}{space 2} 171.6548{col 37}{space 1}    1.95{col 46}{space 3}0.051{col 54}{space 4}-1.669867{col 67}{space 3} 671.6742
{txt}        /d10 {c |}{col 14}{res}{space 2} -171.122{col 26}{space 2} 94.00726{col 37}{space 1}   -1.82{col 46}{space 3}0.069{col 54}{space 4}-355.5014{col 67}{space 3} 13.25742
{txt}        /d11 {c |}{col 14}{res}{space 2} 200.1836{col 26}{space 2} 108.5702{col 37}{space 1}    1.84{col 46}{space 3}0.065{col 54}{space 4}-12.75852{col 67}{space 3} 413.1256
{txt}        /d12 {c |}{col 14}{res}{space 2} 372.9826{col 26}{space 2} 186.7029{col 37}{space 1}    2.00{col 46}{space 3}0.046{col 54}{space 4} 6.796319{col 67}{space 3} 739.1689
{txt}        /d13 {c |}{col 14}{res}{space 2} 219.8095{col 26}{space 2} 157.2806{col 37}{space 1}    1.40{col 46}{space 3}0.162{col 54}{space 4}-88.66987{col 67}{space 3} 528.2888
{txt}        /d14 {c |}{col 14}{res}{space 2}-387.5334{col 26}{space 2} 210.2013{col 37}{space 1}   -1.84{col 46}{space 3}0.065{col 54}{space 4}-799.8078{col 67}{space 3} 24.74088
{txt}        /d15 {c |}{col 14}{res}{space 2}-359.3257{col 26}{space 2} 213.2332{col 37}{space 1}   -1.69{col 46}{space 3}0.092{col 54}{space 4}-777.5467{col 67}{space 3} 58.89524
{txt}        /d16 {c |}{col 14}{res}{space 2}-223.4514{col 26}{space 2} 113.4011{col 37}{space 1}   -1.97{col 46}{space 3}0.049{col 54}{space 4}-445.8685{col 67}{space 3}-1.034365
{txt}        /d17 {c |}{col 14}{res}{space 2}-84.76571{col 26}{space 2} 81.04483{col 37}{space 1}   -1.05{col 46}{space 3}0.296{col 54}{space 4}-243.7215{col 67}{space 3} 74.19006
{txt}        /d18 {c |}{col 14}{res}{space 2} 211.4392{col 26}{space 2}  124.038{col 37}{space 1}    1.70{col 46}{space 3}0.088{col 54}{space 4} -31.8405{col 67}{space 3} 454.7189
{txt}        /d19 {c |}{col 14}{res}{space 2} 186.8206{col 26}{space 2} 152.5614{col 37}{space 1}    1.22{col 46}{space 3}0.221{col 54}{space 4}-112.4029{col 67}{space 3} 486.0442
{txt}        /d21 {c |}{col 14}{res}{space 2}-1.353475{col 26}{space 2} .4241112{col 37}{space 1}   -3.19{col 46}{space 3}0.001{col 54}{space 4}-2.185298{col 67}{space 3}-.5216523
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. nl(diffeight2012=({c -(}d8=0{c )-}*abspart2012*surprise303+{c -(}d9=0{c )-}*abspart2012*surprise303*supportdummy2012+{c -(}d10=0{c )-}+{c -(}d11=0{c )-}*/*
> */supportdummy2012+{c -(}d12=0{c )-}*abspart2012+{c -(}d13=0{c )-}*surprise303+{c -(}d14=0{c )-}*supportdummy2012*abspart2012+{c -(}d15=0{c )-}*supportdummy2012*/*
> */surprise303+{c -(}d16=0{c )-}*abspart2012^2+{c -(}d17=0{c )-}*surprise303^2+{c -(}d18=0{c )-}*abspart2012^2*supportdummy2012+{c -(}d19=0{c )-}*surprise303^2*/*
> */supportdummy2012)*exp({c -(}d21=0{c )-}*time2012)), cluster(case_id)
{txt}(obs = 5109)

Iteration 0:  residual SS = {res}  1306063
{txt}Iteration 1:  residual SS = {res}  1302076
{txt}Iteration 2:  residual SS = {res}  1299454
{txt}Iteration 3:  residual SS = {res}  1297320
{txt}Iteration 4:  residual SS = {res}  1295469
{txt}Iteration 5:  residual SS = {res}  1293878
{txt}Iteration 6:  residual SS = {res}  1292522
{txt}Iteration 7:  residual SS = {res}  1291354
{txt}Iteration 8:  residual SS = {res}  1290347
{txt}Iteration 9:  residual SS = {res}  1289517
{txt}Iteration 10:  residual SS = {res}  1288909
{txt}Iteration 11:  residual SS = {res}  1288535
{txt}Iteration 12:  residual SS = {res}  1288344
{txt}Iteration 13:  residual SS = {res}  1288262
{txt}Iteration 14:  residual SS = {res}  1288231
{txt}Iteration 15:  residual SS = {res}  1288221
{txt}Iteration 16:  residual SS = {res}  1288217
{txt}Iteration 17:  residual SS = {res}  1288216
{txt}Iteration 18:  residual SS = {res}  1288216
{txt}Iteration 19:  residual SS = {res}  1288216
{txt}Iteration 20:  residual SS = {res}  1288216
{txt}Iteration 21:  residual SS = {res}  1288216
{txt}Iteration 22:  residual SS = {res}  1288216
{txt}Iteration 23:  residual SS = {res}  1288216
{txt}Iteration 24:  residual SS = {res}  1288216
{txt}Iteration 25:  residual SS = {res}  1288216
{txt}Iteration 26:  residual SS = {res}  1288216
{txt}Iteration 27:  residual SS = {res}  1288216
{txt}Iteration 28:  residual SS = {res}  1288216
{txt}Iteration 29:  residual SS = {res}  1288216
{txt}Iteration 30:  residual SS = {res}  1288216

{txt}Nonlinear regression{col 54}Number of obs = {res}     5109
{txt}{col 54}R-squared     = {res}   0.0411
{txt}{col 54}Adj R-squared = {res}   0.0406
{txt}{col 54}Root MSE      = {res} 15.89936
{txt}{col 54}Res. dev.     = {res} 42751.53

{txt}{ralign 78:(Std. Err. adjusted for {res:1737} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2012{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d8 {c |}{col 14}{res}{space 2}-156.8787{col 26}{space 2} 71.49211{col 37}{space 1}   -2.19{col 46}{space 3}0.028{col 54}{space 4}-297.0985{col 67}{space 3}-16.65901
{txt}         /d9 {c |}{col 14}{res}{space 2} 243.1265{col 26}{space 2} 99.39585{col 37}{space 1}    2.45{col 46}{space 3}0.015{col 54}{space 4}  48.1783{col 67}{space 3} 438.0747
{txt}        /d10 {c |}{col 14}{res}{space 2}-123.2624{col 26}{space 2} 57.34133{col 37}{space 1}   -2.15{col 46}{space 3}0.032{col 54}{space 4}-235.7278{col 67}{space 3}-10.79707
{txt}        /d11 {c |}{col 14}{res}{space 2} 141.6321{col 26}{space 2} 65.13875{col 37}{space 1}    2.17{col 46}{space 3}0.030{col 54}{space 4} 13.87344{col 67}{space 3} 269.3908
{txt}        /d12 {c |}{col 14}{res}{space 2}  275.579{col 26}{space 2} 110.3669{col 37}{space 1}    2.50{col 46}{space 3}0.013{col 54}{space 4}  59.1129{col 67}{space 3} 492.0452
{txt}        /d13 {c |}{col 14}{res}{space 2} 153.6684{col 26}{space 2}  104.918{col 37}{space 1}    1.46{col 46}{space 3}0.143{col 54}{space 4}-52.11054{col 67}{space 3} 359.4473
{txt}        /d14 {c |}{col 14}{res}{space 2}-267.3578{col 26}{space 2}  125.764{col 37}{space 1}   -2.13{col 46}{space 3}0.034{col 54}{space 4}-514.0227{col 67}{space 3}-20.69282
{txt}        /d15 {c |}{col 14}{res}{space 2}-261.0778{col 26}{space 2} 135.3438{col 37}{space 1}   -1.93{col 46}{space 3}0.054{col 54}{space 4}-526.5318{col 67}{space 3} 4.376151
{txt}        /d16 {c |}{col 14}{res}{space 2}-165.6136{col 26}{space 2} 68.40127{col 37}{space 1}   -2.42{col 46}{space 3}0.016{col 54}{space 4}-299.7711{col 67}{space 3}-31.45604
{txt}        /d17 {c |}{col 14}{res}{space 2}-56.78119{col 26}{space 2}  57.3886{col 37}{space 1}   -0.99{col 46}{space 3}0.323{col 54}{space 4}-169.3393{col 67}{space 3} 55.77688
{txt}        /d18 {c |}{col 14}{res}{space 2} 149.0491{col 26}{space 2} 78.40593{col 37}{space 1}    1.90{col 46}{space 3}0.057{col 54}{space 4}-4.730896{col 67}{space 3} 302.8291
{txt}        /d19 {c |}{col 14}{res}{space 2} 142.6187{col 26}{space 2} 107.8584{col 37}{space 1}    1.32{col 46}{space 3}0.186{col 54}{space 4}-68.92736{col 67}{space 3} 354.1648
{txt}        /d21 {c |}{col 14}{res}{space 2}-1.067867{col 26}{space 2} .2810904{col 37}{space 1}   -3.80{col 46}{space 3}0.000{col 54}{space 4}-1.619179{col 67}{space 3}-.5165559
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. nl(diffeight={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy+{c -(}d2=0{c )-}*abspart+{c -(}d4=0{c )-}*supportdummy*abspart+({c -(}d8=0{c )-}*abspart*surprise+{c -(}d9=0{c )-}*/*
> */abspart*surprise*supportdummy+{c -(}d10=0{c )-}+{c -(}d11=0{c )-}*supportdummy+{c -(}d12=0{c )-}*abspart+{c -(}d13=0{c )-}*surprise+{c -(}d14=0{c )-}*supportdummy*/*
> */abspart+{c -(}d15=0{c )-}*supportdummy*surprise+{c -(}d16=0{c )-}*abspart^2+{c -(}d17=0{c )-}*surprise^2+{c -(}d18=0{c )-}*abspart^2*supportdummy+{c -(}d19=0{c )-}*/*
> */surprise^2*supportdummy)*exp({c -(}d21=0{c )-}*timeoverall)), cluster(case_id)
{txt}(obs = 5109)

Iteration 0:  residual SS = {res}  1306063
{txt}Iteration 1:  residual SS = {res}  1302017
{txt}Iteration 2:  residual SS = {res}  1301620
{txt}Iteration 3:  residual SS = {res}  1300788
{txt}Iteration 4:  residual SS = {res}  1298761
{txt}Iteration 5:  residual SS = {res}  1292900
{txt}Iteration 6:  residual SS = {res}  1291567
{txt}Iteration 7:  residual SS = {res}  1287453
{txt}Iteration 8:  residual SS = {res}  1285939
{txt}Iteration 9:  residual SS = {res}  1284546
{txt}Iteration 10:  residual SS = {res}  1283231
{txt}Iteration 11:  residual SS = {res}  1281940
{txt}Iteration 12:  residual SS = {res}  1280867
{txt}Iteration 13:  residual SS = {res}  1280202
{txt}Iteration 14:  residual SS = {res}  1279894
{txt}Iteration 15:  residual SS = {res}  1279783
{txt}Iteration 16:  residual SS = {res}  1279752
{txt}Iteration 17:  residual SS = {res}  1279744
{txt}Iteration 18:  residual SS = {res}  1279743
{txt}Iteration 19:  residual SS = {res}  1279742
{txt}Iteration 20:  residual SS = {res}  1279742
{txt}Iteration 21:  residual SS = {res}  1279742
{txt}Iteration 22:  residual SS = {res}  1279742
{txt}Iteration 23:  residual SS = {res}  1279742
{txt}Iteration 24:  residual SS = {res}  1279742
{txt}Iteration 25:  residual SS = {res}  1279742
{txt}Iteration 26:  residual SS = {res}  1279742
{txt}Iteration 27:  residual SS = {res}  1279742
{txt}Iteration 28:  residual SS = {res}  1279742
{txt}Iteration 29:  residual SS = {res}  1279742

{txt}Nonlinear regression{col 54}Number of obs = {res}     5109
{txt}{col 54}R-squared     = {res}   0.0459
{txt}{col 54}Adj R-squared = {res}   0.0454
{txt}{col 54}Root MSE      = {res} 15.85321
{txt}{col 54}Res. dev.     = {res} 42717.82

{txt}{ralign 78:(Std. Err. adjusted for {res:1737} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   diffeight{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2} 2.157388{col 26}{space 2} 1.149777{col 37}{space 1}    1.88{col 46}{space 3}0.061{col 54}{space 4}-.0977047{col 67}{space 3} 4.412481
{txt}         /d1 {c |}{col 14}{res}{space 2}-2.793502{col 26}{space 2} 1.761797{col 37}{space 1}   -1.59{col 46}{space 3}0.113{col 54}{space 4}-6.248969{col 67}{space 3} .6619656
{txt}         /d2 {c |}{col 14}{res}{space 2}-2.121682{col 26}{space 2} 1.567006{col 37}{space 1}   -1.35{col 46}{space 3}0.176{col 54}{space 4}-5.195099{col 67}{space 3} .9517358
{txt}         /d4 {c |}{col 14}{res}{space 2} 5.177407{col 26}{space 2} 2.271185{col 37}{space 1}    2.28{col 46}{space 3}0.023{col 54}{space 4} .7228593{col 67}{space 3} 9.631954
{txt}         /d8 {c |}{col 14}{res}{space 2}-226.9839{col 26}{space 2} 127.1229{col 37}{space 1}   -1.79{col 46}{space 3}0.074{col 54}{space 4}-476.3141{col 67}{space 3} 22.34625
{txt}         /d9 {c |}{col 14}{res}{space 2} 350.8917{col 26}{space 2} 184.7449{col 37}{space 1}    1.90{col 46}{space 3}0.058{col 54}{space 4}-11.45417{col 67}{space 3} 713.2376
{txt}        /d10 {c |}{col 14}{res}{space 2}-188.9067{col 26}{space 2}   103.74{col 37}{space 1}   -1.82{col 46}{space 3}0.069{col 54}{space 4}-392.3752{col 67}{space 3} 14.56187
{txt}        /d11 {c |}{col 14}{res}{space 2} 222.6572{col 26}{space 2} 120.4474{col 37}{space 1}    1.85{col 46}{space 3}0.065{col 54}{space 4}-13.58011{col 67}{space 3} 458.8945
{txt}        /d12 {c |}{col 14}{res}{space 2} 401.5237{col 26}{space 2} 204.6594{col 37}{space 1}    1.96{col 46}{space 3}0.050{col 54}{space 4} .1188058{col 67}{space 3} 802.9285
{txt}        /d13 {c |}{col 14}{res}{space 2} 230.8973{col 26}{space 2} 166.8592{col 37}{space 1}    1.38{col 46}{space 3}0.167{col 54}{space 4}-96.36879{col 67}{space 3} 558.1634
{txt}        /d14 {c |}{col 14}{res}{space 2}-421.6212{col 26}{space 2} 230.2653{col 37}{space 1}   -1.83{col 46}{space 3}0.067{col 54}{space 4}-873.2477{col 67}{space 3} 30.00535
{txt}        /d15 {c |}{col 14}{res}{space 2}-376.2128{col 26}{space 2} 227.7571{col 37}{space 1}   -1.65{col 46}{space 3}0.099{col 54}{space 4}-822.9199{col 67}{space 3} 70.49441
{txt}        /d16 {c |}{col 14}{res}{space 2}-232.8784{col 26}{space 2} 121.4422{col 37}{space 1}   -1.92{col 46}{space 3}0.055{col 54}{space 4}-471.0668{col 67}{space 3} 5.310105
{txt}        /d17 {c |}{col 14}{res}{space 2}-89.34917{col 26}{space 2} 85.34319{col 37}{space 1}   -1.05{col 46}{space 3}0.295{col 54}{space 4}-256.7354{col 67}{space 3} 78.03711
{txt}        /d18 {c |}{col 14}{res}{space 2} 221.2486{col 26}{space 2} 132.2963{col 37}{space 1}    1.67{col 46}{space 3}0.095{col 54}{space 4}-38.22819{col 67}{space 3} 480.7255
{txt}        /d19 {c |}{col 14}{res}{space 2} 194.3873{col 26}{space 2} 160.5821{col 37}{space 1}    1.21{col 46}{space 3}0.226{col 54}{space 4}-120.5675{col 67}{space 3}  509.342
{txt}        /d21 {c |}{col 14}{res}{space 2}-1.394828{col 26}{space 2} .4411401{col 37}{space 1}   -3.16{col 46}{space 3}0.002{col 54}{space 4} -2.26005{col 67}{space 3}-.5296064
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
.         ///RA4///
>         
. 
. nl(diffeight2012={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2012+({c -(}d8=0{c )-}*abspart2012*surprise303+{c -(}d9=0{c )-}*abspart2012*surprise303*/*
> */supportdummy2012)*exp({c -(}d20=0{c )-}+{c -(}d21=0{c )-}*time2012+{c -(}d22=0{c )-}*time2012*supportdummy2012+{c -(}d23=0{c )-}*time2012*abspart2012+{c -(}d24=0{c )-}*/*
> */time2012*surprise303+{c -(}d25=0{c )-}*time2012*abspart2012*supportdummy2012+{c -(}d26=0{c )-}*time2012*surprise303*supportdummy2012+/*
> */{c -(}d27=0{c )-}*time2012*surprise303*abspart2012+{c -(}d28=0{c )-}*time2012*surprise303*abspart2012*supportdummy2012)), cluster(case_id)
{txt}(obs = 5109)

Iteration 0:  residual SS = {res}  1319390
{txt}Iteration 1:  residual SS = {res}  1319385
{txt}Iteration 2:  residual SS = {res}  1303246
{txt}Iteration 3:  residual SS = {res}  1299061
{txt}Iteration 4:  residual SS = {res}  1290790
{txt}Iteration 5:  residual SS = {res}  1285879
{txt}Iteration 6:  residual SS = {res}  1283871
{txt}Iteration 7:  residual SS = {res}  1283845
{txt}Iteration 8:  residual SS = {res}  1283077
{txt}Iteration 9:  residual SS = {res}  1282790
{txt}Iteration 10:  residual SS = {res}  1282461
{txt}Iteration 11:  residual SS = {res}  1282320
{txt}Iteration 12:  residual SS = {res}  1282230
{txt}Iteration 13:  residual SS = {res}  1282188
{txt}Iteration 14:  residual SS = {res}  1282127
{txt}Iteration 15:  residual SS = {res}  1282084
{txt}Iteration 16:  residual SS = {res}  1282010
{txt}Iteration 17:  residual SS = {res}  1281955
{txt}Iteration 18:  residual SS = {res}  1281944
{txt}Iteration 19:  residual SS = {res}  1281739
{txt}Iteration 20:  residual SS = {res}  1281463
{txt}Iteration 21:  residual SS = {res}  1281376
{txt}Iteration 22:  residual SS = {res}  1281280
{txt}Iteration 23:  residual SS = {res}  1281203
{txt}Iteration 24:  residual SS = {res}  1281097
{txt}Iteration 25:  residual SS = {res}  1280981
{txt}Iteration 26:  residual SS = {res}  1280824
{txt}Iteration 27:  residual SS = {res}  1280597
{txt}Iteration 28:  residual SS = {res}  1280254
{txt}Iteration 29:  residual SS = {res}  1279952
{txt}Iteration 30:  residual SS = {res}  1279782
{txt}Iteration 31:  residual SS = {res}  1279659
{txt}Iteration 32:  residual SS = {res}  1279508
{txt}Iteration 33:  residual SS = {res}  1279364
{txt}Iteration 34:  residual SS = {res}  1279228
{txt}Iteration 35:  residual SS = {res}  1279099
{txt}Iteration 36:  residual SS = {res}  1278977
{txt}Iteration 37:  residual SS = {res}  1278863
{txt}Iteration 38:  residual SS = {res}  1278756
{txt}Iteration 39:  residual SS = {res}  1278656
{txt}Iteration 40:  residual SS = {res}  1278564
{txt}Iteration 41:  residual SS = {res}  1278479
{txt}Iteration 42:  residual SS = {res}  1278400
{txt}Iteration 43:  residual SS = {res}  1278328
{txt}Iteration 44:  residual SS = {res}  1278261
{txt}Iteration 45:  residual SS = {res}  1278200
{txt}Iteration 46:  residual SS = {res}  1278144
{txt}Iteration 47:  residual SS = {res}  1278093
{txt}Iteration 48:  residual SS = {res}  1278046
{txt}Iteration 49:  residual SS = {res}  1278003
{txt}Iteration 50:  residual SS = {res}  1277963
{txt}Iteration 51:  residual SS = {res}  1277927
{txt}Iteration 52:  residual SS = {res}  1277894
{txt}Iteration 53:  residual SS = {res}  1277864
{txt}Iteration 54:  residual SS = {res}  1277837
{txt}Iteration 55:  residual SS = {res}  1277812
{txt}Iteration 56:  residual SS = {res}  1277789
{txt}Iteration 57:  residual SS = {res}  1277768
{txt}Iteration 58:  residual SS = {res}  1277749
{txt}Iteration 59:  residual SS = {res}  1277732
{txt}Iteration 60:  residual SS = {res}  1277717
{txt}Iteration 61:  residual SS = {res}  1277702
{txt}Iteration 62:  residual SS = {res}  1277690
{txt}Iteration 63:  residual SS = {res}  1277678
{txt}Iteration 64:  residual SS = {res}  1277668
{txt}Iteration 65:  residual SS = {res}  1277659
{txt}Iteration 66:  residual SS = {res}  1277329
{txt}Iteration 67:  residual SS = {res}  1277328
{txt}Iteration 68:  residual SS = {res}  1277328
{txt}Iteration 69:  residual SS = {res}  1277328
{txt}Iteration 70:  residual SS = {res}  1277328

{txt}Nonlinear regression{col 54}Number of obs = {res}     5109
{txt}{col 54}R-squared     = {res}   0.0477
{txt}{col 54}Adj R-squared = {res}   0.0472
{txt}{col 54}Root MSE      = {res} 15.82737
{txt}{col 54}Res. dev.     = {res} 42708.17

{txt}{ralign 78:(Std. Err. adjusted for {res:1737} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2012{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2}-.1423067{col 26}{space 2} .4693047{col 37}{space 1}   -0.30{col 46}{space 3}0.762{col 54}{space 4}-1.062769{col 67}{space 3} .7781555
{txt}         /d1 {c |}{col 14}{res}{space 2} 1.216113{col 26}{space 2} .7892994{col 37}{space 1}    1.54{col 46}{space 3}0.124{col 54}{space 4}-.3319648{col 67}{space 3} 2.764191
{txt}         /d8 {c |}{col 14}{res}{space 2}-10.99775{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}         /d9 {c |}{col 14}{res}{space 2} 10.99776{col 26}{space 2} 4.92e-06{col 37}{space 1} 2.2e+06{col 46}{space 3}0.000{col 54}{space 4} 10.99775{col 67}{space 3} 10.99777
{txt}        /d20 {c |}{col 14}{res}{space 2} 13.45241{col 26}{space 2} .0147705{col 37}{space 1}  910.76{col 46}{space 3}0.000{col 54}{space 4} 13.42344{col 67}{space 3} 13.48138
{txt}        /d21 {c |}{col 14}{res}{space 2}  15.0927{col 26}{space 2} .2023582{col 37}{space 1}   74.58{col 46}{space 3}0.000{col 54}{space 4} 14.69581{col 67}{space 3}  15.4896
{txt}        /d22 {c |}{col 14}{res}{space 2} -16.6031{col 26}{space 2} 3.142479{col 37}{space 1}   -5.28{col 46}{space 3}0.000{col 54}{space 4}-22.76654{col 67}{space 3}-10.43966
{txt}        /d23 {c |}{col 14}{res}{space 2}-28.44171{col 26}{space 2} .6365239{col 37}{space 1}  -44.68{col 46}{space 3}0.000{col 54}{space 4}-29.69015{col 67}{space 3}-27.19328
{txt}        /d24 {c |}{col 14}{res}{space 2}-481.4833{col 26}{space 2} .5754836{col 37}{space 1} -836.66{col 46}{space 3}0.000{col 54}{space 4} -482.612{col 67}{space 3}-480.3545
{txt}        /d25 {c |}{col 14}{res}{space 2} 29.84459{col 26}{space 2} 3.189112{col 37}{space 1}    9.36{col 46}{space 3}0.000{col 54}{space 4} 23.58969{col 67}{space 3}  36.0995
{txt}        /d26 {c |}{col 14}{res}{space 2} 483.4049{col 26}{space 2} 3.855162{col 37}{space 1}  125.39{col 46}{space 3}0.000{col 54}{space 4} 475.8437{col 67}{space 3} 490.9662
{txt}        /d27 {c |}{col 14}{res}{space 2} 482.3143{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}        /d28 {c |}{col 14}{res}{space 2}-483.9856{col 26}{space 2} 3.795394{col 37}{space 1} -127.52{col 46}{space 3}0.000{col 54}{space 4}-491.4296{col 67}{space 3}-476.5416
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
. nl(diffeight2012={c -(}d2=0{c )-}*abspart2012+{c -(}d4=0{c )-}*supportdummy2012*abspart2012+({c -(}d8=0{c )-}*abspart2012*surprise303+{c -(}d9=0{c )-}*/*
> */abspart2012*surprise303*supportdummy2012)*exp({c -(}d20=0{c )-}+{c -(}d21=0{c )-}*time2012+{c -(}d22=0{c )-}*time2012*supportdummy2012+{c -(}d23=0{c )-}*time2012*/*
> */abspart2012+{c -(}d24=0{c )-}*time2012*surprise303+{c -(}d25=0{c )-}*time2012*abspart2012*supportdummy2012+{c -(}d26=0{c )-}*time2012*surprise303*/*
> */supportdummy2012+{c -(}d27=0{c )-}*time2012*surprise303*abspart2012+{c -(}d28=0{c )-}*time2012*surprise303*abspart2012*supportdummy2012)), cluster(case_id)
{txt}(obs = 5109)

Iteration 0:  residual SS = {res}  1319493
{txt}Iteration 1:  residual SS = {res}  1319490
{txt}Iteration 2:  residual SS = {res}  1307985
{txt}Iteration 3:  residual SS = {res}  1302819
{txt}Iteration 4:  residual SS = {res}  1291139
{txt}Iteration 5:  residual SS = {res}  1287977
{txt}Iteration 6:  residual SS = {res}  1284522
{txt}Iteration 7:  residual SS = {res}  1283490
{txt}Iteration 8:  residual SS = {res}  1283223
{txt}Iteration 9:  residual SS = {res}  1282895
{txt}Iteration 10:  residual SS = {res}  1282797
{txt}Iteration 11:  residual SS = {res}  1282492
{txt}Iteration 12:  residual SS = {res}  1282294
{txt}Iteration 13:  residual SS = {res}  1282229
{txt}Iteration 14:  residual SS = {res}  1282114
{txt}Iteration 15:  residual SS = {res}  1282088
{txt}Iteration 16:  residual SS = {res}  1281945
{txt}Iteration 17:  residual SS = {res}  1281920
{txt}Iteration 18:  residual SS = {res}  1281782
{txt}Iteration 19:  residual SS = {res}  1281690
{txt}Iteration 20:  residual SS = {res}  1281449
{txt}Iteration 21:  residual SS = {res}  1281252
{txt}Iteration 22:  residual SS = {res}  1280935
{txt}Iteration 23:  residual SS = {res}  1280933
{txt}Iteration 24:  residual SS = {res}  1280699
{txt}Iteration 25:  residual SS = {res}  1280645
{txt}Iteration 26:  residual SS = {res}  1280336
{txt}Iteration 27:  residual SS = {res}  1280186
{txt}Iteration 28:  residual SS = {res}  1279677
{txt}Iteration 29:  residual SS = {res}  1279400
{txt}Iteration 30:  residual SS = {res}  1279169
{txt}Iteration 31:  residual SS = {res}  1279086
{txt}Iteration 32:  residual SS = {res}  1278998
{txt}Iteration 33:  residual SS = {res}  1278860
{txt}Iteration 34:  residual SS = {res}  1278696
{txt}Iteration 35:  residual SS = {res}  1278529
{txt}Iteration 36:  residual SS = {res}  1278374
{txt}Iteration 37:  residual SS = {res}  1278234
{txt}Iteration 38:  residual SS = {res}  1278112
{txt}Iteration 39:  residual SS = {res}  1278008
{txt}Iteration 40:  residual SS = {res}  1277919
{txt}Iteration 41:  residual SS = {res}  1277844
{txt}Iteration 42:  residual SS = {res}  1277781
{txt}Iteration 43:  residual SS = {res}  1277729
{txt}Iteration 44:  residual SS = {res}  1277686
{txt}Iteration 45:  residual SS = {res}  1277650
{txt}Iteration 46:  residual SS = {res}  1277621
{txt}Iteration 47:  residual SS = {res}  1277599
{txt}Iteration 48:  residual SS = {res}  1277582
{txt}Iteration 49:  residual SS = {res}  1277571
{txt}Iteration 50:  residual SS = {res}  1277005
{txt}Iteration 51:  residual SS = {res}  1277005
{txt}Iteration 52:  residual SS = {res}  1277005
{txt}Iteration 53:  residual SS = {res}  1277005

{txt}Nonlinear regression{col 54}Number of obs = {res}     5109
{txt}{col 54}R-squared     = {res}   0.0494
{txt}{col 54}Adj R-squared = {res}   0.0489
{txt}{col 54}Root MSE      = {res} 15.82536
{txt}{col 54}Res. dev.     = {res} 42706.88

{txt}{ralign 78:(Std. Err. adjusted for {res:1737} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2012{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d2 {c |}{col 14}{res}{space 2}-.3429665{col 26}{space 2} .6532077{col 37}{space 1}   -0.53{col 46}{space 3}0.600{col 54}{space 4}-1.624123{col 67}{space 3} .9381902
{txt}         /d4 {c |}{col 14}{res}{space 2} 1.961535{col 26}{space 2} 1.070314{col 37}{space 1}    1.83{col 46}{space 3}0.067{col 54}{space 4}-.1377061{col 67}{space 3} 4.060775
{txt}         /d8 {c |}{col 14}{res}{space 2}-8.760354{col 26}{space 2} 2.45e-06{col 37}{space 1}-3.6e+06{col 46}{space 3}0.000{col 54}{space 4}-8.760359{col 67}{space 3}-8.760349
{txt}         /d9 {c |}{col 14}{res}{space 2} 8.760357{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}        /d20 {c |}{col 14}{res}{space 2} 14.24537{col 26}{space 2} .0136377{col 37}{space 1} 1044.56{col 46}{space 3}0.000{col 54}{space 4} 14.21862{col 67}{space 3} 14.27212
{txt}        /d21 {c |}{col 14}{res}{space 2} 16.05192{col 26}{space 2}  .205363{col 37}{space 1}   78.16{col 46}{space 3}0.000{col 54}{space 4} 15.64913{col 67}{space 3}  16.4547
{txt}        /d22 {c |}{col 14}{res}{space 2}-17.32469{col 26}{space 2}  2.90715{col 37}{space 1}   -5.96{col 46}{space 3}0.000{col 54}{space 4}-23.02658{col 67}{space 3}-11.62281
{txt}        /d23 {c |}{col 14}{res}{space 2}-30.00347{col 26}{space 2} .6458655{col 37}{space 1}  -46.45{col 46}{space 3}0.000{col 54}{space 4}-31.27023{col 67}{space 3}-28.73671
{txt}        /d24 {c |}{col 14}{res}{space 2}-519.1023{col 26}{space 2} .5826607{col 37}{space 1} -890.92{col 46}{space 3}0.000{col 54}{space 4}-520.2451{col 67}{space 3}-517.9595
{txt}        /d25 {c |}{col 14}{res}{space 2} 31.16019{col 26}{space 2} 2.961233{col 37}{space 1}   10.52{col 46}{space 3}0.000{col 54}{space 4} 25.35223{col 67}{space 3} 36.96815
{txt}        /d26 {c |}{col 14}{res}{space 2} 520.7447{col 26}{space 2} 3.572351{col 37}{space 1}  145.77{col 46}{space 3}0.000{col 54}{space 4} 513.7382{col 67}{space 3} 527.7513
{txt}        /d27 {c |}{col 14}{res}{space 2} 519.9644{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}        /d28 {c |}{col 14}{res}{space 2}-521.3316{col 26}{space 2} 3.511508{col 37}{space 1} -148.46{col 46}{space 3}0.000{col 54}{space 4}-528.2189{col 67}{space 3}-514.4444
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. nl(diffeight2012={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2012+{c -(}d2=0{c )-}*abspart2012+{c -(}d4=0{c )-}*supportdummy2012*abspart2012+({c -(}d8=0{c )-}*abspart2012*/*
> */surprise303+{c -(}d9=0{c )-}*abspart2012*surprise303*supportdummy2012)*exp({c -(}d20=0{c )-}+{c -(}d21=0{c )-}*time2012+{c -(}d22=0{c )-}*time2012*/*
> */supportdummy2012+{c -(}d23=0{c )-}*time2012*abspart2012+{c -(}d24=0{c )-}*time2012*surprise303+{c -(}d25=0{c )-}*time2012*abspart2012*supportdummy2012+/*
> */{c -(}d26=0{c )-}*time2012*surprise303*supportdummy2012+{c -(}d27=0{c )-}*time2012*surprise303*abspart2012+{c -(}d28=0{c )-}*time2012*surprise303*abspart2012*supportdummy2012)), cluster(case_id)
{txt}(obs = 5109)

Iteration 0:  residual SS = {res}  1318310
{txt}Iteration 1:  residual SS = {res}  1318149
{txt}Iteration 2:  residual SS = {res}  1314751
{txt}Iteration 3:  residual SS = {res}  1304482
{txt}Iteration 4:  residual SS = {res}  1291517
{txt}Iteration 5:  residual SS = {res}  1285394
{txt}Iteration 6:  residual SS = {res}  1283513
{txt}Iteration 7:  residual SS = {res}  1283236
{txt}Iteration 8:  residual SS = {res}  1282652
{txt}Iteration 9:  residual SS = {res}  1282382
{txt}Iteration 10:  residual SS = {res}  1282064
{txt}Iteration 11:  residual SS = {res}  1282031
{txt}Iteration 12:  residual SS = {res}  1281787
{txt}Iteration 13:  residual SS = {res}  1281663
{txt}Iteration 14:  residual SS = {res}  1281463
{txt}Iteration 15:  residual SS = {res}  1281345
{txt}Iteration 16:  residual SS = {res}  1281240
{txt}Iteration 17:  residual SS = {res}  1281067
{txt}Iteration 18:  residual SS = {res}  1280870
{txt}Iteration 19:  residual SS = {res}  1280778
{txt}Iteration 20:  residual SS = {res}  1280733
{txt}Iteration 21:  residual SS = {res}  1280703
{txt}Iteration 22:  residual SS = {res}  1280669
{txt}Iteration 23:  residual SS = {res}  1280642
{txt}Iteration 24:  residual SS = {res}  1280623
{txt}Iteration 25:  residual SS = {res}  1280615
{txt}Iteration 26:  residual SS = {res}  1280606
{txt}Iteration 27:  residual SS = {res}  1280552
{txt}Iteration 28:  residual SS = {res}  1280503
{txt}Iteration 29:  residual SS = {res}  1280482
{txt}Iteration 30:  residual SS = {res}  1280386
{txt}Iteration 31:  residual SS = {res}  1280273
{txt}Iteration 32:  residual SS = {res}  1280035
{txt}Iteration 33:  residual SS = {res}  1280000
{txt}Iteration 34:  residual SS = {res}  1279748
{txt}Iteration 35:  residual SS = {res}  1279423
{txt}Iteration 36:  residual SS = {res}  1279229
{txt}Iteration 37:  residual SS = {res}  1279041
{txt}Iteration 38:  residual SS = {res}  1278832
{txt}Iteration 39:  residual SS = {res}  1278623
{txt}Iteration 40:  residual SS = {res}  1278428
{txt}Iteration 41:  residual SS = {res}  1278254
{txt}Iteration 42:  residual SS = {res}  1278102
{txt}Iteration 43:  residual SS = {res}  1277972
{txt}Iteration 44:  residual SS = {res}  1277861
{txt}Iteration 45:  residual SS = {res}  1277768
{txt}Iteration 46:  residual SS = {res}  1277688
{txt}Iteration 47:  residual SS = {res}  1277621
{txt}Iteration 48:  residual SS = {res}  1277565
{txt}Iteration 49:  residual SS = {res}  1277517
{txt}Iteration 50:  residual SS = {res}  1277476
{txt}Iteration 51:  residual SS = {res}  1277441
{txt}Iteration 52:  residual SS = {res}  1277412
{txt}Iteration 53:  residual SS = {res}  1277387
{txt}Iteration 54:  residual SS = {res}  1277365
{txt}Iteration 55:  residual SS = {res}  1276882
{txt}Iteration 56:  residual SS = {res}  1276882
{txt}Iteration 57:  residual SS = {res}  1276882
{txt}Iteration 58:  residual SS = {res}  1276882

{txt}Nonlinear regression{col 54}Number of obs = {res}     5109
{txt}{col 54}R-squared     = {res}   0.0481
{txt}{col 54}Adj R-squared = {res}   0.0475
{txt}{col 54}Root MSE      = {res} 15.82771
{txt}{col 54}Res. dev.     = {res} 42706.38

{txt}{ralign 78:(Std. Err. adjusted for {res:1737} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2012{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2} .5755267{col 26}{space 2} 1.105641{col 37}{space 1}    0.52{col 46}{space 3}0.603{col 54}{space 4}-1.593002{col 67}{space 3} 2.744055
{txt}         /d1 {c |}{col 14}{res}{space 2}-.2980635{col 26}{space 2} 1.837091{col 37}{space 1}   -0.16{col 46}{space 3}0.871{col 54}{space 4}-3.901209{col 67}{space 3} 3.305082
{txt}         /d2 {c |}{col 14}{res}{space 2}-1.068338{col 26}{space 2} 1.543311{col 37}{space 1}   -0.69{col 46}{space 3}0.489{col 54}{space 4}-4.095284{col 67}{space 3} 1.958607
{txt}         /d4 {c |}{col 14}{res}{space 2} 2.336274{col 26}{space 2} 2.468208{col 37}{space 1}    0.95{col 46}{space 3}0.344{col 54}{space 4}  -2.5047{col 67}{space 3} 7.177248
{txt}         /d8 {c |}{col 14}{res}{space 2}-12.78544{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}         /d9 {c |}{col 14}{res}{space 2} 12.78545{col 26}{space 2} 4.75e-06{col 37}{space 1} 2.7e+06{col 46}{space 3}0.000{col 54}{space 4} 12.78544{col 67}{space 3} 12.78546
{txt}        /d20 {c |}{col 14}{res}{space 2} 13.59906{col 26}{space 2} .0159226{col 37}{space 1}  854.07{col 46}{space 3}0.000{col 54}{space 4} 13.56783{col 67}{space 3} 13.63029
{txt}        /d21 {c |}{col 14}{res}{space 2} 15.61541{col 26}{space 2} .2076354{col 37}{space 1}   75.21{col 46}{space 3}0.000{col 54}{space 4} 15.20817{col 67}{space 3} 16.02265
{txt}        /d22 {c |}{col 14}{res}{space 2}-16.97035{col 26}{space 2} 3.509153{col 37}{space 1}   -4.84{col 46}{space 3}0.000{col 54}{space 4}-23.85296{col 67}{space 3}-10.08774
{txt}        /d23 {c |}{col 14}{res}{space 2}-29.32665{col 26}{space 2} .6527811{col 37}{space 1}  -44.93{col 46}{space 3}0.000{col 54}{space 4}-30.60697{col 67}{space 3}-28.04633
{txt}        /d24 {c |}{col 14}{res}{space 2}-500.9866{col 26}{space 2} .5880012{col 37}{space 1} -852.02{col 46}{space 3}0.000{col 54}{space 4}-502.1399{col 67}{space 3}-499.8334
{txt}        /d25 {c |}{col 14}{res}{space 2} 30.56685{col 26}{space 2} 3.557635{col 37}{space 1}    8.59{col 46}{space 3}0.000{col 54}{space 4} 23.58915{col 67}{space 3} 37.54455
{txt}        /d26 {c |}{col 14}{res}{space 2} 502.7276{col 26}{space 2} 4.293878{col 37}{space 1}  117.08{col 46}{space 3}0.000{col 54}{space 4} 494.3058{col 67}{space 3} 511.1493
{txt}        /d27 {c |}{col 14}{res}{space 2} 501.8721{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}        /d28 {c |}{col 14}{res}{space 2} -503.341{col 26}{space 2} 4.249767{col 37}{space 1} -118.44{col 46}{space 3}0.000{col 54}{space 4}-511.6762{col 67}{space 3}-495.0058
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
. nl(diffeight2012=({c -(}d8=0{c )-}*abspart2012*surprise303+{c -(}d9=0{c )-}*abspart2012*surprise303*supportdummy2012)*exp({c -(}d20=0{c )-}+{c -(}d21=0{c )-}*time2012/*
> */+{c -(}d22=0{c )-}*time2012*supportdummy2012+{c -(}d23=0{c )-}*time2012*abspart2012+{c -(}d24=0{c )-}*time2012*surprise303+{c -(}d25=0{c )-}*time2012*abspart2012*/*
> */supportdummy2012+{c -(}d26=0{c )-}*time2012*surprise303*supportdummy2012+{c -(}d27=0{c )-}*time2012*surprise303*abspart2012/*
> */+{c -(}d28=0{c )-}*time2012*surprise303*abspart2012*supportdummy2012)), cluster(case_id)
{txt}(obs = 5109)

Iteration 0:  residual SS = {res}  1321257
{txt}Iteration 1:  residual SS = {res}  1321253
{txt}Iteration 2:  residual SS = {res}  1304536
{txt}Iteration 3:  residual SS = {res}  1292990
{txt}Iteration 4:  residual SS = {res}  1286737
{txt}Iteration 5:  residual SS = {res}  1285420
{txt}Iteration 6:  residual SS = {res}  1284867
{txt}Iteration 7:  residual SS = {res}  1284300
{txt}Iteration 8:  residual SS = {res}  1284121
{txt}Iteration 9:  residual SS = {res}  1283876
{txt}Iteration 10:  residual SS = {res}  1283778
{txt}Iteration 11:  residual SS = {res}  1283673
{txt}Iteration 12:  residual SS = {res}  1283556
{txt}Iteration 13:  residual SS = {res}  1283407
{txt}Iteration 14:  residual SS = {res}  1283329
{txt}Iteration 15:  residual SS = {res}  1282949
{txt}Iteration 16:  residual SS = {res}  1282844
{txt}Iteration 17:  residual SS = {res}  1282716
{txt}Iteration 18:  residual SS = {res}  1282555
{txt}Iteration 19:  residual SS = {res}  1282322
{txt}Iteration 20:  residual SS = {res}  1281980
{txt}Iteration 21:  residual SS = {res}  1281797
{txt}Iteration 22:  residual SS = {res}  1281622
{txt}Iteration 23:  residual SS = {res}  1281499
{txt}Iteration 24:  residual SS = {res}  1281395
{txt}Iteration 25:  residual SS = {res}  1281303
{txt}Iteration 26:  residual SS = {res}  1281218
{txt}Iteration 27:  residual SS = {res}  1281134
{txt}Iteration 28:  residual SS = {res}  1281051
{txt}Iteration 29:  residual SS = {res}  1280968
{txt}Iteration 30:  residual SS = {res}  1280886
{txt}Iteration 31:  residual SS = {res}  1280805
{txt}Iteration 32:  residual SS = {res}  1280726
{txt}Iteration 33:  residual SS = {res}  1280649
{txt}Iteration 34:  residual SS = {res}  1280575
{txt}Iteration 35:  residual SS = {res}  1280505
{txt}Iteration 36:  residual SS = {res}  1280437
{txt}Iteration 37:  residual SS = {res}  1280373
{txt}Iteration 38:  residual SS = {res}  1280312
{txt}Iteration 39:  residual SS = {res}  1280255
{txt}Iteration 40:  residual SS = {res}  1280201
{txt}Iteration 41:  residual SS = {res}  1280151
{txt}Iteration 42:  residual SS = {res}  1280104
{txt}Iteration 43:  residual SS = {res}  1280059
{txt}Iteration 44:  residual SS = {res}  1280018
{txt}Iteration 45:  residual SS = {res}  1279980
{txt}Iteration 46:  residual SS = {res}  1279944
{txt}Iteration 47:  residual SS = {res}  1279911
{txt}Iteration 48:  residual SS = {res}  1279880
{txt}Iteration 49:  residual SS = {res}  1279851
{txt}Iteration 50:  residual SS = {res}  1279824
{txt}Iteration 51:  residual SS = {res}  1279800
{txt}Iteration 52:  residual SS = {res}  1279777
{txt}Iteration 53:  residual SS = {res}  1279756
{txt}Iteration 54:  residual SS = {res}  1279736
{txt}Iteration 55:  residual SS = {res}  1279719
{txt}Iteration 56:  residual SS = {res}  1279702
{txt}Iteration 57:  residual SS = {res}  1279687
{txt}Iteration 58:  residual SS = {res}  1279673
{txt}Iteration 59:  residual SS = {res}  1279141
{txt}Iteration 60:  residual SS = {res}  1279141
{txt}Iteration 61:  residual SS = {res}  1279141

{txt}Nonlinear regression{col 54}Number of obs = {res}     5109
{txt}{col 54}R-squared     = {res}   0.0479
{txt}{col 54}Adj R-squared = {res}   0.0473
{txt}{col 54}Root MSE      = {res} 15.83549
{txt}{col 54}Res. dev.     = {res} 42715.41

{txt}{ralign 78:(Std. Err. adjusted for {res:1737} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2012{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d8 {c |}{col 14}{res}{space 2}-14.08775{col 26}{space 2} 5.52e-06{col 37}{space 1}-2.6e+06{col 46}{space 3}0.000{col 54}{space 4}-14.08776{col 67}{space 3}-14.08773
{txt}         /d9 {c |}{col 14}{res}{space 2} 14.08776{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}        /d20 {c |}{col 14}{res}{space 2} 13.13906{col 26}{space 2} .0128646{col 37}{space 1} 1021.33{col 46}{space 3}0.000{col 54}{space 4} 13.11383{col 67}{space 3}  13.1643
{txt}        /d21 {c |}{col 14}{res}{space 2} 14.96864{col 26}{space 2} .2009876{col 37}{space 1}   74.48{col 46}{space 3}0.000{col 54}{space 4} 14.57443{col 67}{space 3} 15.36284
{txt}        /d22 {c |}{col 14}{res}{space 2}-15.82094{col 26}{space 2} 1.045851{col 37}{space 1}  -15.13{col 46}{space 3}0.000{col 54}{space 4} -17.8722{col 67}{space 3}-13.76968
{txt}        /d23 {c |}{col 14}{res}{space 2}-28.22603{col 26}{space 2} .6320719{col 37}{space 1}  -44.66{col 46}{space 3}0.000{col 54}{space 4}-29.46574{col 67}{space 3}-26.98633
{txt}        /d24 {c |}{col 14}{res}{space 2}-476.9799{col 26}{space 2} .5708776{col 37}{space 1} -835.52{col 46}{space 3}0.000{col 54}{space 4}-478.0996{col 67}{space 3}-475.8602
{txt}        /d25 {c |}{col 14}{res}{space 2} 28.98704{col 26}{space 2} 1.202472{col 37}{space 1}   24.11{col 46}{space 3}0.000{col 54}{space 4}  26.6286{col 67}{space 3} 31.34549
{txt}        /d26 {c |}{col 14}{res}{space 2}   478.09{col 26}{space 2} 1.364586{col 37}{space 1}  350.36{col 46}{space 3}0.000{col 54}{space 4} 475.4136{col 67}{space 3} 480.7664
{txt}        /d27 {c |}{col 14}{res}{space 2} 477.7893{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}        /d28 {c |}{col 14}{res}{space 2}-478.6982{col 26}{space 2} 1.243713{col 37}{space 1} -384.89{col 46}{space 3}0.000{col 54}{space 4}-481.1375{col 67}{space 3}-476.2588
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. ///Overall///
> 
.         ///RA1-3///
>         
.         restore
{txt}
{com}.         preserve 
{txt}
{com}.         
.         drop if diffeight==.
{txt}(2948 observations deleted)

{com}.         drop if supportdummy==.
{txt}(3748 observations deleted)

{com}.         drop if abspart==.
{txt}(6 observations deleted)

{com}.         drop if surprise==.
{txt}(4 observations deleted)

{com}.         drop if adjtimeoverall==.
{txt}(135 observations deleted)

{com}. 
. //nl(diffeight={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy+{c -(}d2=0{c )-}*abspart+{c -(}d3=0{c )-}*surprise+{c -(}d4=0{c )-}*supportdummy*abspart+{c -(}d5=0{c )-}*supportdummy*/*
. //*/surprise+{c -(}d6=0{c )-}*abspart*surprise+{c -(}d7=0{c )-}*abspart*surprise*supportdummy+({c -(}d8=0{c )-}*abspart*surprise+{c -(}d9=0{c )-}*abspart*/*
. //*/surprise*supportdummy+{c -(}d10=0{c )-}+{c -(}d11=0{c )-}*supportdummy+{c -(}d12=0{c )-}*abspart+{c -(}d13=0{c )-}*surprise+{c -(}d14=0{c )-}*supportdummy*abspart+/*
. //*/{c -(}d15=0{c )-}*supportdummy*surprise+{c -(}d16=0{c )-}*abspart^2+{c -(}d17=0{c )-}*surprise^2+{c -(}d18=0{c )-}*abspart^2*supportdummy+{c -(}d19=0{c )-}*surprise/*
. //*/^2*supportdummy)*exp({c -(}d20=0{c )-}+{c -(}d21=0{c )-}*timeoverall+{c -(}d22=0{c )-}*timeoverall*supportdummy+{c -(}d23=0{c )-}*timeoverall*abspart+{c -(}d24/=0{c )-}*/*
. //*/timeoverall*surprise+{c -(}d25=0{c )-}*timeoverall*abspart*supportdummy+{c -(}d26=0{c )-}*timeoverall*surprise*supportdummy+{c -(}d27=0{c )-}*/*
. //*/timeoverall*surprise*abspart+{c -(}d28=0{c )-}*timeoverall*surprise*abspart*supportdummy)), cluster(case_id)
. 
. nl(diffeight={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy+{c -(}d2=0{c )-}*abspart+{c -(}d3=0{c )-}*surprise+{c -(}d4=0{c )-}*supportdummy*abspart+{c -(}d5=0{c )-}*supportdummy*/*
> */surprise+{c -(}d6=0{c )-}*abspart*surprise+{c -(}d7=0{c )-}*abspart*surprise*supportdummy+({c -(}d8=0{c )-}*abspart*surprise+{c -(}d9=0{c )-}*abspart*surprise*/*
> */supportdummy)*exp({c -(}d21=0{c )-}*timeoverall)), cluster(case_id)
{txt}(obs = 6067)

Iteration 0:  residual SS = {res}  1523893
{txt}Iteration 1:  residual SS = {res}  1523893
{txt}Iteration 2:  residual SS = {res}  1523892
{txt}Iteration 3:  residual SS = {res}  1523890
{txt}Iteration 4:  residual SS = {res}  1523890
{txt}Iteration 5:  residual SS = {res}  1523890
{txt}Iteration 6:  residual SS = {res}  1523890
{txt}Iteration 7:  residual SS = {res}  1523889
{txt}Iteration 8:  residual SS = {res}  1523816
{txt}Iteration 9:  residual SS = {res}  1523786
{txt}Iteration 10:  residual SS = {res}  1522756
{txt}Iteration 11:  residual SS = {res}  1522728
{txt}Iteration 12:  residual SS = {res}  1521093
{txt}Iteration 13:  residual SS = {res}  1520216
{txt}Iteration 14:  residual SS = {res}  1511524
{txt}Iteration 15:  residual SS = {res}  1509328
{txt}Iteration 16:  residual SS = {res}  1493794
{txt}Iteration 17:  residual SS = {res}  1481591
{txt}Iteration 18:  residual SS = {res}  1481120
{txt}Iteration 19:  residual SS = {res}  1480901
{txt}Iteration 20:  residual SS = {res}  1480853
{txt}Iteration 21:  residual SS = {res}  1480853
{txt}Iteration 22:  residual SS = {res}  1480853
{txt}Iteration 23:  residual SS = {res}  1480853
{txt}Iteration 24:  residual SS = {res}  1480853

{txt}Nonlinear regression{col 54}Number of obs = {res}     6067
{txt}{col 54}R-squared     = {res}   0.0533
{txt}{col 54}Adj R-squared = {res}   0.0529
{txt}{col 54}Root MSE      = {res} 15.63735
{txt}{col 54}Res. dev.     = {res} 50570.79

{txt}{ralign 78:(Std. Err. adjusted for {res:2220} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   diffeight{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2}-2.708743{col 26}{space 2} 3.461036{col 37}{space 1}   -0.78{col 46}{space 3}0.434{col 54}{space 4}-9.495952{col 67}{space 3} 4.078465
{txt}         /d1 {c |}{col 14}{res}{space 2} 5.780893{col 26}{space 2} 4.343218{col 37}{space 1}    1.33{col 46}{space 3}0.183{col 54}{space 4}-2.736303{col 67}{space 3} 14.29809
{txt}         /d2 {c |}{col 14}{res}{space 2} 4.319784{col 26}{space 2} 4.450241{col 37}{space 1}    0.97{col 46}{space 3}0.332{col 54}{space 4}-4.407289{col 67}{space 3} 13.04686
{txt}         /d3 {c |}{col 14}{res}{space 2} 7.946927{col 26}{space 2} 6.035809{col 37}{space 1}    1.32{col 46}{space 3}0.188{col 54}{space 4}-3.889497{col 67}{space 3} 19.78335
{txt}         /d4 {c |}{col 14}{res}{space 2}-5.869153{col 26}{space 2} 5.399085{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-16.45694{col 67}{space 3} 4.718635
{txt}         /d5 {c |}{col 14}{res}{space 2}-19.14228{col 26}{space 2}  9.28302{col 37}{space 1}   -2.06{col 46}{space 3}0.039{col 54}{space 4}-37.34659{col 67}{space 3}-.9379638
{txt}         /d6 {c |}{col 14}{res}{space 2} -11.1618{col 26}{space 2} 7.679328{col 37}{space 1}   -1.45{col 46}{space 3}0.146{col 54}{space 4}-26.22122{col 67}{space 3}  3.89762
{txt}         /d7 {c |}{col 14}{res}{space 2} 26.01976{col 26}{space 2} 11.79016{col 37}{space 1}    2.21{col 46}{space 3}0.027{col 54}{space 4} 2.898857{col 67}{space 3} 49.14066
{txt}         /d8 {c |}{col 14}{res}{space 2}-116.1374{col 26}{space 2} 68.87691{col 37}{space 1}   -1.69{col 46}{space 3}0.092{col 54}{space 4}-251.2073{col 67}{space 3} 18.93255
{txt}         /d9 {c |}{col 14}{res}{space 2} 158.6859{col 26}{space 2} 93.95377{col 37}{space 1}    1.69{col 46}{space 3}0.091{col 54}{space 4}-25.56057{col 67}{space 3} 342.9324
{txt}        /d21 {c |}{col 14}{res}{space 2}-1.765521{col 26}{space 2} .5921745{col 37}{space 1}   -2.98{col 46}{space 3}0.003{col 54}{space 4}-2.926795{col 67}{space 3}-.6042466
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
. nl(diffeight={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy+({c -(}d8=0{c )-}*abspart*surprise+{c -(}d9=0{c )-}*abspart*surprise*supportdummy+{c -(}d10=0{c )-}+{c -(}d11=0{c )-}*/*
> */supportdummy+{c -(}d12=0{c )-}*abspart+{c -(}d13=0{c )-}*surprise+{c -(}d14=0{c )-}*supportdummy*abspart+{c -(}d15=0{c )-}*supportdummy*surprise+{c -(}d16=0{c )-}*/*
> */abspart^2+{c -(}d17=0{c )-}*surprise^2+{c -(}d18=0{c )-}*abspart^2*supportdummy+{c -(}d19=0{c )-}*surprise^2*supportdummy)*exp({c -(}d21=0{c )-}*timeoverall)), cluster(case_id)
{txt}(obs = 6067)

Iteration 0:  residual SS = {res}  1515810
{txt}Iteration 1:  residual SS = {res}  1515713
{txt}Iteration 2:  residual SS = {res}  1515633
{txt}Iteration 3:  residual SS = {res}  1515600
{txt}Iteration 4:  residual SS = {res}  1515584
{txt}Iteration 5:  residual SS = {res}  1515574
{txt}Iteration 6:  residual SS = {res}  1515569
{txt}Iteration 7:  residual SS = {res}  1515565
{txt}Iteration 8:  residual SS = {res}  1515562
{txt}Iteration 9:  residual SS = {res}  1515562
{txt}Iteration 10:  residual SS = {res}  1513206
{txt}Iteration 11:  residual SS = {res}  1513187
{txt}Iteration 12:  residual SS = {res}  1513178
{txt}Iteration 13:  residual SS = {res}  1513170
{txt}Iteration 14:  residual SS = {res}  1513166
{txt}Iteration 15:  residual SS = {res}  1509109
{txt}Iteration 16:  residual SS = {res}  1509051
{txt}Iteration 17:  residual SS = {res}  1507083
{txt}Iteration 18:  residual SS = {res}  1507027
{txt}Iteration 19:  residual SS = {res}  1506852
{txt}Iteration 20:  residual SS = {res}  1506850
{txt}Iteration 21:  residual SS = {res}  1506850
{txt}Iteration 22:  residual SS = {res}  1506850

{txt}Nonlinear regression{col 54}Number of obs = {res}     6067
{txt}{col 54}R-squared     = {res}   0.0367
{txt}{col 54}Adj R-squared = {res}   0.0363
{txt}{col 54}Root MSE      = {res} 15.77792
{txt}{col 54}Res. dev.     = {res} 50676.37

{txt}{ralign 78:(Std. Err. adjusted for {res:2220} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   diffeight{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2} -476.624{col 26}{space 2} 58.97868{col 37}{space 1}   -8.08{col 46}{space 3}0.000{col 54}{space 4}-592.2832{col 67}{space 3}-360.9649
{txt}         /d1 {c |}{col 14}{res}{space 2} 598.4476{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}         /d8 {c |}{col 14}{res}{space 2}-16.02484{col 26}{space 2} 7.840988{col 37}{space 1}   -2.04{col 46}{space 3}0.041{col 54}{space 4}-31.40128{col 67}{space 3}-.6484016
{txt}         /d9 {c |}{col 14}{res}{space 2} 34.92274{col 26}{space 2} 12.03297{col 37}{space 1}    2.90{col 46}{space 3}0.004{col 54}{space 4} 11.32568{col 67}{space 3}  58.5198
{txt}        /d10 {c |}{col 14}{res}{space 2} 468.5615{col 26}{space 2} 59.12092{col 37}{space 1}    7.93{col 46}{space 3}0.000{col 54}{space 4} 352.6234{col 67}{space 3} 584.4996
{txt}        /d11 {c |}{col 14}{res}{space 2}-584.3104{col 26}{space 2}   7.0103{col 37}{space 1}  -83.35{col 46}{space 3}0.000{col 54}{space 4}-598.0578{col 67}{space 3}-570.5629
{txt}        /d12 {c |}{col 14}{res}{space 2} 27.72945{col 26}{space 2} 12.15191{col 37}{space 1}    2.28{col 46}{space 3}0.023{col 54}{space 4} 3.899149{col 67}{space 3} 51.55974
{txt}        /d13 {c |}{col 14}{res}{space 2}-2.077235{col 26}{space 2} 11.75856{col 37}{space 1}   -0.18{col 46}{space 3}0.860{col 54}{space 4}-25.13616{col 67}{space 3} 20.98169
{txt}        /d14 {c |}{col 14}{res}{space 2}-32.31611{col 26}{space 2}  16.7548{col 37}{space 1}   -1.93{col 46}{space 3}0.054{col 54}{space 4}-65.17283{col 67}{space 3} .5406136
{txt}        /d15 {c |}{col 14}{res}{space 2}-28.78817{col 26}{space 2} 18.06651{col 37}{space 1}   -1.59{col 46}{space 3}0.111{col 54}{space 4}-64.21721{col 67}{space 3} 6.640873
{txt}        /d16 {c |}{col 14}{res}{space 2}-17.74201{col 26}{space 2} 8.470898{col 37}{space 1}   -2.09{col 46}{space 3}0.036{col 54}{space 4}-34.35373{col 67}{space 3}-1.130295
{txt}        /d17 {c |}{col 14}{res}{space 2} 8.577326{col 26}{space 2}   8.1508{col 37}{space 1}    1.05{col 46}{space 3}0.293{col 54}{space 4}-7.406666{col 67}{space 3} 24.56132
{txt}        /d18 {c |}{col 14}{res}{space 2} 19.45815{col 26}{space 2} 11.49484{col 37}{space 1}    1.69{col 46}{space 3}0.091{col 54}{space 4}-3.083615{col 67}{space 3} 41.99991
{txt}        /d19 {c |}{col 14}{res}{space 2} 23.46711{col 26}{space 2} 18.88662{col 37}{space 1}    1.24{col 46}{space 3}0.214{col 54}{space 4}-13.57019{col 67}{space 3} 60.50441
{txt}        /d21 {c |}{col 14}{res}{space 2} .0004325{col 26}{space 2} .0000824{col 37}{space 1}    5.25{col 46}{space 3}0.000{col 54}{space 4} .0002709{col 67}{space 3}  .000594
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
. nl(diffeight={c -(}d2=0{c )-}*abspart+{c -(}d4=0{c )-}*supportdummy*abspart+({c -(}d8=0{c )-}*abspart*surprise+{c -(}d9=0{c )-}*abspart*surprise*supportdummy/*
> */+{c -(}d10=0{c )-}+{c -(}d11=0{c )-}*supportdummy+{c -(}d12=0{c )-}*abspart+{c -(}d13=0{c )-}*surprise+{c -(}d14=0{c )-}*supportdummy*abspart+{c -(}d15=0{c )-}*supportdummy*/*
> */surprise+{c -(}d16=0{c )-}*abspart^2+{c -(}d17=0{c )-}*surprise^2+{c -(}d18=0{c )-}*abspart^2*supportdummy+{c -(}d19=0{c )-}*surprise^2*supportdummy)*exp({c -(}d21=0{c )-}*timeoverall)), cluster(case_id)
{txt}(obs = 6067)

Iteration 0:  residual SS = {res}  1515810
{txt}Iteration 1:  residual SS = {res}  1514498
{txt}Iteration 2:  residual SS = {res}  1507921
{txt}Iteration 3:  residual SS = {res}  1507627
{txt}Iteration 4:  residual SS = {res}  1505750
{txt}Iteration 5:  residual SS = {res}  1495553
{txt}Iteration 6:  residual SS = {res}  1494369
{txt}Iteration 7:  residual SS = {res}  1488169
{txt}Iteration 8:  residual SS = {res}  1485171
{txt}Iteration 9:  residual SS = {res}  1482264
{txt}Iteration 10:  residual SS = {res}  1480140
{txt}Iteration 11:  residual SS = {res}  1479074
{txt}Iteration 12:  residual SS = {res}  1478593
{txt}Iteration 13:  residual SS = {res}  1478384
{txt}Iteration 14:  residual SS = {res}  1478330
{txt}Iteration 15:  residual SS = {res}  1478322
{txt}Iteration 16:  residual SS = {res}  1478322
{txt}Iteration 17:  residual SS = {res}  1478321
{txt}Iteration 18:  residual SS = {res}  1478321
{txt}Iteration 19:  residual SS = {res}  1478321
{txt}Iteration 20:  residual SS = {res}  1478321
{txt}Iteration 21:  residual SS = {res}  1478321
{txt}Iteration 22:  residual SS = {res}  1478321
{txt}Iteration 23:  residual SS = {res}  1478321
{txt}Iteration 24:  residual SS = {res}  1478321
{txt}Iteration 25:  residual SS = {res}  1478321
{txt}Iteration 26:  residual SS = {res}  1478321
{txt}Iteration 27:  residual SS = {res}  1478321
{txt}Iteration 28:  residual SS = {res}  1478321

{txt}Nonlinear regression{col 54}Number of obs = {res}     6067
{txt}{col 54}R-squared     = {res}   0.0555
{txt}{col 54}Adj R-squared = {res}   0.0551
{txt}{col 54}Root MSE      = {res} 15.62914
{txt}{col 54}Res. dev.     = {res} 50560.41

{txt}{ralign 78:(Std. Err. adjusted for {res:2220} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   diffeight{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d2 {c |}{col 14}{res}{space 2}-.0095312{col 26}{space 2} .6255604{col 37}{space 1}   -0.02{col 46}{space 3}0.988{col 54}{space 4}-1.236276{col 67}{space 3} 1.217214
{txt}         /d4 {c |}{col 14}{res}{space 2} 2.256814{col 26}{space 2} .8196114{col 37}{space 1}    2.75{col 46}{space 3}0.006{col 54}{space 4} .6495284{col 67}{space 3} 3.864099
{txt}         /d8 {c |}{col 14}{res}{space 2}-304.9684{col 26}{space 2} 228.1614{col 37}{space 1}   -1.34{col 46}{space 3}0.181{col 54}{space 4}-752.4005{col 67}{space 3} 142.4638
{txt}         /d9 {c |}{col 14}{res}{space 2} 482.0161{col 26}{space 2} 352.6619{col 37}{space 1}    1.37{col 46}{space 3}0.172{col 54}{space 4}-209.5657{col 67}{space 3} 1173.598
{txt}        /d10 {c |}{col 14}{res}{space 2}-188.6473{col 26}{space 2} 144.4518{col 37}{space 1}   -1.31{col 46}{space 3}0.192{col 54}{space 4}-471.9221{col 67}{space 3}  94.6275
{txt}        /d11 {c |}{col 14}{res}{space 2} 263.9685{col 26}{space 2} 196.2936{col 37}{space 1}    1.34{col 46}{space 3}0.179{col 54}{space 4}-120.9698{col 67}{space 3} 648.9068
{txt}        /d12 {c |}{col 14}{res}{space 2} 462.7546{col 26}{space 2} 339.1135{col 37}{space 1}    1.36{col 46}{space 3}0.173{col 54}{space 4}-202.2585{col 67}{space 3} 1127.768
{txt}        /d13 {c |}{col 14}{res}{space 2} 200.2746{col 26}{space 2} 188.2397{col 37}{space 1}    1.06{col 46}{space 3}0.287{col 54}{space 4}-168.8697{col 67}{space 3} 569.4189
{txt}        /d14 {c |}{col 14}{res}{space 2}-596.7022{col 26}{space 2} 440.8025{col 37}{space 1}   -1.35{col 46}{space 3}0.176{col 54}{space 4}-1461.131{col 67}{space 3} 267.7263
{txt}        /d15 {c |}{col 14}{res}{space 2}-387.9507{col 26}{space 2} 317.0861{col 37}{space 1}   -1.22{col 46}{space 3}0.221{col 54}{space 4}-1009.767{col 67}{space 3} 233.8657
{txt}        /d16 {c |}{col 14}{res}{space 2} -273.715{col 26}{space 2} 201.0488{col 37}{space 1}   -1.36{col 46}{space 3}0.174{col 54}{space 4}-667.9784{col 67}{space 3} 120.5485
{txt}        /d17 {c |}{col 14}{res}{space 2}-55.78525{col 26}{space 2} 84.17762{col 37}{space 1}   -0.66{col 46}{space 3}0.508{col 54}{space 4}-220.8604{col 67}{space 3} 109.2899
{txt}        /d18 {c |}{col 14}{res}{space 2} 343.3656{col 26}{space 2} 258.3401{col 37}{space 1}    1.33{col 46}{space 3}0.184{col 54}{space 4} -163.248{col 67}{space 3} 849.9792
{txt}        /d19 {c |}{col 14}{res}{space 2} 157.8747{col 26}{space 2} 200.1383{col 37}{space 1}    0.79{col 46}{space 3}0.430{col 54}{space 4}-234.6033{col 67}{space 3} 550.3526
{txt}        /d21 {c |}{col 14}{res}{space 2}-1.881119{col 26}{space 2} .6894874{col 37}{space 1}   -2.73{col 46}{space 3}0.006{col 54}{space 4}-3.233227{col 67}{space 3}-.5290107
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. nl(diffeight=({c -(}d8=0{c )-}*abspart*surprise+{c -(}d9=0{c )-}*abspart*surprise*supportdummy+{c -(}d10=0{c )-}+{c -(}d11=0{c )-}*supportdummy+{c -(}d12=0{c )-}*abspart+/*
> */{c -(}d13=0{c )-}*surprise+{c -(}d14=0{c )-}*supportdummy*abspart+{c -(}d15=0{c )-}*supportdummy*surprise+{c -(}d16=0{c )-}*abspart^2+{c -(}d17=0{c )-}*surprise^2/*
> */+{c -(}d18=0{c )-}*abspart^2*supportdummy+{c -(}d19=0{c )-}*surprise^2*supportdummy)*exp({c -(}d21=0{c )-}*timeoverall)), cluster(case_id)
{txt}(obs = 6067)

Iteration 0:  residual SS = {res}  1515810
{txt}Iteration 1:  residual SS = {res}  1507841
{txt}Iteration 2:  residual SS = {res}  1502312
{txt}Iteration 3:  residual SS = {res}  1497861
{txt}Iteration 4:  residual SS = {res}  1494257
{txt}Iteration 5:  residual SS = {res}  1491322
{txt}Iteration 6:  residual SS = {res}  1488972
{txt}Iteration 7:  residual SS = {res}  1487293
{txt}Iteration 8:  residual SS = {res}  1486329
{txt}Iteration 9:  residual SS = {res}  1485893
{txt}Iteration 10:  residual SS = {res}  1485738
{txt}Iteration 11:  residual SS = {res}  1485693
{txt}Iteration 12:  residual SS = {res}  1485683
{txt}Iteration 13:  residual SS = {res}  1485680
{txt}Iteration 14:  residual SS = {res}  1485680
{txt}Iteration 15:  residual SS = {res}  1485679
{txt}Iteration 16:  residual SS = {res}  1485679
{txt}Iteration 17:  residual SS = {res}  1485679
{txt}Iteration 18:  residual SS = {res}  1485679
{txt}Iteration 19:  residual SS = {res}  1485679
{txt}Iteration 20:  residual SS = {res}  1485679
{txt}Iteration 21:  residual SS = {res}  1485679
{txt}Iteration 22:  residual SS = {res}  1485679
{txt}Iteration 23:  residual SS = {res}  1485679
{txt}Iteration 24:  residual SS = {res}  1485679
{txt}Iteration 25:  residual SS = {res}  1485679

{txt}Nonlinear regression{col 54}Number of obs = {res}     6067
{txt}{col 54}R-squared     = {res}   0.0508
{txt}{col 54}Adj R-squared = {res}   0.0504
{txt}{col 54}Root MSE      = {res} 15.66539
{txt}{col 54}Res. dev.     = {res} 50590.53

{txt}{ralign 78:(Std. Err. adjusted for {res:2220} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   diffeight{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d8 {c |}{col 14}{res}{space 2}-160.0171{col 26}{space 2} 67.29919{col 37}{space 1}   -2.38{col 46}{space 3}0.018{col 54}{space 4}-291.9931{col 67}{space 3}-28.04113
{txt}         /d9 {c |}{col 14}{res}{space 2}  250.639{col 26}{space 2}  98.9297{col 37}{space 1}    2.53{col 46}{space 3}0.011{col 54}{space 4} 56.63454{col 67}{space 3} 444.6435
{txt}        /d10 {c |}{col 14}{res}{space 2}-98.02247{col 26}{space 2} 45.33021{col 37}{space 1}   -2.16{col 46}{space 3}0.031{col 54}{space 4}-186.9165{col 67}{space 3}-9.128397
{txt}        /d11 {c |}{col 14}{res}{space 2} 133.2992{col 26}{space 2}  57.3594{col 37}{space 1}    2.32{col 46}{space 3}0.020{col 54}{space 4} 20.81549{col 67}{space 3} 245.7829
{txt}        /d12 {c |}{col 14}{res}{space 2} 246.1224{col 26}{space 2} 98.97679{col 37}{space 1}    2.49{col 46}{space 3}0.013{col 54}{space 4} 52.02559{col 67}{space 3} 440.2192
{txt}        /d13 {c |}{col 14}{res}{space 2} 98.31212{col 26}{space 2} 74.31935{col 37}{space 1}    1.32{col 46}{space 3}0.186{col 54}{space 4}-47.43062{col 67}{space 3} 244.0549
{txt}        /d14 {c |}{col 14}{res}{space 2}-294.1605{col 26}{space 2} 126.2657{col 37}{space 1}   -2.33{col 46}{space 3}0.020{col 54}{space 4}-541.7719{col 67}{space 3}-46.54919
{txt}        /d15 {c |}{col 14}{res}{space 2}-198.5744{col 26}{space 2} 109.9886{col 37}{space 1}   -1.81{col 46}{space 3}0.071{col 54}{space 4}-414.2659{col 67}{space 3} 17.11702
{txt}        /d16 {c |}{col 14}{res}{space 2}-146.8686{col 26}{space 2}  60.4815{col 37}{space 1}   -2.43{col 46}{space 3}0.015{col 54}{space 4}-265.4748{col 67}{space 3}-28.26231
{txt}        /d17 {c |}{col 14}{res}{space 2}-22.73636{col 26}{space 2} 40.63847{col 37}{space 1}   -0.56{col 46}{space 3}0.576{col 54}{space 4}-102.4298{col 67}{space 3} 56.95705
{txt}        /d18 {c |}{col 14}{res}{space 2} 174.4488{col 26}{space 2} 79.60212{col 37}{space 1}    2.19{col 46}{space 3}0.029{col 54}{space 4} 18.34634{col 67}{space 3} 330.5512
{txt}        /d19 {c |}{col 14}{res}{space 2} 84.67823{col 26}{space 2} 94.88297{col 37}{space 1}    0.89{col 46}{space 3}0.372{col 54}{space 4}-101.3905{col 67}{space 3} 270.7469
{txt}        /d21 {c |}{col 14}{res}{space 2}-1.255593{col 26}{space 2} .2991174{col 37}{space 1}   -4.20{col 46}{space 3}0.000{col 54}{space 4}-1.842172{col 67}{space 3}-.6690133
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
.         ///RA4///
> 
. nl(diffeight={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy+({c -(}d8=0{c )-}*abspart*surprise+{c -(}d9=0{c )-}*abspart*surprise*supportdummy)*exp({c -(}d20=0{c )-}+{c -(}d21=0{c )-}*/*
> */timeoverall+{c -(}d22=0{c )-}*timeoverall*supportdummy+{c -(}d23=0{c )-}*timeoverall*abspart+{c -(}d24=0{c )-}*timeoverall*surprise+{c -(}d25=0{c )-}*timeoverall*/*
> */abspart*supportdummy+{c -(}d26=0{c )-}*timeoverall*surprise*supportdummy+{c -(}d27=0{c )-}*timeoverall*surprise*abspart/*
> */+{c -(}d28=0{c )-}*timeoverall*surprise*abspart*supportdummy)), cluster(case_id)
{txt}(obs = 6067)

Iteration 0:  residual SS = {res}  1528066
{txt}Iteration 1:  residual SS = {res}  1527924
{txt}Iteration 2:  residual SS = {res}  1516804
{txt}Iteration 3:  residual SS = {res}  1507898
{txt}Iteration 4:  residual SS = {res}  1494372
{txt}Iteration 5:  residual SS = {res}  1484844
{txt}Iteration 6:  residual SS = {res}  1482481
{txt}Iteration 7:  residual SS = {res}  1481710
{txt}Iteration 8:  residual SS = {res}  1481238
{txt}Iteration 9:  residual SS = {res}  1481105
{txt}Iteration 10:  residual SS = {res}  1480953
{txt}Iteration 11:  residual SS = {res}  1480919
{txt}Iteration 12:  residual SS = {res}  1480917
{txt}Iteration 13:  residual SS = {res}  1480913
{txt}Iteration 14:  residual SS = {res}  1480898
{txt}Iteration 15:  residual SS = {res}  1480895
{txt}Iteration 16:  residual SS = {res}  1480894
{txt}Iteration 17:  residual SS = {res}  1480894
{txt}Iteration 18:  residual SS = {res}  1480894
{txt}Iteration 19:  residual SS = {res}  1480894
{txt}Iteration 20:  residual SS = {res}  1480893
{txt}Iteration 21:  residual SS = {res}  1480893
{txt}Iteration 22:  residual SS = {res}  1480893
{txt}Iteration 23:  residual SS = {res}  1480893
{txt}Iteration 24:  residual SS = {res}  1480893
{txt}Iteration 25:  residual SS = {res}  1480893
{txt}Iteration 26:  residual SS = {res}  1480893
{txt}Iteration 27:  residual SS = {res}  1480893
{txt}Iteration 28:  residual SS = {res}  1480893
{txt}Iteration 29:  residual SS = {res}  1480893
{txt}Iteration 30:  residual SS = {res}  1480893

{txt}Nonlinear regression{col 54}Number of obs = {res}     6067
{txt}{col 54}R-squared     = {res}   0.0533
{txt}{col 54}Adj R-squared = {res}   0.0529
{txt}{col 54}Root MSE      = {res} 15.63885
{txt}{col 54}Res. dev.     = {res} 50570.95

{txt}{ralign 78:(Std. Err. adjusted for {res:2220} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   diffeight{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2} .1275588{col 26}{space 2} .4475858{col 37}{space 1}    0.28{col 46}{space 3}0.776{col 54}{space 4} -.750172{col 67}{space 3}  1.00529
{txt}         /d1 {c |}{col 14}{res}{space 2} 1.097041{col 26}{space 2}  .724762{col 37}{space 1}    1.51{col 46}{space 3}0.130{col 54}{space 4}-.3242413{col 67}{space 3} 2.518324
{txt}         /d8 {c |}{col 14}{res}{space 2} -8.93846{col 26}{space 2} .3353442{col 37}{space 1}  -26.65{col 46}{space 3}0.000{col 54}{space 4}-9.596081{col 67}{space 3}-8.280838
{txt}         /d9 {c |}{col 14}{res}{space 2} 9.272355{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}        /d20 {c |}{col 14}{res}{space 2} 2.909948{col 26}{space 2} .8747615{col 37}{space 1}    3.33{col 46}{space 3}0.001{col 54}{space 4} 1.194512{col 67}{space 3} 4.625385
{txt}        /d21 {c |}{col 14}{res}{space 2}-.2856923{col 26}{space 2} 1.816325{col 37}{space 1}   -0.16{col 46}{space 3}0.875{col 54}{space 4}-3.847568{col 67}{space 3} 3.276183
{txt}        /d22 {c |}{col 14}{res}{space 2}-1.281423{col 26}{space 2}  3.53433{col 37}{space 1}   -0.36{col 46}{space 3}0.717{col 54}{space 4}-8.212362{col 67}{space 3} 5.649516
{txt}        /d23 {c |}{col 14}{res}{space 2}-2.119845{col 26}{space 2} 1.692848{col 37}{space 1}   -1.25{col 46}{space 3}0.211{col 54}{space 4}-5.439577{col 67}{space 3} 1.199887
{txt}        /d24 {c |}{col 14}{res}{space 2}-4.497264{col 26}{space 2} 2.660399{col 37}{space 1}   -1.69{col 46}{space 3}0.091{col 54}{space 4}-9.714396{col 67}{space 3} .7198684
{txt}        /d25 {c |}{col 14}{res}{space 2} 3.571235{col 26}{space 2} 3.455809{col 37}{space 1}    1.03{col 46}{space 3}0.302{col 54}{space 4}-3.205722{col 67}{space 3} 10.34819
{txt}        /d26 {c |}{col 14}{res}{space 2} 6.485278{col 26}{space 2} 4.541711{col 37}{space 1}    1.43{col 46}{space 3}0.153{col 54}{space 4} -2.42117{col 67}{space 3} 15.39173
{txt}        /d27 {c |}{col 14}{res}{space 2} 5.035971{col 26}{space 2} 2.793765{col 37}{space 1}    1.80{col 46}{space 3}0.072{col 54}{space 4}-.4426967{col 67}{space 3} 10.51464
{txt}        /d28 {c |}{col 14}{res}{space 2}-6.764442{col 26}{space 2}  4.60256{col 37}{space 1}   -1.47{col 46}{space 3}0.142{col 54}{space 4}-15.79022{col 67}{space 3} 2.261332
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
. nl(diffeight={c -(}d2=0{c )-}*abspart+{c -(}d4=0{c )-}*supportdummy*abspart+({c -(}d8=0{c )-}*abspart*surprise+{c -(}d9=0{c )-}*abspart*surprise*supportdummy)*/*
> */exp({c -(}d20=0{c )-}+{c -(}d21=0{c )-}*timeoverall+{c -(}d22=0{c )-}*timeoverall*supportdummy+{c -(}d23=0{c )-}*timeoverall*abspart+{c -(}d24=0{c )-}*timeoverall*/*
> */surprise+{c -(}d25=0{c )-}*timeoverall*abspart*supportdummy+{c -(}d26=0{c )-}*timeoverall*surprise*supportdummy+{c -(}d27=0{c )-}*timeoverall*/*
> */surprise*abspart+{c -(}d28=0{c )-}*timeoverall*surprise*abspart*supportdummy)), cluster(case_id)
{txt}(obs = 6067)

Iteration 0:  residual SS = {res}  1527681
{txt}Iteration 1:  residual SS = {res}  1527673
{txt}Iteration 2:  residual SS = {res}  1514730
{txt}Iteration 3:  residual SS = {res}  1508306
{txt}Iteration 4:  residual SS = {res}  1494824
{txt}Iteration 5:  residual SS = {res}  1488161
{txt}Iteration 6:  residual SS = {res}  1483311
{txt}Iteration 7:  residual SS = {res}  1482433
{txt}Iteration 8:  residual SS = {res}  1481358
{txt}Iteration 9:  residual SS = {res}  1481216
{txt}Iteration 10:  residual SS = {res}  1480725
{txt}Iteration 11:  residual SS = {res}  1480679
{txt}Iteration 12:  residual SS = {res}  1480558
{txt}Iteration 13:  residual SS = {res}  1480499
{txt}Iteration 14:  residual SS = {res}  1480472
{txt}Iteration 15:  residual SS = {res}  1480465
{txt}Iteration 16:  residual SS = {res}  1480463
{txt}Iteration 17:  residual SS = {res}  1480462
{txt}Iteration 18:  residual SS = {res}  1480461
{txt}Iteration 19:  residual SS = {res}  1480461
{txt}Iteration 20:  residual SS = {res}  1480461
{txt}Iteration 21:  residual SS = {res}  1480461
{txt}Iteration 22:  residual SS = {res}  1480461
{txt}Iteration 23:  residual SS = {res}  1480461
{txt}Iteration 24:  residual SS = {res}  1480461
{txt}Iteration 25:  residual SS = {res}  1480461
{txt}Iteration 26:  residual SS = {res}  1480461
{txt}Iteration 27:  residual SS = {res}  1480461
{txt}Iteration 28:  residual SS = {res}  1480461
{txt}Iteration 29:  residual SS = {res}  1480461
{txt}Iteration 30:  residual SS = {res}  1480461
{txt}Iteration 31:  residual SS = {res}  1480461
{txt}Iteration 32:  residual SS = {res}  1480461
{txt}Iteration 33:  residual SS = {res}  1480461
{txt}Iteration 34:  residual SS = {res}  1480461

{txt}Nonlinear regression{col 54}Number of obs = {res}     6067
{txt}{col 54}R-squared     = {res}   0.0541
{txt}{col 54}Adj R-squared = {res}   0.0537
{txt}{col 54}Root MSE      = {res} 15.63656
{txt}{col 54}Res. dev.     = {res} 50569.18

{txt}{ralign 78:(Std. Err. adjusted for {res:2220} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   diffeight{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d2 {c |}{col 14}{res}{space 2}-.1578176{col 26}{space 2} .6051335{col 37}{space 1}   -0.26{col 46}{space 3}0.794{col 54}{space 4}-1.344505{col 67}{space 3}  1.02887
{txt}         /d4 {c |}{col 14}{res}{space 2} 2.028022{col 26}{space 2} .9790929{col 37}{space 1}    2.07{col 46}{space 3}0.038{col 54}{space 4} .1079877{col 67}{space 3} 3.948056
{txt}         /d8 {c |}{col 14}{res}{space 2}-12.45557{col 26}{space 2} .3816396{col 37}{space 1}  -32.64{col 46}{space 3}0.000{col 54}{space 4}-13.20398{col 67}{space 3}-11.70716
{txt}         /d9 {c |}{col 14}{res}{space 2} 12.71609{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}        /d20 {c |}{col 14}{res}{space 2} 2.877836{col 26}{space 2} 1.268185{col 37}{space 1}    2.27{col 46}{space 3}0.023{col 54}{space 4} .3908819{col 67}{space 3}  5.36479
{txt}        /d21 {c |}{col 14}{res}{space 2} -.626953{col 26}{space 2} 2.095243{col 37}{space 1}   -0.30{col 46}{space 3}0.765{col 54}{space 4}-4.735795{col 67}{space 3} 3.481889
{txt}        /d22 {c |}{col 14}{res}{space 2}-.6362913{col 26}{space 2} 3.522532{col 37}{space 1}   -0.18{col 46}{space 3}0.857{col 54}{space 4}-7.544094{col 67}{space 3} 6.271512
{txt}        /d23 {c |}{col 14}{res}{space 2}-2.162206{col 26}{space 2} 1.786401{col 37}{space 1}   -1.21{col 46}{space 3}0.226{col 54}{space 4}-5.665399{col 67}{space 3} 1.340987
{txt}        /d24 {c |}{col 14}{res}{space 2}-4.601163{col 26}{space 2} 2.810234{col 37}{space 1}   -1.64{col 46}{space 3}0.102{col 54}{space 4}-10.11213{col 67}{space 3}    .9098
{txt}        /d25 {c |}{col 14}{res}{space 2}  3.30057{col 26}{space 2} 3.335884{col 37}{space 1}    0.99{col 46}{space 3}0.323{col 54}{space 4} -3.24121{col 67}{space 3}  9.84235
{txt}        /d26 {c |}{col 14}{res}{space 2} 6.232354{col 26}{space 2} 4.440752{col 37}{space 1}    1.40{col 46}{space 3}0.161{col 54}{space 4}-2.476109{col 67}{space 3} 14.94082
{txt}        /d27 {c |}{col 14}{res}{space 2} 5.226703{col 26}{space 2}  2.94621{col 37}{space 1}    1.77{col 46}{space 3}0.076{col 54}{space 4}-.5509144{col 67}{space 3} 11.00432
{txt}        /d28 {c |}{col 14}{res}{space 2}-6.568801{col 26}{space 2} 4.516629{col 37}{space 1}   -1.45{col 46}{space 3}0.146{col 54}{space 4}-15.42606{col 67}{space 3} 2.288459
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. nl(diffeight={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy+{c -(}d2=0{c )-}*abspart+{c -(}d4=0{c )-}*supportdummy*abspart+({c -(}d8=0{c )-}*abspart*surprise+{c -(}d9=0{c )-}*/*
> */abspart*surprise*supportdummy)*exp({c -(}d20=0{c )-}+{c -(}d21=0{c )-}*timeoverall+{c -(}d22=0{c )-}*timeoverall*supportdummy+{c -(}d23=0{c )-}*timeoverall*/*
> */abspart+{c -(}d24=0{c )-}*timeoverall*surprise+{c -(}d25=0{c )-}*timeoverall*abspart*supportdummy+{c -(}d26=0{c )-}*timeoverall*surprise*/*
> */supportdummy+{c -(}d27=0{c )-}*timeoverall*surprise*abspart+{c -(}d28=0{c )-}*timeoverall*surprise*abspart*supportdummy)), cluster(case_id)
{txt}(obs = 6067)

Iteration 0:  residual SS = {res}  1526489
{txt}Iteration 1:  residual SS = {res}  1526391
{txt}Iteration 2:  residual SS = {res}  1513594
{txt}Iteration 3:  residual SS = {res}  1507487
{txt}Iteration 4:  residual SS = {res}  1493512
{txt}Iteration 5:  residual SS = {res}  1486043
{txt}Iteration 6:  residual SS = {res}  1482802
{txt}Iteration 7:  residual SS = {res}  1481042
{txt}Iteration 8:  residual SS = {res}  1480318
{txt}Iteration 9:  residual SS = {res}  1480108
{txt}Iteration 10:  residual SS = {res}  1480017
{txt}Iteration 11:  residual SS = {res}  1479967
{txt}Iteration 12:  residual SS = {res}  1479958
{txt}Iteration 13:  residual SS = {res}  1479938
{txt}Iteration 14:  residual SS = {res}  1479936
{txt}Iteration 15:  residual SS = {res}  1479931
{txt}Iteration 16:  residual SS = {res}  1479930
{txt}Iteration 17:  residual SS = {res}  1479928
{txt}Iteration 18:  residual SS = {res}  1479928
{txt}Iteration 19:  residual SS = {res}  1479927
{txt}Iteration 20:  residual SS = {res}  1479927
{txt}Iteration 21:  residual SS = {res}  1479927
{txt}Iteration 22:  residual SS = {res}  1479927
{txt}Iteration 23:  residual SS = {res}  1479927
{txt}Iteration 24:  residual SS = {res}  1479927
{txt}Iteration 25:  residual SS = {res}  1479927
{txt}Iteration 26:  residual SS = {res}  1479927
{txt}Iteration 27:  residual SS = {res}  1479927
{txt}Iteration 28:  residual SS = {res}  1479927
{txt}Iteration 29:  residual SS = {res}  1479927
{txt}Iteration 30:  residual SS = {res}  1479927
{txt}Iteration 31:  residual SS = {res}  1479927

{txt}Nonlinear regression{col 54}Number of obs = {res}     6067
{txt}{col 54}R-squared     = {res}   0.0539
{txt}{col 54}Adj R-squared = {res}   0.0535
{txt}{col 54}Root MSE      = {res} 15.63633
{txt}{col 54}Res. dev.     = {res} 50566.99

{txt}{ralign 78:(Std. Err. adjusted for {res:2220} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   diffeight{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2} 1.445287{col 26}{space 2}  1.03971{col 37}{space 1}    1.39{col 46}{space 3}0.165{col 54}{space 4}-.5936186{col 67}{space 3} 3.484193
{txt}         /d1 {c |}{col 14}{res}{space 2}-1.199402{col 26}{space 2} 1.674408{col 37}{space 1}   -0.72{col 46}{space 3}0.474{col 54}{space 4}-4.482972{col 67}{space 3} 2.084168
{txt}         /d2 {c |}{col 14}{res}{space 2}-1.957208{col 26}{space 2} 1.409227{col 37}{space 1}   -1.39{col 46}{space 3}0.165{col 54}{space 4}-4.720749{col 67}{space 3} .8063339
{txt}         /d4 {c |}{col 14}{res}{space 2} 3.518024{col 26}{space 2} 2.230966{col 37}{space 1}    1.58{col 46}{space 3}0.115{col 54}{space 4}-.8569758{col 67}{space 3} 7.893023
{txt}         /d8 {c |}{col 14}{res}{space 2}-7.457634{col 26}{space 2} .2264129{col 37}{space 1}  -32.94{col 46}{space 3}0.000{col 54}{space 4}-7.901637{col 67}{space 3} -7.01363
{txt}         /d9 {c |}{col 14}{res}{space 2} 7.583559{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}        /d20 {c |}{col 14}{res}{space 2} 3.627944{col 26}{space 2} 1.641933{col 37}{space 1}    2.21{col 46}{space 3}0.027{col 54}{space 4} .4080595{col 67}{space 3} 6.847829
{txt}        /d21 {c |}{col 14}{res}{space 2}-.1819598{col 26}{space 2} 2.154005{col 37}{space 1}   -0.08{col 46}{space 3}0.933{col 54}{space 4}-4.406037{col 67}{space 3} 4.042117
{txt}        /d22 {c |}{col 14}{res}{space 2} -1.16175{col 26}{space 2}  4.06219{col 37}{space 1}   -0.29{col 46}{space 3}0.775{col 54}{space 4}-9.127842{col 67}{space 3} 6.804342
{txt}        /d23 {c |}{col 14}{res}{space 2}  -2.9836{col 26}{space 2} 1.527835{col 37}{space 1}   -1.95{col 46}{space 3}0.051{col 54}{space 4}-5.979736{col 67}{space 3} .0125365
{txt}        /d24 {c |}{col 14}{res}{space 2}-4.855728{col 26}{space 2} 2.347505{col 37}{space 1}   -2.07{col 46}{space 3}0.039{col 54}{space 4}-9.459265{col 67}{space 3}-.2521922
{txt}        /d25 {c |}{col 14}{res}{space 2} 4.203554{col 26}{space 2} 3.750405{col 37}{space 1}    1.12{col 46}{space 3}0.262{col 54}{space 4}-3.151117{col 67}{space 3} 11.55823
{txt}        /d26 {c |}{col 14}{res}{space 2} 6.583411{col 26}{space 2} 4.792154{col 37}{space 1}    1.37{col 46}{space 3}0.170{col 54}{space 4}-2.814164{col 67}{space 3} 15.98099
{txt}        /d27 {c |}{col 14}{res}{space 2}  5.61631{col 26}{space 2} 2.506108{col 37}{space 1}    2.24{col 46}{space 3}0.025{col 54}{space 4}  .701748{col 67}{space 3} 10.53087
{txt}        /d28 {c |}{col 14}{res}{space 2} -7.05766{col 26}{space 2} 4.859865{col 37}{space 1}   -1.45{col 46}{space 3}0.147{col 54}{space 4}-16.58802{col 67}{space 3} 2.472698
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
. nl(diffeight=({c -(}d8=0{c )-}*abspart*surprise+{c -(}d9=0{c )-}*abspart*surprise*supportdummy)*exp({c -(}d20=0{c )-}+{c -(}d21=0{c )-}*timeoverall+{c -(}d22=0{c )-}*/*
> */timeoverall*supportdummy+{c -(}d23=0{c )-}*timeoverall*abspart+{c -(}d24=0{c )-}*timeoverall*surprise+{c -(}d25=0{c )-}*timeoverall*abspart*supportdummy/*
> */+{c -(}d26=0{c )-}*timeoverall*surprise*supportdummy+{c -(}d27=0{c )-}*timeoverall*surprise*abspart+{c -(}d28=0{c )-}*timeoverall*surprise*abspart*supportdummy)), cluster(case_id)
{txt}(obs = 6067)

Iteration 0:  residual SS = {res}  1530506
{txt}Iteration 1:  residual SS = {res}  1530501
{txt}Iteration 2:  residual SS = {res}  1510998
{txt}Iteration 3:  residual SS = {res}  1494752
{txt}Iteration 4:  residual SS = {res}  1490097
{txt}Iteration 5:  residual SS = {res}  1485956
{txt}Iteration 6:  residual SS = {res}  1484370
{txt}Iteration 7:  residual SS = {res}  1483817
{txt}Iteration 8:  residual SS = {res}  1483625
{txt}Iteration 9:  residual SS = {res}  1483567
{txt}Iteration 10:  residual SS = {res}  1483552
{txt}Iteration 11:  residual SS = {res}  1483549
{txt}Iteration 12:  residual SS = {res}  1483548
{txt}Iteration 13:  residual SS = {res}  1483548
{txt}Iteration 14:  residual SS = {res}  1483548
{txt}Iteration 15:  residual SS = {res}  1483548
{txt}Iteration 16:  residual SS = {res}  1483548
{txt}Iteration 17:  residual SS = {res}  1483548
{txt}Iteration 18:  residual SS = {res}  1483548
{txt}Iteration 19:  residual SS = {res}  1483548

{txt}Nonlinear regression{col 54}Number of obs = {res}     6067
{txt}{col 54}R-squared     = {res}   0.0521
{txt}{col 54}Adj R-squared = {res}   0.0517
{txt}{col 54}Root MSE      = {res} 15.65028
{txt}{col 54}Res. dev.     = {res} 50581.82

{txt}{ralign 78:(Std. Err. adjusted for {res:2220} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   diffeight{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d8 {c |}{col 14}{res}{space 2}-11.80598{col 26}{space 2} .6356394{col 37}{space 1}  -18.57{col 46}{space 3}0.000{col 54}{space 4}-13.05249{col 67}{space 3}-10.55947
{txt}         /d9 {c |}{col 14}{res}{space 2} 12.42638{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}        /d20 {c |}{col 14}{res}{space 2}  2.76066{col 26}{space 2} .9945481{col 37}{space 1}    2.78{col 46}{space 3}0.006{col 54}{space 4} .8103176{col 67}{space 3} 4.711002
{txt}        /d21 {c |}{col 14}{res}{space 2}-.4683222{col 26}{space 2} 1.923728{col 37}{space 1}   -0.24{col 46}{space 3}0.808{col 54}{space 4}-4.240817{col 67}{space 3} 3.304172
{txt}        /d22 {c |}{col 14}{res}{space 2}-.3215162{col 26}{space 2} 2.097595{col 37}{space 1}   -0.15{col 46}{space 3}0.878{col 54}{space 4} -4.43497{col 67}{space 3} 3.791938
{txt}        /d23 {c |}{col 14}{res}{space 2}-2.102235{col 26}{space 2} 1.751077{col 37}{space 1}   -1.20{col 46}{space 3}0.230{col 54}{space 4}-5.536157{col 67}{space 3} 1.331687
{txt}        /d24 {c |}{col 14}{res}{space 2}-4.534913{col 26}{space 2} 2.756426{col 37}{space 1}   -1.65{col 46}{space 3}0.100{col 54}{space 4}-9.940357{col 67}{space 3}   .87053
{txt}        /d25 {c |}{col 14}{res}{space 2} 2.793166{col 26}{space 2} 1.938826{col 37}{space 1}    1.44{col 46}{space 3}0.150{col 54}{space 4}-1.008936{col 67}{space 3} 6.595268
{txt}        /d26 {c |}{col 14}{res}{space 2} 5.563986{col 26}{space 2}  2.93189{col 37}{space 1}    1.90{col 46}{space 3}0.058{col 54}{space 4}-.1855489{col 67}{space 3} 11.31352
{txt}        /d27 {c |}{col 14}{res}{space 2} 5.111401{col 26}{space 2} 2.890065{col 37}{space 1}    1.77{col 46}{space 3}0.077{col 54}{space 4}-.5561146{col 67}{space 3} 10.77892
{txt}        /d28 {c |}{col 14}{res}{space 2}-5.935766{col 26}{space 2} 3.060029{col 37}{space 1}   -1.94{col 46}{space 3}0.053{col 54}{space 4}-11.93659{col 67}{space 3} .0650537
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. 
. 
. 
. 
{txt}end of do-file

{com}. do "/Users/Young/Dropbox/Collin/Project_Code/Do_Files/robustProbvoteA.do"
{txt}
{com}. ******************************************************************
. * This do-file 
. *       reads in the APL 08 and 12 Election Data
. *       Runs Robustness Regressions 08 and 12 Data
. *       Created: 4/11/2015, by Collin Raymond and Yang Lu
. *       This version:
. ******************************************************************
. 
. /*
> THIS FILE CREATES PROCESSED FILES FROM RAW FILES.
> EDIT THE cd and globals BEFORE RUNNING THIS FILE
> */
. 
. 
. cd "/Users/Young/Dropbox/Collin/Project_Code"
{res}/Users/Young/Dropbox/Collin/Project_Code
{txt}
{com}. 
. global raw_data     "/Users/Young/Dropbox/Collin/Project_Code/Raw_Data"
{txt}
{com}. global data_pro         "/Users/Young/Dropbox/Collin/Project_Code/Output_Data"
{txt}
{com}. 
. set more off 
{txt}
{com}. 
. use "$data_pro/combined0812", clear
{txt}
{com}. 
. ///Robustness votefavprob Part A///
> 
. ///2008///
> 
.         ///RA1-RA3///
>                 
.         preserve
{txt}
{com}. 
.         drop if diffeight2008==.
{txt}(11376 observations deleted)

{com}.         drop if supportdummy2008==.
{txt}(562 observations deleted)

{com}.         drop if votefavprob2008==.
{txt}(0 observations deleted)

{com}.         drop if surprise39==.
{txt}(1 observation deleted)

{com}.         drop if time2008==.
{txt}(8 observations deleted)

{com}. 
. 
. //nl(diffeight2008={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2008+{c -(}d2=0{c )-}*votefavprob2008+{c -(}d3=0{c )-}*surprise39+{c -(}d4=0{c )-}*supportdummy2008*votefavprob2008+/*
. //*/{c -(}d5=0{c )-}*supportdummy2008*surprise39+{c -(}d6=0{c )-}*votefavprob2008*surprise39+{c -(}d7=0{c )-}*/*
. //*/votefavprob2008*surprise39*supportdummy2008+({c -(}d8=0{c )-}*votefavprob2008*surprise39+{c -(}d9=0{c )-}*votefavprob2008*/*
. //*/surprise39*supportdummy2008+{c -(}d10=0{c )-}+{c -(}d11=0{c )-}*supportdummy2008+{c -(}d12=0{c )-}*votefavprob2008+{c -(}d13=0{c )-}*/*
. //*/surprise39+{c -(}d14=0{c )-}*supportdummy2008*votefavprob2008+{c -(}d15=0{c )-}*supportdummy2008*surprise39+{c -(}d16=0{c )-}*votefavprob2008^2/*
. //*/+{c -(}d17=0{c )-}*surprise39^2+{c -(}d18=0{c )-}*votefavprob2008^2*supportdummy2008+{c -(}d19=0{c )-}*surprise39^2*supportdummy2008)*exp({c -(}d20=0{c )-}/*
. //*/+{c -(}d21=0{c )-}*time2008+{c -(}d22=0{c )-}*time2008*supportdummy2008+{c -(}d23=0{c )-}*time2008*votefavprob2008+{c -(}d24=0{c )-}*time2008*surprise39/*
. //*/+{c -(}d25=0{c )-}*time2008*votefavprob2008*supportdummy2008+{c -(}d26=0{c )-}*time2008*surprise39*supportdummy2008+{c -(}d27=0{c )-}*time2008*/*
. //*/surprise39*votefavprob2008+{c -(}d28=0{c )-}*time2008*surprise39*votefavprob2008*supportdummy2008)), cluster(case_id)
. 
. //nl(diffeight2008={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2008+{c -(}d2=0{c )-}*votefavprob2008+{c -(}d3=0{c )-}*surprise39+{c -(}d4=0{c )-}*supportdummy2008*abspa/*
. //*/rt2008+{c -(}d5=0{c )-}*supportdummy2008*surprise39+{c -(}d6=0{c )-}*votefavprob2008*surprise39+{c -(}d7=0{c )-}*votefavprob2008*surprise39*supportdummy/*
. //*/2008+({c -(}d8=0{c )-}*votefavprob2008*surprise39+{c -(}d9=0{c )-}*votefavprob2008*surprise39*supportdummy2008)*exp({c -(}d21=0{c )-}*adjtime2008)), clu/*
. //*/ster(case_id)
. 
. //nl(diffeight2008={c -(}d0=2.157388{c )-}+{c -(}d1=-2.793502{c )-}*supportdummy2008+({c -(}d8=-226{c )-}*votefavprob2008*surprise39+{c -(}d9=350{c )-}*votefavprob2008*/*
. //*/surprise39*supportdummy2008+{c -(}d10=-188{c )-}+{c -(}d11=222{c )-}*supportdummy2008+{c -(}d12=401{c )-}*votefavprob2008+{c -(}d13=230.896{c )-}*surprise39/*
. //*/+{c -(}d14=-421{c )-}*supportdummy2008*votefavprob2008+{c -(}d15=-376.212{c )-}*supportdummy2008*surprise39+{c -(}d16=-232{c )-}*votefavprob2008^2+{c -(}d17=-89.34898{c )-}*/*
. //*/surprise39^2+{c -(}d18=221{c )-}*votefavprob2008^2*supportdummy2008+{c -(}d19=194{c )-}*surprise39^2*supportdummy2008)*exp({c -(}d21=-1.3948{c )-}*time2008)), eps(0.001)
. 
. //nl(diffeight2008={c -(}d2=-2.121681{c )-}*votefavprob2008+{c -(}d4=5.177406{c )-}*supportdummy2008*votefavprob2008+({c -(}d8=-226{c )-}*votefavprob2008*surprise39+/*
. //*/{c -(}d9=350{c )-}*votefavprob2008*surprise39*supportdummy2008+{c -(}d10=-188{c )-}+{c -(}d11=222{c )-}*supportdummy2008+{c -(}d12=401{c )-}*votefavprob2008+{c -(}d13=230.896{c )-}*/*
. //*/surprise39+{c -(}d14=-421{c )-}*supportdummy2008*votefavprob2008+{c -(}d15=-376.212{c )-}*supportdummy2008*surprise39+{c -(}d16=-232{c )-}*votefavprob2008^2+{c -(}d17=-89.34898{c )-}*/*
. //*/surprise39^2+{c -(}d18=221{c )-}*votefavprob2008^2*supportdummy2008+{c -(}d19=194{c )-}*surprise39^2*supportdummy2008)*exp({c -(}d21=-1.3948{c )-}*time2008)), eps(0.001)
. 
. //nl(diffeight2008=({c -(}d8=-226{c )-}*votefavprob2008*surprise39+{c -(}d9=350{c )-}*votefavprob2008*surprise39*supportdummy2008+{c -(}d10=-188{c )-}+{c -(}d11=222{c )-}*supportdummy2008+/*
. //*/{c -(}d12=401{c )-}*votefavprob2008+{c -(}d13=230.896{c )-}*surprise39+{c -(}d14=-421{c )-}*supportdummy2008*votefavprob2008+{c -(}d15=-376.212{c )-}*supportdummy2008*surprise39+{c -(}d16=-232{c )-}*/*
. //*/votefavprob2008^2+{c -(}d17=-89.34898{c )-}*surprise39^2+{c -(}d18=221{c )-}*votefavprob2008^2*supportdummy2008+{c -(}d19=194{c )-}*surprise39^2*supportdummy2008)*exp({c -(}d21=-1.3948{c )-}*time2008)), eps(0.001)
. 
.         ///with Adjtime///
>         
.         restore
{txt}
{com}.         preserve
{txt}
{com}.         
.         drop if diffeight2008==.
{txt}(11376 observations deleted)

{com}.         drop if supportdummy2008==.
{txt}(562 observations deleted)

{com}.         drop if votefavprob2008==.
{txt}(0 observations deleted)

{com}.         drop if surprise39==.
{txt}(1 observation deleted)

{com}.         drop if adjtime2008==.
{txt}(8 observations deleted)

{com}.         
. nl(diffeight2008={c -(}d0=2.157388{c )-}+{c -(}d1=-2.793502{c )-}*supportdummy2008+({c -(}d8=-226{c )-}*votefavprob2008*surprise39+{c -(}d9=350{c )-}*votefavprob2008*/*
> */surprise39*supportdummy2008+{c -(}d10=-188{c )-}+{c -(}d11=222{c )-}*supportdummy2008+{c -(}d12=401{c )-}*votefavprob2008+{c -(}d13=230.896{c )-}*surprise39+{c -(}d14=-421{c )-}*/*
> */supportdummy2008*votefavprob2008+{c -(}d15=-376.212{c )-}*supportdummy2008*surprise39+{c -(}d16=-232{c )-}*votefavprob2008^2+{c -(}d17=-89.34898{c )-}*surprise39^2+/*
> */{c -(}d18=221{c )-}*votefavprob2008^2*supportdummy2008+{c -(}d19=194{c )-}*surprise39^2*supportdummy2008)*exp({c -(}d21=-1.3948{c )-}*adjtime2008)), cluster(case_id)
{txt}(obs = 961)

Iteration 0:  residual SS = {res} 197169.1
{txt}Iteration 1:  residual SS = {res} 196607.1
{txt}Iteration 2:  residual SS = {res} 196036.7
{txt}Iteration 3:  residual SS = {res} 196036.7
{txt}Iteration 4:  residual SS = {res} 195949.2
{txt}Iteration 5:  residual SS = {res} 195949.2

{txt}Nonlinear regression{col 54}Number of obs = {res}      961
{txt}{col 54}R-squared     = {res}   0.1186
{txt}{col 54}Adj R-squared = {res}   0.1177
{txt}{col 54}Root MSE      = {res} 14.38456
{txt}{col 54}Res. dev.     = {res} 7837.448

{txt}{ralign 78:(Std. Err. adjusted for {res:961} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2008{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2}-1.461039{col 26}{space 2} .8547019{col 37}{space 1}   -1.71{col 46}{space 3}0.088{col 54}{space 4}-3.138339{col 67}{space 3} .2162607
{txt}         /d1 {c |}{col 14}{res}{space 2}   2.3579{col 26}{space 2} 1.221511{col 37}{space 1}    1.93{col 46}{space 3}0.054{col 54}{space 4}-.0392408{col 67}{space 3} 4.755041
{txt}         /d8 {c |}{col 14}{res}{space 2}-.1125053{col 26}{space 2} .3201853{col 37}{space 1}   -0.35{col 46}{space 3}0.725{col 54}{space 4}-.7408492{col 67}{space 3} .5158386
{txt}         /d9 {c |}{col 14}{res}{space 2}-.3707526{col 26}{space 2} 1.059141{col 37}{space 1}   -0.35{col 46}{space 3}0.726{col 54}{space 4} -2.44925{col 67}{space 3} 1.707745
{txt}        /d10 {c |}{col 14}{res}{space 2} 3.865704{col 26}{space 2} 3.916276{col 37}{space 1}    0.99{col 46}{space 3}0.324{col 54}{space 4}-3.819745{col 67}{space 3} 11.55115
{txt}        /d11 {c |}{col 14}{res}{space 2} 62.85813{col 26}{space 2} 102.9986{col 37}{space 1}    0.61{col 46}{space 3}0.542{col 54}{space 4}-139.2702{col 67}{space 3} 264.9864
{txt}        /d12 {c |}{col 14}{res}{space 2}-.0783197{col 26}{space 2}   .14334{col 37}{space 1}   -0.55{col 46}{space 3}0.585{col 54}{space 4}-.3596155{col 67}{space 3} .2029762
{txt}        /d13 {c |}{col 14}{res}{space 2}-17.87474{col 26}{space 2} 16.31402{col 37}{space 1}   -1.10{col 46}{space 3}0.273{col 54}{space 4}-49.88999{col 67}{space 3} 14.14051
{txt}        /d14 {c |}{col 14}{res}{space 2}-1.963485{col 26}{space 2}  2.12887{col 37}{space 1}   -0.92{col 46}{space 3}0.357{col 54}{space 4} -6.14126{col 67}{space 3}  2.21429
{txt}        /d15 {c |}{col 14}{res}{space 2} 63.87119{col 26}{space 2} 102.6298{col 37}{space 1}    0.62{col 46}{space 3}0.534{col 54}{space 4}-137.5334{col 67}{space 3} 265.2758
{txt}        /d16 {c |}{col 14}{res}{space 2} .0013627{col 26}{space 2} .0019226{col 37}{space 1}    0.71{col 46}{space 3}0.479{col 54}{space 4}-.0024103{col 67}{space 3} .0051357
{txt}        /d17 {c |}{col 14}{res}{space 2}-3.379918{col 26}{space 2} 16.22394{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4} -35.2184{col 67}{space 3} 28.45857
{txt}        /d18 {c |}{col 14}{res}{space 2} .0129045{col 26}{space 2} .0112948{col 37}{space 1}    1.14{col 46}{space 3}0.254{col 54}{space 4}-.0092607{col 67}{space 3} .0350698
{txt}        /d19 {c |}{col 14}{res}{space 2} .9300743{col 26}{space 2} 33.54737{col 37}{space 1}    0.03{col 46}{space 3}0.978{col 54}{space 4}-64.90457{col 67}{space 3} 66.76472
{txt}        /d21 {c |}{col 14}{res}{space 2} -92.8365{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d21 taken as constant term in model

{com}. 
. nl(diffeight2008={c -(}d2=-2.121681{c )-}*votefavprob2008+{c -(}d4=5.177406{c )-}*supportdummy2008*votefavprob2008+({c -(}d8=-226{c )-}*votefavprob2008*surprise39+{c -(}d9=350{c )-}*/*
> */votefavprob2008*surprise39*supportdummy2008+{c -(}d10=-188{c )-}+{c -(}d11=222{c )-}*supportdummy2008+{c -(}d12=401{c )-}*votefavprob2008+{c -(}d13=230.896{c )-}*surprise39+/*
> */{c -(}d14=-421{c )-}*supportdummy2008*votefavprob2008+{c -(}d15=-376.212{c )-}*supportdummy2008*surprise39+{c -(}d16=-232{c )-}*votefavprob2008^2+{c -(}d17=-89.34898{c )-}*/*
> */surprise39^2+{c -(}d18=221{c )-}*votefavprob2008^2*supportdummy2008+{c -(}d19=194{c )-}*surprise39^2*supportdummy2008)*exp({c -(}d21=-1.3948{c )-}*adjtime2008)),cluster(case_id)
{txt}(obs = 961)

Iteration 0:  residual SS = {res} 197352.5
{txt}Iteration 1:  residual SS = {res} 196618.3
{txt}Iteration 2:  residual SS = {res} 196311.1
{txt}Iteration 3:  residual SS = {res} 196303.7
{txt}Iteration 4:  residual SS = {res} 196296.2
{txt}Iteration 5:  residual SS = {res} 196296.2

{txt}Nonlinear regression{col 54}Number of obs = {res}      961
{txt}{col 54}R-squared     = {res}   0.1170
{txt}{col 54}Adj R-squared = {res}   0.1161
{txt}{col 54}Root MSE      = {res}  14.3973
{txt}{col 54}Res. dev.     = {res} 7839.149

{txt}{ralign 78:(Std. Err. adjusted for {res:961} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2008{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d2 {c |}{col 14}{res}{space 2}-.0372337{col 26}{space 2} .0327088{col 37}{space 1}   -1.14{col 46}{space 3}0.255{col 54}{space 4}-.1014227{col 67}{space 3} .0269554
{txt}         /d4 {c |}{col 14}{res}{space 2} .0481245{col 26}{space 2} .0338882{col 37}{space 1}    1.42{col 46}{space 3}0.156{col 54}{space 4}-.0183791{col 67}{space 3} .1146281
{txt}         /d8 {c |}{col 14}{res}{space 2}-.1125053{col 26}{space 2} .3201853{col 37}{space 1}   -0.35{col 46}{space 3}0.725{col 54}{space 4}-.7408492{col 67}{space 3} .5158386
{txt}         /d9 {c |}{col 14}{res}{space 2}-.3707526{col 26}{space 2} 1.059141{col 37}{space 1}   -0.35{col 46}{space 3}0.726{col 54}{space 4} -2.44925{col 67}{space 3} 1.707745
{txt}        /d10 {c |}{col 14}{res}{space 2} 2.404665{col 26}{space 2} 3.821871{col 37}{space 1}    0.63{col 46}{space 3}0.529{col 54}{space 4}-5.095522{col 67}{space 3} 9.904851
{txt}        /d11 {c |}{col 14}{res}{space 2} 65.21603{col 26}{space 2} 102.9913{col 37}{space 1}    0.63{col 46}{space 3}0.527{col 54}{space 4} -136.898{col 67}{space 3} 267.3301
{txt}        /d12 {c |}{col 14}{res}{space 2} -.041086{col 26}{space 2} .1470246{col 37}{space 1}   -0.28{col 46}{space 3}0.780{col 54}{space 4}-.3296126{col 67}{space 3} .2474406
{txt}        /d13 {c |}{col 14}{res}{space 2}-17.87474{col 26}{space 2} 16.31402{col 37}{space 1}   -1.10{col 46}{space 3}0.273{col 54}{space 4}-49.88999{col 67}{space 3} 14.14052
{txt}        /d14 {c |}{col 14}{res}{space 2} -2.01161{col 26}{space 2} 2.129139{col 37}{space 1}   -0.94{col 46}{space 3}0.345{col 54}{space 4}-6.189914{col 67}{space 3} 2.166695
{txt}        /d15 {c |}{col 14}{res}{space 2} 63.87119{col 26}{space 2} 102.6298{col 37}{space 1}    0.62{col 46}{space 3}0.534{col 54}{space 4}-137.5335{col 67}{space 3} 265.2758
{txt}        /d16 {c |}{col 14}{res}{space 2} .0013627{col 26}{space 2} .0019226{col 37}{space 1}    0.71{col 46}{space 3}0.479{col 54}{space 4}-.0024103{col 67}{space 3} .0051357
{txt}        /d17 {c |}{col 14}{res}{space 2}-3.379919{col 26}{space 2} 16.22394{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4}-35.21841{col 67}{space 3} 28.45857
{txt}        /d18 {c |}{col 14}{res}{space 2} .0129045{col 26}{space 2} .0112948{col 37}{space 1}    1.14{col 46}{space 3}0.254{col 54}{space 4}-.0092607{col 67}{space 3} .0350698
{txt}        /d19 {c |}{col 14}{res}{space 2} .9300767{col 26}{space 2} 33.54737{col 37}{space 1}    0.03{col 46}{space 3}0.978{col 54}{space 4}-64.90457{col 67}{space 3} 66.76472
{txt}        /d21 {c |}{col 14}{res}{space 2}-76.73807{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d21 taken as constant term in model

{com}. 
. nl(diffeight2008={c -(}d0=2.157388{c )-}+{c -(}d1=-2.793502{c )-}*supportdummy2008+{c -(}d2=-2.121681{c )-}*votefavprob2008+{c -(}d4=5.177406{c )-}*supportdummy2008*votefavprob2008+/*
> */({c -(}d8=-226{c )-}*votefavprob2008*surprise39+{c -(}d9=350{c )-}*votefavprob2008*surprise39*supportdummy2008+{c -(}d10=-188{c )-}+{c -(}d11=222{c )-}*supportdummy2008+{c -(}d12=401{c )-}*/*
> */votefavprob2008+{c -(}d13=230.896{c )-}*surprise39+{c -(}d14=-421{c )-}*supportdummy2008*votefavprob2008+{c -(}d15=-376.212{c )-}*supportdummy2008*surprise39+{c -(}d16=-232{c )-}*/*
> */votefavprob2008^2+{c -(}d17=-89.34898{c )-}*surprise39^2+{c -(}d18=221{c )-}*votefavprob2008^2*supportdummy2008+{c -(}d19=194{c )-}*surprise39^2*supportdummy2008)*/*
> */exp({c -(}d21=-1.3948{c )-}*adjtime2008)), cluster(case_id)
{txt}(obs = 961)

Iteration 0:  residual SS = {res} 196668.4
{txt}Iteration 1:  residual SS = {res} 196161.8
{txt}Iteration 2:  residual SS = {res} 195519.7
{txt}Iteration 3:  residual SS = {res} 195519.7
{txt}Iteration 4:  residual SS = {res} 195434.9
{txt}Iteration 5:  residual SS = {res} 195434.9

{txt}Nonlinear regression{col 54}Number of obs = {res}      961
{txt}{col 54}R-squared     = {res}   0.1209
{txt}{col 54}Adj R-squared = {res}   0.1200
{txt}{col 54}Root MSE      = {res} 14.38087
{txt}{col 54}Res. dev.     = {res} 7834.923

{txt}{ralign 78:(Std. Err. adjusted for {res:961} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2008{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2}-1.427449{col 26}{space 2} .9250341{col 37}{space 1}   -1.54{col 46}{space 3}0.123{col 54}{space 4}-3.242771{col 67}{space 3} .3878735
{txt}         /d1 {c |}{col 14}{res}{space 2} -11.3949{col 26}{space 2}  10.5705{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-32.13885{col 67}{space 3} 9.349055
{txt}         /d2 {c |}{col 14}{res}{space 2}-.0066093{col 26}{space 2} .0355781{col 37}{space 1}   -0.19{col 46}{space 3}0.853{col 54}{space 4}-.0764291{col 67}{space 3} .0632105
{txt}         /d4 {c |}{col 14}{res}{space 2} .1487146{col 26}{space 2} .1138937{col 37}{space 1}    1.31{col 46}{space 3}0.192{col 54}{space 4}-.0747949{col 67}{space 3}  .372224
{txt}         /d8 {c |}{col 14}{res}{space 2}-.1125054{col 26}{space 2}  .320524{col 37}{space 1}   -0.35{col 46}{space 3}0.726{col 54}{space 4}-.7415138{col 67}{space 3} .5165031
{txt}         /d9 {c |}{col 14}{res}{space 2}-.3707524{col 26}{space 2} 1.060261{col 37}{space 1}   -0.35{col 46}{space 3}0.727{col 54}{space 4}-2.451449{col 67}{space 3} 1.709944
{txt}        /d10 {c |}{col 14}{res}{space 2} 3.832113{col 26}{space 2} 3.936153{col 37}{space 1}    0.97{col 46}{space 3}0.331{col 54}{space 4}-3.892344{col 67}{space 3} 11.55657
{txt}        /d11 {c |}{col 14}{res}{space 2} 76.61094{col 26}{space 2} 103.6407{col 37}{space 1}    0.74{col 46}{space 3}0.460{col 54}{space 4}-126.7775{col 67}{space 3} 279.9994
{txt}        /d12 {c |}{col 14}{res}{space 2}-.0717103{col 26}{space 2} .1478365{col 37}{space 1}   -0.49{col 46}{space 3}0.628{col 54}{space 4}-.3618304{col 67}{space 3} .2184097
{txt}        /d13 {c |}{col 14}{res}{space 2}-17.87474{col 26}{space 2} 16.33127{col 37}{space 1}   -1.09{col 46}{space 3}0.274{col 54}{space 4}-49.92385{col 67}{space 3} 14.17438
{txt}        /d14 {c |}{col 14}{res}{space 2}  -2.1122{col 26}{space 2} 2.134163{col 37}{space 1}   -0.99{col 46}{space 3}0.323{col 54}{space 4}-6.300362{col 67}{space 3} 2.075962
{txt}        /d15 {c |}{col 14}{res}{space 2} 63.87118{col 26}{space 2} 102.7383{col 37}{space 1}    0.62{col 46}{space 3}0.534{col 54}{space 4}-137.7465{col 67}{space 3} 265.4888
{txt}        /d16 {c |}{col 14}{res}{space 2} .0013627{col 26}{space 2} .0019246{col 37}{space 1}    0.71{col 46}{space 3}0.479{col 54}{space 4}-.0024143{col 67}{space 3} .0051397
{txt}        /d17 {c |}{col 14}{res}{space 2} -3.37992{col 26}{space 2}  16.2411{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4}-35.25208{col 67}{space 3} 28.49224
{txt}        /d18 {c |}{col 14}{res}{space 2} .0129045{col 26}{space 2} .0113067{col 37}{space 1}    1.14{col 46}{space 3}0.254{col 54}{space 4}-.0092842{col 67}{space 3} .0350932
{txt}        /d19 {c |}{col 14}{res}{space 2} .9300767{col 26}{space 2} 33.58285{col 37}{space 1}    0.03{col 46}{space 3}0.978{col 54}{space 4} -64.9742{col 67}{space 3} 66.83435
{txt}        /d21 {c |}{col 14}{res}{space 2}-65.45424{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d21 taken as constant term in model

{com}. 
. nl(diffeight2008=({c -(}d8=-226{c )-}*votefavprob2008*surprise39+{c -(}d9=350{c )-}*votefavprob2008*surprise39*supportdummy2008+{c -(}d10=-188{c )-}+{c -(}d11=222{c )-}*supportdummy2008/*
> */+{c -(}d12=401{c )-}*votefavprob2008+{c -(}d13=230.896{c )-}*surprise39+{c -(}d14=-421{c )-}*supportdummy2008*votefavprob2008+{c -(}d15=-376.212{c )-}*/*
> */supportdummy2008*surprise39+{c -(}d16=-232{c )-}*votefavprob2008^2+{c -(}d17=-89.34898{c )-}*surprise39^2+{c -(}d18=221{c )-}*votefavprob2008^2*supportdummy2008+/*
> */{c -(}d19=194{c )-}*surprise39^2*supportdummy2008)*exp({c -(}d21=-1.3948{c )-}*adjtime2008)), cluster(case_id)
{txt}(obs = 961)

Iteration 0:  residual SS = {res} 197512.3
{txt}Iteration 1:  residual SS = {res} 196938.7
{txt}Iteration 2:  residual SS = {res} 196648.6
{txt}Iteration 3:  residual SS = {res} 196621.7
{txt}Iteration 4:  residual SS = {res} 196621.6
{txt}Iteration 5:  residual SS = {res} 196621.6
{txt}Iteration 6:  residual SS = {res} 196621.6

{txt}Nonlinear regression{col 54}Number of obs = {res}      961
{txt}{col 54}R-squared     = {res}   0.1156
{txt}{col 54}Adj R-squared = {res}   0.1147
{txt}{col 54}Root MSE      = {res} 14.39403
{txt}{col 54}Res. dev.     = {res} 7840.741

{txt}{ralign 78:(Std. Err. adjusted for {res:961} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2008{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d8 {c |}{col 14}{res}{space 2}-.1125052{col 26}{space 2} .3198478{col 37}{space 1}   -0.35{col 46}{space 3}0.725{col 54}{space 4}-.7401867{col 67}{space 3} .5151762
{txt}         /d9 {c |}{col 14}{res}{space 2}-.3707525{col 26}{space 2} 1.058024{col 37}{space 1}   -0.35{col 46}{space 3}0.726{col 54}{space 4}-2.447059{col 67}{space 3} 1.705554
{txt}        /d10 {c |}{col 14}{res}{space 2} 2.404665{col 26}{space 2} 3.817842{col 37}{space 1}    0.63{col 46}{space 3}0.529{col 54}{space 4}-5.087614{col 67}{space 3} 9.896944
{txt}        /d11 {c |}{col 14}{res}{space 2} 65.21604{col 26}{space 2} 102.8827{col 37}{space 1}    0.63{col 46}{space 3}0.526{col 54}{space 4}-136.6849{col 67}{space 3}  267.117
{txt}        /d12 {c |}{col 14}{res}{space 2}-.0783197{col 26}{space 2} .1431889{col 37}{space 1}   -0.55{col 46}{space 3}0.585{col 54}{space 4} -.359319{col 67}{space 3} .2026796
{txt}        /d13 {c |}{col 14}{res}{space 2}-17.87474{col 26}{space 2} 16.29682{col 37}{space 1}   -1.10{col 46}{space 3}0.273{col 54}{space 4}-49.85624{col 67}{space 3} 14.10676
{txt}        /d14 {c |}{col 14}{res}{space 2}-1.963485{col 26}{space 2} 2.126625{col 37}{space 1}   -0.92{col 46}{space 3}0.356{col 54}{space 4}-6.136856{col 67}{space 3} 2.209885
{txt}        /d15 {c |}{col 14}{res}{space 2} 63.87118{col 26}{space 2} 102.5216{col 37}{space 1}    0.62{col 46}{space 3}0.533{col 54}{space 4}-137.3211{col 67}{space 3} 265.0635
{txt}        /d16 {c |}{col 14}{res}{space 2} .0013627{col 26}{space 2} .0019206{col 37}{space 1}    0.71{col 46}{space 3}0.478{col 54}{space 4}-.0024063{col 67}{space 3} .0051317
{txt}        /d17 {c |}{col 14}{res}{space 2}-3.379917{col 26}{space 2} 16.20684{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4}-35.18484{col 67}{space 3}   28.425
{txt}        /d18 {c |}{col 14}{res}{space 2} .0129045{col 26}{space 2} .0112828{col 37}{space 1}    1.14{col 46}{space 3}0.253{col 54}{space 4}-.0092374{col 67}{space 3} .0350464
{txt}        /d19 {c |}{col 14}{res}{space 2} .9300764{col 26}{space 2}   33.512{col 37}{space 1}    0.03{col 46}{space 3}0.978{col 54}{space 4}-64.83516{col 67}{space 3} 66.69531
{txt}        /d21 {c |}{col 14}{res}{space 2}-15414.64{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d21 taken as constant term in model

{com}. 
.         restore
{txt}
{com}.         preserve 
{txt}
{com}.         
.         drop if diffeight2008==.
{txt}(11376 observations deleted)

{com}.         drop if supportdummy2008==.
{txt}(562 observations deleted)

{com}.         drop if votefavprob2008==.
{txt}(0 observations deleted)

{com}.         drop if surprise39==.
{txt}(1 observation deleted)

{com}.         drop if adjtime2008==.
{txt}(8 observations deleted)

{com}.         
.         ///RA4///
>         
.         ///with Adjtime///
> 
. 
. nl(diffeight2008={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2008+({c -(}d8=0{c )-}*votefavprob2008*surprise39+{c -(}d9=0{c )-}*votefavprob2008*surprise39*supportdummy2008)*/*
> */exp({c -(}d20=0{c )-}+{c -(}d21=0{c )-}*adjtime2008+{c -(}d22=0{c )-}*adjtime2008*supportdummy2008+{c -(}d23=0{c )-}*adjtime2008*votefavprob2008+{c -(}d24=0{c )-}*adjtime2008*/*
> */surprise39+{c -(}d25=0{c )-}*adjtime2008*votefavprob2008*supportdummy2008+{c -(}d26=0{c )-}*adjtime2008*surprise39*supportdummy2008+{c -(}d27=0{c )-}*/*
> */adjtime2008*surprise39*votefavprob2008+{c -(}d28=0{c )-}*adjtime2008*surprise39*votefavprob2008*supportdummy2008)), cluster(case_id)
{txt}(obs = 961)

Iteration 0:  residual SS = {res} 208660.2
{txt}Iteration 1:  residual SS = {res} 208648.5
{txt}Iteration 2:  residual SS = {res} 208554.4
{txt}Iteration 3:  residual SS = {res} 208528.2
{txt}Iteration 4:  residual SS = {res} 208307.5
{txt}Iteration 5:  residual SS = {res} 208280.7
{txt}Iteration 6:  residual SS = {res} 208266.2
{txt}Iteration 7:  residual SS = {res} 208256.3
{txt}Iteration 8:  residual SS = {res} 208251.8
{txt}Iteration 9:  residual SS = {res} 208250.6
{txt}Iteration 10:  residual SS = {res} 208250.2
{txt}Iteration 11:  residual SS = {res} 208249.4
{txt}Iteration 12:  residual SS = {res} 208249.3
{txt}Iteration 13:  residual SS = {res} 208249.3
{txt}Iteration 14:  residual SS = {res} 208249.3
{txt}Iteration 15:  residual SS = {res} 208249.3
{txt}Iteration 16:  residual SS = {res} 208249.2
{txt}Iteration 17:  residual SS = {res} 208249.2
{txt}Iteration 18:  residual SS = {res} 208249.2
{txt}Iteration 19:  residual SS = {res} 208249.2
{txt}Iteration 20:  residual SS = {res} 208249.2
{txt}Iteration 21:  residual SS = {res} 208249.2
{txt}Iteration 22:  residual SS = {res} 208249.2
{txt}Iteration 23:  residual SS = {res} 208249.2
{txt}Iteration 24:  residual SS = {res} 208249.2
{txt}Iteration 25:  residual SS = {res} 208249.2
{txt}Iteration 26:  residual SS = {res} 208249.2
{txt}Iteration 27:  residual SS = {res} 208249.2
{txt}Iteration 28:  residual SS = {res} 208249.2
{txt}Iteration 29:  residual SS = {res} 208249.2
{txt}Iteration 30:  residual SS = {res} 208249.2
{txt}Iteration 31:  residual SS = {res} 208249.2
{txt}Iteration 32:  residual SS = {res} 208249.2
{txt}Iteration 33:  residual SS = {res} 208249.2
{txt}Iteration 34:  residual SS = {res} 208249.2
{txt}Iteration 35:  residual SS = {res} 208249.2
{txt}Iteration 36:  residual SS = {res} 208249.2
{txt}Iteration 37:  residual SS = {res} 208249.2
{txt}Iteration 38:  residual SS = {res} 208249.2
{txt}Iteration 39:  residual SS = {res} 208249.2
{txt}Iteration 40:  residual SS = {res} 208249.2
{txt}Iteration 41:  residual SS = {res} 208249.2
{txt}Iteration 42:  residual SS = {res} 208249.2
{txt}Iteration 43:  residual SS = {res} 208249.2
{txt}Iteration 44:  residual SS = {res} 208249.2
{txt}Iteration 45:  residual SS = {res} 208249.2
{txt}Iteration 46:  residual SS = {res} 208249.2
{txt}Iteration 47:  residual SS = {res} 208249.2
{txt}Iteration 48:  residual SS = {res} 208249.2
{txt}Iteration 49:  residual SS = {res} 208249.2

{txt}Nonlinear regression{col 54}Number of obs = {res}      961
{txt}{col 54}R-squared     = {res}   0.0633
{txt}{col 54}Adj R-squared = {res}   0.0623
{txt}{col 54}Root MSE      = {res} 14.81353
{txt}{col 54}Res. dev.     = {res} 7895.954

{txt}{ralign 78:(Std. Err. adjusted for {res:961} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2008{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2}-4.792033{col 26}{space 2} .7099326{col 37}{space 1}   -6.75{col 46}{space 3}0.000{col 54}{space 4}-6.185232{col 67}{space 3}-3.398835
{txt}         /d1 {c |}{col 14}{res}{space 2} 6.976918{col 26}{space 2} 1.379616{col 37}{space 1}    5.06{col 46}{space 3}0.000{col 54}{space 4} 4.269506{col 67}{space 3}  9.68433
{txt}         /d8 {c |}{col 14}{res}{space 2} .0118539{col 26}{space 2} .0529771{col 37}{space 1}    0.22{col 46}{space 3}0.823{col 54}{space 4}-.0921103{col 67}{space 3} .1158182
{txt}         /d9 {c |}{col 14}{res}{space 2} .0043767{col 26}{space 2} .0581905{col 37}{space 1}    0.08{col 46}{space 3}0.940{col 54}{space 4}-.1098185{col 67}{space 3} .1185719
{txt}        /d20 {c |}{col 14}{res}{space 2} .5225228{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}        /d21 {c |}{col 14}{res}{space 2}-.3559921{col 26}{space 2} .5295565{col 37}{space 1}   -0.67{col 46}{space 3}0.502{col 54}{space 4}-1.395214{col 67}{space 3} .6832297
{txt}        /d22 {c |}{col 14}{res}{space 2} 1.913738{col 26}{space 2} 2.869051{col 37}{space 1}    0.67{col 46}{space 3}0.505{col 54}{space 4}-3.716597{col 67}{space 3} 7.544073
{txt}        /d23 {c |}{col 14}{res}{space 2} .0150932{col 26}{space 2} .0191626{col 37}{space 1}    0.79{col 46}{space 3}0.431{col 54}{space 4}-.0225122{col 67}{space 3} .0526985
{txt}        /d24 {c |}{col 14}{res}{space 2} 1.082215{col 26}{space 2} 1.444035{col 37}{space 1}    0.75{col 46}{space 3}0.454{col 54}{space 4}-1.751614{col 67}{space 3} 3.916044
{txt}        /d25 {c |}{col 14}{res}{space 2}-.0359925{col 26}{space 2} .0422998{col 37}{space 1}   -0.85{col 46}{space 3}0.395{col 54}{space 4}-.1190032{col 67}{space 3} .0470182
{txt}        /d26 {c |}{col 14}{res}{space 2}-2.680759{col 26}{space 2} 3.621419{col 37}{space 1}   -0.74{col 46}{space 3}0.459{col 54}{space 4} -9.78757{col 67}{space 3} 4.426053
{txt}        /d27 {c |}{col 14}{res}{space 2}-.0284137{col 26}{space 2} .0277863{col 37}{space 1}   -1.02{col 46}{space 3}0.307{col 54}{space 4}-.0829426{col 67}{space 3} .0261152
{txt}        /d28 {c |}{col 14}{res}{space 2} .0551072{col 26}{space 2}  .056235{col 37}{space 1}    0.98{col 46}{space 3}0.327{col 54}{space 4}-.0552504{col 67}{space 3} .1654649
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
. nl(diffeight2008={c -(}d2=0{c )-}*votefavprob2008+{c -(}d4=0{c )-}*supportdummy2008*votefavprob2008+({c -(}d8=0{c )-}*votefavprob2008*surprise39+{c -(}d9=0{c )-}*votefavprob2008*/*
> */surprise39*supportdummy2008)*exp({c -(}d20=0{c )-}+{c -(}d21=0{c )-}*adjtime2008+{c -(}d22=0{c )-}*adjtime2008*supportdummy2008+{c -(}d23=0{c )-}*adjtime2008*/*
> */votefavprob2008+{c -(}d24=0{c )-}*adjtime2008*surprise39+{c -(}d25=0{c )-}*adjtime2008*votefavprob2008*supportdummy2008+{c -(}d26=0{c )-}*adjtime2008*surprise39*/*
> */supportdummy2008+{c -(}d27=0{c )-}*adjtime2008*surprise39*votefavprob2008+{c -(}d28=0{c )-}*adjtime2008*surprise39*votefavprob2008*supportdummy2008)), cluster(case_id)
{txt}(obs = 961)

Iteration 0:  residual SS = {res}   218485
{txt}Iteration 1:  residual SS = {res} 218482.7
{txt}Iteration 2:  residual SS = {res} 218441.7
{txt}Iteration 3:  residual SS = {res} 218180.3
{txt}Iteration 4:  residual SS = {res} 218161.4
{txt}Iteration 5:  residual SS = {res} 218143.3
{txt}Iteration 6:  residual SS = {res} 217889.6
{txt}Iteration 7:  residual SS = {res}   217271
{txt}Iteration 8:  residual SS = {res} 217243.7
{txt}Iteration 9:  residual SS = {res} 217228.3
{txt}Iteration 10:  residual SS = {res} 217169.1
{txt}Iteration 11:  residual SS = {res} 217140.1
{txt}Iteration 12:  residual SS = {res} 217073.9
{txt}Iteration 13:  residual SS = {res} 217056.4
{txt}Iteration 14:  residual SS = {res} 217048.9
{txt}Iteration 15:  residual SS = {res} 217044.3
{txt}Iteration 16:  residual SS = {res} 217042.9
{txt}Iteration 17:  residual SS = {res} 217039.3
{txt}Iteration 18:  residual SS = {res} 217038.8
{txt}Iteration 19:  residual SS = {res} 217038.8
{txt}Iteration 20:  residual SS = {res} 217038.6
{txt}Iteration 21:  residual SS = {res} 217038.6
{txt}Iteration 22:  residual SS = {res} 217038.6

{txt}Nonlinear regression{col 54}Number of obs = {res}      961
{txt}{col 54}R-squared     = {res}   0.0280
{txt}{col 54}Adj R-squared = {res}   0.0269
{txt}{col 54}Root MSE      = {res} 15.12291
{txt}{col 54}Res. dev.     = {res} 7935.681

{txt}{ralign 78:(Std. Err. adjusted for {res:961} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2008{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d2 {c |}{col 14}{res}{space 2}  -.00613{col 26}{space 2} .0410561{col 37}{space 1}   -0.15{col 46}{space 3}0.881{col 54}{space 4}-.0867002{col 67}{space 3} .0744401
{txt}         /d4 {c |}{col 14}{res}{space 2} .0455737{col 26}{space 2} .0431846{col 37}{space 1}    1.06{col 46}{space 3}0.292{col 54}{space 4}-.0391733{col 67}{space 3} .1303208
{txt}         /d8 {c |}{col 14}{res}{space 2}-.5180164{col 26}{space 2} .3682904{col 37}{space 1}   -1.41{col 46}{space 3}0.160{col 54}{space 4}-1.240764{col 67}{space 3} .2047308
{txt}         /d9 {c |}{col 14}{res}{space 2} .4821756{col 26}{space 2}  .371425{col 37}{space 1}    1.30{col 46}{space 3}0.195{col 54}{space 4}-.2467231{col 67}{space 3} 1.211074
{txt}        /d20 {c |}{col 14}{res}{space 2}-.2791907{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}        /d21 {c |}{col 14}{res}{space 2} 1.179625{col 26}{space 2} 4.569813{col 37}{space 1}    0.26{col 46}{space 3}0.796{col 54}{space 4} -7.78835{col 67}{space 3}  10.1476
{txt}        /d22 {c |}{col 14}{res}{space 2}-.8849788{col 26}{space 2} 5.200006{col 37}{space 1}   -0.17{col 46}{space 3}0.865{col 54}{space 4}-11.08967{col 67}{space 3} 9.319712
{txt}        /d23 {c |}{col 14}{res}{space 2}-.0069431{col 26}{space 2} .1217751{col 37}{space 1}   -0.06{col 46}{space 3}0.955{col 54}{space 4}-.2459191{col 67}{space 3}  .232033
{txt}        /d24 {c |}{col 14}{res}{space 2}-2.718258{col 26}{space 2} 11.43828{col 37}{space 1}   -0.24{col 46}{space 3}0.812{col 54}{space 4}-25.16517{col 67}{space 3} 19.72865
{txt}        /d25 {c |}{col 14}{res}{space 2} .0045459{col 26}{space 2} .1242721{col 37}{space 1}    0.04{col 46}{space 3}0.971{col 54}{space 4}-.2393305{col 67}{space 3} .2484222
{txt}        /d26 {c |}{col 14}{res}{space 2} .3521544{col 26}{space 2} 27.31141{col 37}{space 1}    0.01{col 46}{space 3}0.990{col 54}{space 4} -53.2448{col 67}{space 3} 53.94911
{txt}        /d27 {c |}{col 14}{res}{space 2}-.0566655{col 26}{space 2} .3509252{col 37}{space 1}   -0.16{col 46}{space 3}0.872{col 54}{space 4}-.7453345{col 67}{space 3} .6320036
{txt}        /d28 {c |}{col 14}{res}{space 2}  .079612{col 26}{space 2} .4296471{col 37}{space 1}    0.19{col 46}{space 3}0.853{col 54}{space 4}-.7635439{col 67}{space 3} .9227678
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. nl(diffeight2008={c -(}d0=0{c )-}+{c -(}d1=0{c )-}*supportdummy2008+{c -(}d2=0{c )-}*votefavprob2008+{c -(}d4=0{c )-}*supportdummy2008*votefavprob2008+({c -(}d8=0{c )-}*votefavprob2008*/*
> */surprise39+{c -(}d9=0{c )-}*votefavprob2008*surprise39*supportdummy2008)*exp({c -(}d20=0{c )-}+{c -(}d21=0{c )-}*adjtime2008+{c -(}d22=0{c )-}*adjtime2008*/*
> */supportdummy2008+{c -(}d23=0{c )-}*adjtime2008*votefavprob2008+{c -(}d24=0{c )-}*adjtime2008*surprise39+{c -(}d25=0{c )-}*adjtime2008*votefavprob2008*supportdummy2008/*
> */+{c -(}d26=0{c )-}*adjtime2008*surprise39*supportdummy2008+{c -(}d27=0{c )-}*adjtime2008*surprise39*votefavprob2008+{c -(}d28=0{c )-}*adjtime2008*surprise39*votefavprob2008*supportdummy2008)), cluster(case_id)
{txt}(obs = 961)

Iteration 0:  residual SS = {res} 207736.6
{txt}Iteration 1:  residual SS = {res} 207735.6
{txt}Iteration 2:  residual SS = {res} 207564.5
{txt}Iteration 3:  residual SS = {res} 207491.7
{txt}Iteration 4:  residual SS = {res} 207329.5
{txt}Iteration 5:  residual SS = {res} 207309.2
{txt}Iteration 6:  residual SS = {res} 206875.7
{txt}Iteration 7:  residual SS = {res} 206840.1
{txt}Iteration 8:  residual SS = {res} 206835.9
{txt}Iteration 9:  residual SS = {res} 206835.4
{txt}Iteration 10:  residual SS = {res}   206834
{txt}Iteration 11:  residual SS = {res} 206833.7
{txt}Iteration 12:  residual SS = {res} 206833.6
{txt}Iteration 13:  residual SS = {res} 206833.5
{txt}Iteration 14:  residual SS = {res} 206833.4
{txt}Iteration 15:  residual SS = {res} 206833.4
{txt}Iteration 16:  residual SS = {res} 206833.3
{txt}Iteration 17:  residual SS = {res} 206833.3
{txt}Iteration 18:  residual SS = {res} 206833.3
{txt}Iteration 19:  residual SS = {res} 206833.3
{txt}Iteration 20:  residual SS = {res} 206833.3
{txt}Iteration 21:  residual SS = {res} 206833.3
{txt}Iteration 22:  residual SS = {res} 206833.3
{txt}Iteration 23:  residual SS = {res} 206833.3
{txt}Iteration 24:  residual SS = {res} 206833.3
{txt}Iteration 25:  residual SS = {res} 206833.3
{txt}Iteration 26:  residual SS = {res} 206833.3
{txt}Iteration 27:  residual SS = {res} 206833.3
{txt}Iteration 28:  residual SS = {res} 206833.3
{txt}Iteration 29:  residual SS = {res} 206833.3
{txt}Iteration 30:  residual SS = {res} 206833.3
{txt}Iteration 31:  residual SS = {res} 206833.3
{txt}Iteration 32:  residual SS = {res} 206833.3
{txt}Iteration 33:  residual SS = {res} 206833.3
{txt}Iteration 34:  residual SS = {res} 206833.3
{txt}Iteration 35:  residual SS = {res} 206833.3
{txt}Iteration 36:  residual SS = {res} 206833.3
{txt}Iteration 37:  residual SS = {res} 206833.3
{txt}Iteration 38:  residual SS = {res} 206833.3
{txt}Iteration 39:  residual SS = {res} 206833.3
{txt}Iteration 40:  residual SS = {res} 206833.3
{txt}Iteration 41:  residual SS = {res} 206833.3

{txt}Nonlinear regression{col 54}Number of obs = {res}      961
{txt}{col 54}R-squared     = {res}   0.0696
{txt}{col 54}Adj R-squared = {res}   0.0687
{txt}{col 54}Root MSE      = {res} 14.77867
{txt}{col 54}Res. dev.     = {res} 7889.398

{txt}{ralign 78:(Std. Err. adjusted for {res:961} clusters in case_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}diffeig~2008{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
         /d0 {c |}{col 14}{res}{space 2}-4.809456{col 26}{space 2} .7180001{col 37}{space 1}   -6.70{col 46}{space 3}0.000{col 54}{space 4}-6.218487{col 67}{space 3}-3.400425
{txt}         /d1 {c |}{col 14}{res}{space 2}  -8.3434{col 26}{space 2}  9.50729{col 37}{space 1}   -0.88{col 46}{space 3}0.380{col 54}{space 4}-27.00087{col 67}{space 3} 10.31407
{txt}         /d2 {c |}{col 14}{res}{space 2} .0987302{col 26}{space 2} .0574141{col 37}{space 1}    1.72{col 46}{space 3}0.086{col 54}{space 4}-.0139414{col 67}{space 3} .2114017
{txt}         /d4 {c |}{col 14}{res}{space 2}  .057465{col 26}{space 2} .1128038{col 37}{space 1}    0.51{col 46}{space 3}0.611{col 54}{space 4}-.1639056{col 67}{space 3} .2788355
{txt}         /d8 {c |}{col 14}{res}{space 2}-.3076219{col 26}{space 2} .2169048{col 37}{space 1}   -1.42{col 46}{space 3}0.156{col 54}{space 4}-.7332841{col 67}{space 3} .1180404
{txt}         /d9 {c |}{col 14}{res}{space 2} .3385396{col 26}{space 2} .2193581{col 37}{space 1}    1.54{col 46}{space 3}0.123{col 54}{space 4}-.0919372{col 67}{space 3} .7690164
{txt}        /d20 {c |}{col 14}{res}{space 2}  .227275{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}        /d21 {c |}{col 14}{res}{space 2} 4.348995{col 26}{space 2} 4.617791{col 37}{space 1}    0.94{col 46}{space 3}0.347{col 54}{space 4}-4.713134{col 67}{space 3} 13.41112
{txt}        /d22 {c |}{col 14}{res}{space 2}-2.315528{col 26}{space 2} 4.979801{col 37}{space 1}   -0.46{col 46}{space 3}0.642{col 54}{space 4}-12.08808{col 67}{space 3} 7.457023
{txt}        /d23 {c |}{col 14}{res}{space 2}-.0723993{col 26}{space 2}  .061359{col 37}{space 1}   -1.18{col 46}{space 3}0.238{col 54}{space 4}-.1928126{col 67}{space 3}  .048014
{txt}        /d24 {c |}{col 14}{res}{space 2}-16.69735{col 26}{space 2} 24.75064{col 37}{space 1}   -0.67{col 46}{space 3}0.500{col 54}{space 4}-65.26896{col 67}{space 3} 31.87426
{txt}        /d25 {c |}{col 14}{res}{space 2} .0451749{col 26}{space 2} .0662684{col 37}{space 1}    0.68{col 46}{space 3}0.496{col 54}{space 4}-.0848728{col 67}{space 3} .1752226
{txt}        /d26 {c |}{col 14}{res}{space 2} 14.83301{col 26}{space 2} 24.84037{col 37}{space 1}    0.60{col 46}{space 3}0.551{col 54}{space 4}-33.91468{col 67}{space 3}  63.5807
{txt}        /d27 {c |}{col 14}{res}{space 2} .2220912{col 26}{space 2} .2540343{col 37}{space 1}    0.87{col 46}{space 3}0.382{col 54}{space 4}-.2764355{col 67}{space 3} .7206178
{txt}        /d28 {c |}{col 14}{res}{space 2}-.1908303{col 26}{space 2} .2560995{col 37}{space 1}   -0.75{col 46}{space 3}0.456{col 54}{space 4}-.6934097{col 67}{space 3} .3117491
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
  Parameter d0 taken as constant term in model

{com}. 
. nl(diffeight2008=({c -(}d8=0{c )-}*votefavprob2008*surprise39+{c -(}d9=0{c )-}*votefavprob2008*surprise39*supportdummy2008)*exp({c -(}d20=0{c )-}+{c -(}d21=0{c )-}*/*
> */adjtime2008+{c -(}d22=0{c )-}*adjtime2008*supportdummy2008+{c -(}d23=0{c )-}*adjtime2008*votefavprob2008+{c -(}d24=0{c )-}*adjtime2008*surprise39+{c -(}d25=0{c )-}*adjtime2008*/*
> */votefavprob2008*supportdummy2008+{c -(}d26=0{c )-}*adjtime2008*surprise39*supportdummy2008+{c -(}d27=0{c )-}*adjtime2008*surprise39*votefavprob2008/*
> */+{c -(}d28=0{c )-}*adjtime2008*surprise39*votefavprob2008*supportdummy2008)), cluster(case_id)
{txt}(obs = 961)

Iteration 0:  residual SS = {res} 219747.9
{txt}Iteration 1:  residual SS = {res} 219747.6
{txt}Iteration 2:  residual SS = {res} 219367.1
{txt}Iteration 3:  residual SS = {res} 219033.2
{txt}Iteration 4:  residual SS = {res} 218978.9
{txt}Iteration 5:  residual SS = {res} 218787.6
{txt}Iteration 6:  residual SS = {res} 218774.5
{txt}Iteration 7:  residual SS = {res} 218762.9
{txt}Iteration 8:  residual SS = {res} 218746.5
{txt}Iteration 9:  residual SS = {res} 218744.1
{txt}Iteration 10:  residual SS = {res} 218742.9
{txt}Iteration 11:  residual SS = {res} 218742.1
{txt}Iteration 12:  residual SS = {res} 218741.5
{txt}Iteration 13:  residual SS = {res} 218741.4
{txt}Iteration 14:  residual SS = {res}   218741
{txt}Iteration 15:  residual SS = {res} 218740.9
{txt}Iteration 16:  residual SS = {res} 218740.8
{txt}Iteration 17:  residual SS = {res} 218740.8
{txt}Iteration 18:  residual SS = {res} 218740.7
{txt}Iteration 19:  residual SS = {res} 218740.7
{txt}Iteration 20:  residual SS = {res} 218740.7
{txt}Iteration 21:  residual SS = {res} 218740.7
{txt}Iteration 22:  residual SS = {res} 218740.7
{txt}Iteration 23:  